[Killed] BlockStatement
core/auth/guards/auth.guard.ts:10:36
 export class AuthGuard implements CanActivate {
   private router = inject(Router);
 
-  canActivate(): boolean | UrlTree {
-    // In a real app, you would check if the user is authenticated
-    // For now, we'll simulate authentication
-    const isAuthenticated = this.checkAuth();
-
-    if (isAuthenticated) {
-      return true;
-    }
-
-    // Redirect to login page if not authenticated
-    return this.router.createUrlTree(['/login']);
-  }
+  canActivate(): boolean | UrlTree {}
 
   private checkAuth(): boolean {
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
core/auth/guards/auth.guard.ts:15:9
     // For now, we'll simulate authentication
     const isAuthenticated = this.checkAuth();
 
-    if (isAuthenticated) {
+    if (false) {
       return true;
     }
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: {"_queryParamMap": undefined, "fragment": null, "queryParams": {}, "root": {"children": {"primary": {"children": {}, "parent": [Circular], "segments": [{"_parameterMap": undefined, "parameters": {}, "path": "login"}]}}, "parent": null, "segments": []}}

[Killed] BlockStatement
core/auth/guards/auth.guard.ts:15:26
     // For now, we'll simulate authentication
     const isAuthenticated = this.checkAuth();
 
-    if (isAuthenticated) {
-      return true;
-    }
+    if (isAuthenticated) {}
 
     // Redirect to login page if not authenticated
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: {"_queryParamMap": undefined, "fragment": null, "queryParams": {}, "root": {"children": {"primary": {"children": {}, "parent": [Circular], "segments": [{"_parameterMap": undefined, "parameters": {}, "path": "login"}]}}, "parent": null, "segments": []}}

[Killed] BooleanLiteral
core/auth/guards/auth.guard.ts:16:14
     const isAuthenticated = this.checkAuth();
 
     if (isAuthenticated) {
-      return true;
+      return false;
     }
 
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
core/auth/guards/auth.guard.ts:20:39
     }
 
     // Redirect to login page if not authenticated
-    return this.router.createUrlTree(['/login']);
+    return this.router.createUrlTree([""]);
   }
 
killedBy: AuthGuard should return a UrlTree redirecting to /login when user is not authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/login",
+   "",

[Killed] BlockStatement
core/auth/guards/auth.guard.ts:23:32
     return this.router.createUrlTree(['/login']);
   }
 
-  private checkAuth(): boolean {
-    // This would typically check for a token/session in localStorage/cookies
-    // For demo purposes, we'll just return true to allow access
-    // In a real application, you'd implement proper authentication logic here
-    return true;
-  }
+  private checkAuth(): boolean {}
 }
 
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: {"_queryParamMap": undefined, "fragment": null, "queryParams": {}, "root": {"children": {"primary": {"children": {}, "parent": [Circular], "segments": [{"_parameterMap": undefined, "parameters": {}, "path": "login"}]}}, "parent": null, "segments": []}}

[Killed] BooleanLiteral
core/auth/guards/auth.guard.ts:27:12
     // This would typically check for a token/session in localStorage/cookies
     // For demo purposes, we'll just return true to allow access
     // In a real application, you'd implement proper authentication logic here
-    return true;
+    return false;
   }
 }
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: {"_queryParamMap": undefined, "fragment": null, "queryParams": {}, "root": {"children": {"primary": {"children": {}, "parent": [Circular], "segments": [{"_parameterMap": undefined, "parameters": {}, "path": "login"}]}}, "parent": null, "segments": []}}
