[Killed] StringLiteral
src/app/app.routes.ts:13:47
 import { AuthGuard } from './core/auth/guards/auth.guard';
 
 export const routes: Routes = [
-  { path: '', redirectTo: 'login', pathMatch: 'full' },
+  { path: '', redirectTo: 'login', pathMatch: "" },
   { path: 'login', component: LoginPage },
   {
killedBy: app.routes should have a root redirect to login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "full"
Received: ""

[Killed] StringLiteral
src/app/app.routes.ts:13:11
 import { AuthGuard } from './core/auth/guards/auth.guard';
 
 export const routes: Routes = [
-  { path: '', redirectTo: 'login', pathMatch: 'full' },
+  { path: "Stryker was here!", redirectTo: 'login', pathMatch: 'full' },
   { path: 'login', component: LoginPage },
   {
killedBy: app.routes should have a root redirect to login
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] StringLiteral
src/app/app.routes.ts:16:11
   { path: '', redirectTo: 'login', pathMatch: 'full' },
   { path: 'login', component: LoginPage },
   {
-    path: 'customers',
+    path: "",
     component: CustomersTable,
     canDeactivate: [PendingChangesGuard],
killedBy: app.routes should have a customers route with CustomersTable and guards
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArrayDeclaration
src/app/app.routes.ts:18:20
   {
     path: 'customers',
     component: CustomersTable,
-    canDeactivate: [PendingChangesGuard],
+    canDeactivate: [],
     runGuardsAndResolvers: 'always',
     canActivate: [AuthGuard],
killedBy: app.routes should have a customers route with CustomersTable and guards
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: [Function PendingChangesGuard]
Received array: []

[Killed] StringLiteral
src/app/app.routes.ts:19:28
     path: 'customers',
     component: CustomersTable,
     canDeactivate: [PendingChangesGuard],
-    runGuardsAndResolvers: 'always',
+    runGuardsAndResolvers: "",
     canActivate: [AuthGuard],
   },
killedBy: app.routes should have a customers route with CustomersTable and guards
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "always"
Received: ""

[Killed] StringLiteral
src/app/app.routes.ts:23:11
     canActivate: [AuthGuard],
   },
   {
-    path: 'customers/new',
+    path: "",
     component: CustomersTable,
     canDeactivate: [PendingChangesGuard],
killedBy: app.routes should have a customers/new route
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArrayDeclaration
src/app/app.routes.ts:34:18
     component: CustomersTable,
     canDeactivate: [PendingChangesGuard],
     runGuardsAndResolvers: 'always',
-    canActivate: [AuthGuard],
+    canActivate: [],
   },
   {
killedBy: app.routes should have a customers/:id route
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: [Function AuthGuard]
Received array: []

[Killed] ObjectLiteral
src/app/app.routes.ts:36:3
     runGuardsAndResolvers: 'always',
     canActivate: [AuthGuard],
   },
-  {
-    path: 'customers/:id/edit',
-    component: CustomersTable,
-    canDeactivate: [PendingChangesGuard],
-    runGuardsAndResolvers: 'always',
-    canActivate: [AuthGuard],
-  },
+  {},
   { path: 'user', component: UserPage, canActivate: [AuthGuard] },
   { path: 'products', component: ProductsPage, canActivate: [AuthGuard] },
killedBy: app.routes should have a customers/:id/edit route
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
src/app/app.routes.ts:43:3
     runGuardsAndResolvers: 'always',
     canActivate: [AuthGuard],
   },
-  { path: 'user', component: UserPage, canActivate: [AuthGuard] },
+  {},
   { path: 'products', component: ProductsPage, canActivate: [AuthGuard] },
   { path: 'cart', component: CartPage, canActivate: [AuthGuard] },
killedBy: app.routes should have a user route with AuthGuard
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] StringLiteral
src/app/app.routes.ts:43:11
     runGuardsAndResolvers: 'always',
     canActivate: [AuthGuard],
   },
-  { path: 'user', component: UserPage, canActivate: [AuthGuard] },
+  { path: "", component: UserPage, canActivate: [AuthGuard] },
   { path: 'products', component: ProductsPage, canActivate: [AuthGuard] },
   { path: 'cart', component: CartPage, canActivate: [AuthGuard] },
killedBy: app.routes should have a user route with AuthGuard
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] StringLiteral
src/app/app.routes.ts:45:11
   },
   { path: 'user', component: UserPage, canActivate: [AuthGuard] },
   { path: 'products', component: ProductsPage, canActivate: [AuthGuard] },
-  { path: 'cart', component: CartPage, canActivate: [AuthGuard] },
+  { path: "", component: CartPage, canActivate: [AuthGuard] },
   { path: 'contact', component: ContactPage },
   { path: 'carriers', component: CarriersPage },
killedBy: app.routes should have a cart route with AuthGuard
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] StringLiteral
src/app/app.routes.ts:46:11
   { path: 'user', component: UserPage, canActivate: [AuthGuard] },
   { path: 'products', component: ProductsPage, canActivate: [AuthGuard] },
   { path: 'cart', component: CartPage, canActivate: [AuthGuard] },
-  { path: 'contact', component: ContactPage },
+  { path: "", component: ContactPage },
   { path: 'carriers', component: CarriersPage },
 ];
killedBy: app.routes should have a contact route without AuthGuard
statusReason: Error: expect(received).toBeDefined()

Received: undefined
