[Killed] StringLiteral
app/core/models/theme.ts:6:3
 export const themeColors = [
   'red',
   'green',
-  'blue',
+  "",
   'yellow',
   'cyan',
killedBy: ThemeService should set theme color
statusReason: SyntaxError: The token provided must not be empty.

[Killed] StringLiteral
app/core/models/theme.ts:8:3
   'green',
   'blue',
   'yellow',
-  'cyan',
+  "",
   'magenta',
   'orange',
killedBy: ThemeService should set theme color
statusReason: SyntaxError: The token provided must not be empty.

[Killed] StringLiteral
app/core/models/theme.ts:9:3
   'blue',
   'yellow',
   'cyan',
-  'magenta',
+  "",
   'orange',
   'chartreuse',
killedBy: ThemeService should set theme color
statusReason: SyntaxError: The token provided must not be empty.

[Killed] StringLiteral
app/core/models/theme.ts:10:3
   'yellow',
   'cyan',
   'magenta',
-  'orange',
+  "",
   'chartreuse',
   'spring-green',
killedBy: ThemeService should set theme color
statusReason: SyntaxError: The token provided must not be empty.

[Killed] StringLiteral
app/core/models/theme.ts:11:3
   'cyan',
   'magenta',
   'orange',
-  'chartreuse',
+  "",
   'spring-green',
   'azure',
killedBy: ThemeService should set theme color
statusReason: SyntaxError: The token provided must not be empty.

[Killed] StringLiteral
app/core/models/theme.ts:19:28
 ];
 export type ThemeColor = (typeof themeColors)[number];
 
-export const themeModes = ['light', 'dark'];
+export const themeModes = ["", 'dark'];
 export type ThemeMode = (typeof themeModes)[number];
 
killedBy: ThemeService should set theme color
statusReason: SyntaxError: The token provided must not be empty.

[Killed] ArrayDeclaration
app/core/models/theme.ts:19:27
 ];
 export type ThemeColor = (typeof themeColors)[number];
 
-export const themeModes = ['light', 'dark'];
+export const themeModes = [];
 export type ThemeMode = (typeof themeModes)[number];
 
killedBy: ThemeSelector should have themeModes
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] BlockStatement
app/core/models/theme.ts:28:5
   constructor(
     public readonly mode: ThemeMode,
     public readonly color: ThemeColor
-  ) {
-    this.name = `${capitalize(mode)} ${capitalize(color)}`;
-  }
+  ) {}
 }
 

[Survived] StringLiteral
app/core/models/theme.ts:29:17
     public readonly mode: ThemeMode,
     public readonly color: ThemeColor
   ) {
-    this.name = `${capitalize(mode)} ${capitalize(color)}`;
+    this.name = ``;
   }
 }
