[Killed] BlockStatement
core/auth/guards/pending-changes.guard.ts:16:55
 
   canDeactivate(
     _component: CanComponentDeactivate
-  ): Observable<boolean> | Promise<boolean> | boolean {
-    // Reference the unused parameter to satisfy strict-checks.
-    void _component;
-    // Delegate navigation confirmation to the PendingChangesService so
-    // we don't rely on the component instance being available.
-    return this.pending.confirmNavigation();
-  }
+  ): Observable<boolean> | Promise<boolean> | boolean {}
 }
 
killedBy: PendingChangesGuard should delegate canDeactivate to PendingChangesService.confirmNavigation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
