[Killed] BooleanLiteral
app/core/services/pending-changes.service.ts:6:22
 
 @Injectable({ providedIn: 'root' })
 export class PendingChangesService {
-  private _pending = false;
+  private _pending = true;
   private _activeDialog: MatDialogRef<unknown> | null = null;
   private _beforeUnloadHandler = (e: BeforeUnloadEvent) => {
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:8:60
 export class PendingChangesService {
   private _pending = false;
   private _activeDialog: MatDialogRef<unknown> | null = null;
-  private _beforeUnloadHandler = (e: BeforeUnloadEvent) => {
-    // Standard behavior: set returnValue to show the native confirmation dialog
-    e.preventDefault();
-    // Chrome requires setting returnValue to a non-empty string
-    e.returnValue = '';
-    return '';
-  };
+  private _beforeUnloadHandler = (e: BeforeUnloadEvent) => {};
 
   setActiveDialog(ref: MatDialogRef<unknown> | null) {
killedBy: PendingChangesService should trigger beforeunload handler when pending
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
app/core/services/pending-changes.service.ts:12:21
     // Standard behavior: set returnValue to show the native confirmation dialog
     e.preventDefault();
     // Chrome requires setting returnValue to a non-empty string
-    e.returnValue = '';
+    e.returnValue = "Stryker was here!";
     return '';
   };
killedBy: PendingChangesService should trigger beforeunload handler when pending
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:16:54
     return '';
   };
 
-  setActiveDialog(ref: MatDialogRef<unknown> | null) {
-    this._activeDialog = ref;
-  }
+  setActiveDialog(ref: MatDialogRef<unknown> | null) {}
 
   clearActiveDialog() {
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:20:23
     this._activeDialog = ref;
   }
 
-  clearActiveDialog() {
-    this._activeDialog = null;
-  }
+  clearActiveDialog() {}
 
   setPending(v: boolean) {
killedBy: PendingChangesService should clear active dialog
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:24:26
     this._activeDialog = null;
   }
 
-  setPending(v: boolean) {
-    this._pending = v;
-    if (v) {
-      window.addEventListener('beforeunload', this._beforeUnloadHandler);
-    } else {
-      window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-    }
-  }
+  setPending(v: boolean) {}
 
   clear() {
killedBy: PendingChangesService should set pending to true and add event listener
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
app/core/services/pending-changes.service.ts:26:9
 
   setPending(v: boolean) {
     this._pending = v;
-    if (v) {
+    if (false) {
       window.addEventListener('beforeunload', this._beforeUnloadHandler);
     } else {
killedBy: PendingChangesService should set pending to true and add event listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "beforeunload", Any<Function>

Number of calls: 0

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:26:12
 
   setPending(v: boolean) {
     this._pending = v;
-    if (v) {
-      window.addEventListener('beforeunload', this._beforeUnloadHandler);
-    } else {
+    if (v) {} else {
       window.removeEventListener('beforeunload', this._beforeUnloadHandler);
     }
killedBy: PendingChangesService should set pending to true and add event listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "beforeunload", Any<Function>

Number of calls: 0

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:28:12
     this._pending = v;
     if (v) {
       window.addEventListener('beforeunload', this._beforeUnloadHandler);
-    } else {
-      window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-    }
+    } else {}
   }
 
killedBy: PendingChangesService should set pending to false and remove event listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "beforeunload", Any<Function>

Number of calls: 0

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:33:11
     }
   }
 
-  clear() {
-    this._pending = false;
-    window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-  }
+  clear() {}
 
   isPending(): boolean {
killedBy: PendingChangesService should clear pending state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
app/core/services/pending-changes.service.ts:34:21
   }
 
   clear() {
-    this._pending = false;
+    this._pending = true;
     window.removeEventListener('beforeunload', this._beforeUnloadHandler);
   }
killedBy: PendingChangesService should clear pending state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:38:24
     window.removeEventListener('beforeunload', this._beforeUnloadHandler);
   }
 
-  isPending(): boolean {
-    return this._pending;
-  }
+  isPending(): boolean {}
 
   // Called by the router guard to confirm navigation. If the user accepts,
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
app/core/services/pending-changes.service.ts:46:9
   // clear the pending flag and close any open dialog that was registered.
   confirmNavigation(): boolean {
     // If nothing pending, still close any registered dialog and allow navigation
-    if (!this._pending) {
+    if (this._pending) {
       try {
         this._activeDialog?.close();
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:46:25
   // clear the pending flag and close any open dialog that was registered.
   confirmNavigation(): boolean {
     // If nothing pending, still close any registered dialog and allow navigation
-    if (!this._pending) {
-      try {
-        this._activeDialog?.close();
-      } catch {
-        /* ignore */
-      }
-      this._activeDialog = null;
-      window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-      return true;
-    }
+    if (!this._pending) {}
 
     const ok = window.confirm('You have unsaved changes. Leave without saving?');
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:47:11
   confirmNavigation(): boolean {
     // If nothing pending, still close any registered dialog and allow navigation
     if (!this._pending) {
-      try {
-        this._activeDialog?.close();
-      } catch {
+      try {} catch {
         /* ignore */
       }
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] OptionalChaining
app/core/services/pending-changes.service.ts:48:9
     // If nothing pending, still close any registered dialog and allow navigation
     if (!this._pending) {
       try {
-        this._activeDialog?.close();
+        this._activeDialog.close();
       } catch {
         /* ignore */

[Killed] BooleanLiteral
app/core/services/pending-changes.service.ts:54:14
       }
       this._activeDialog = null;
       window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-      return true;
+      return false;
     }
 
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:58:13
     }
 
     const ok = window.confirm('You have unsaved changes. Leave without saving?');
-    if (ok) {
-      this._pending = false;
-      try {
-        this._activeDialog?.close();
-      } catch {
-        /* ignore */
-      }
-      this._activeDialog = null;
-      window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-    }
+    if (ok) {}
     return ok;
   }
killedBy: PendingChangesService should call dialog.close() in confirmNavigation when pending and user confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
app/core/services/pending-changes.service.ts:58:9
     }
 
     const ok = window.confirm('You have unsaved changes. Leave without saving?');
-    if (ok) {
+    if (true) {
       this._pending = false;
       try {
killedBy: PendingChangesService should return false when confirmNavigation is called with pending changes and user cancels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
app/core/services/pending-changes.service.ts:59:23
 
     const ok = window.confirm('You have unsaved changes. Leave without saving?');
     if (ok) {
-      this._pending = false;
+      this._pending = true;
       try {
         this._activeDialog?.close();
killedBy: PendingChangesService should return true when confirmNavigation is called with pending changes and user confirms
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:60:11
     const ok = window.confirm('You have unsaved changes. Leave without saving?');
     if (ok) {
       this._pending = false;
-      try {
-        this._activeDialog?.close();
-      } catch {
+      try {} catch {
         /* ignore */
       }
killedBy: PendingChangesService should call dialog.close() in confirmNavigation when pending and user confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
