[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:31:20
     password: '',
   };
 
-  isLoginLoading = false;
+  isLoginLoading = true;
   loginError: string | null = null;
 
killedBy: LoginPage should set isLoginLoading to true then false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:36:14
 
   private router = inject(Router);
 
-  ngOnInit() {
-    // Check if user is already logged in
-    this.checkAuthentication();
-  }
+  ngOnInit() {}
 
   checkAuthentication() {
killedBy: LoginPage should call checkAuthentication on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:46:13
     // For now, we'll just let them see the login page
   }
 
-  onLogin() {
-    this.isLoginLoading = true;
-    this.loginError = null;
-
-    // Simulate API call
-    setTimeout(() => {
-      this.isLoginLoading = false;
-
-      // Simple validation
-      if (!this.credentials.username || !this.credentials.password) {
-        this.loginError = 'Please enter both username and password';
-        return;
-      }
-
-      // Simple authentication check (in a real app, this would be an API call)
-      if (this.credentials.username === 'admin' && this.credentials.password === 'password') {
-        // Successful login - navigate to dashboard
-        this.router.navigate(['/customers']);
-      } else {
-        this.loginError = 'Invalid username or password';
-      }
-    }, 1500);
-  }
+  onLogin() {}
 }
 
killedBy: LoginPage should set loginError when credentials are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please enter both username and password"
Received: null

[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:47:27
   }
 
   onLogin() {
-    this.isLoginLoading = true;
+    this.isLoginLoading = false;
     this.loginError = null;
 
killedBy: LoginPage should set isLoginLoading to true then false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:51:22
     this.loginError = null;
 
     // Simulate API call
-    setTimeout(() => {
-      this.isLoginLoading = false;
-
-      // Simple validation
-      if (!this.credentials.username || !this.credentials.password) {
-        this.loginError = 'Please enter both username and password';
-        return;
-      }
-
-      // Simple authentication check (in a real app, this would be an API call)
-      if (this.credentials.username === 'admin' && this.credentials.password === 'password') {
-        // Successful login - navigate to dashboard
-        this.router.navigate(['/customers']);
-      } else {
-        this.loginError = 'Invalid username or password';
-      }
-    }, 1500);
+    setTimeout(() => {}, 1500);
   }
 }
killedBy: LoginPage should set loginError when credentials are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please enter both username and password"
Received: null

[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:52:29
 
     // Simulate API call
     setTimeout(() => {
-      this.isLoginLoading = false;
+      this.isLoginLoading = true;
 
       // Simple validation
killedBy: LoginPage should set isLoginLoading to true then false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:55:11
       this.isLoginLoading = false;
 
       // Simple validation
-      if (!this.credentials.username || !this.credentials.password) {
+      if (true) {
         this.loginError = 'Please enter both username and password';
         return;
killedBy: LoginPage should set loginError for wrong credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid username or password"
Received: "Please enter both username and password"

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:55:11
       this.isLoginLoading = false;
 
       // Simple validation
-      if (!this.credentials.username || !this.credentials.password) {
+      if (false) {
         this.loginError = 'Please enter both username and password';
         return;
killedBy: LoginPage should set loginError when credentials are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please enter both username and password"
Received: "Invalid username or password"

[Killed] LogicalOperator
shared/pages/login-page/login-page.ts:61:11
       }
 
       // Simple authentication check (in a real app, this would be an API call)
-      if (this.credentials.username === 'admin' && this.credentials.password === 'password') {
+      if (this.credentials.username === 'admin' || this.credentials.password === 'password') {
         // Successful login - navigate to dashboard
         this.router.navigate(['/customers']);
killedBy: LoginPage should set loginError when username correct but password wrong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid username or password"
Received: null

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:61:94
       }
 
       // Simple authentication check (in a real app, this would be an API call)
-      if (this.credentials.username === 'admin' && this.credentials.password === 'password') {
-        // Successful login - navigate to dashboard
-        this.router.navigate(['/customers']);
-      } else {
+      if (this.credentials.username === 'admin' && this.credentials.password === 'password') {} else {
         this.loginError = 'Invalid username or password';
       }
killedBy: LoginPage should navigate to /customers on successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/customers"]

Number of calls: 0

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:64:14
       if (this.credentials.username === 'admin' && this.credentials.password === 'password') {
         // Successful login - navigate to dashboard
         this.router.navigate(['/customers']);
-      } else {
-        this.loginError = 'Invalid username or password';
-      }
+      } else {}
     }, 1500);
   }
killedBy: LoginPage should set loginError for wrong credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid username or password"
Received: null
