[Killed] BlockStatement
app/core/services/theme.service.ts:11:36
   private readonly storageKey = 'theme';
   currentTheme = new Theme('light', 'blue');
 
-  setThemeColor(color: ThemeColor) {
-    this.currentTheme = { ...this.currentTheme, color };
-    this.applyTheme();
-    this.persistTheme();
-  }
+  setThemeColor(color: ThemeColor) {}
 
   setThemeMode(mode: ThemeMode) {
killedBy: ThemeService should set theme color
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "purple"
Received: "blue"

[Killed] ObjectLiteral
app/core/services/theme.service.ts:12:25
   currentTheme = new Theme('light', 'blue');
 
   setThemeColor(color: ThemeColor) {
-    this.currentTheme = { ...this.currentTheme, color };
+    this.currentTheme = {};
     this.applyTheme();
     this.persistTheme();
killedBy: ThemeService should set theme color
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "purple"
Received: undefined

[Killed] BlockStatement
app/core/services/theme.service.ts:17:33
     this.persistTheme();
   }
 
-  setThemeMode(mode: ThemeMode) {
-    this.currentTheme = { ...this.currentTheme, mode: mode };
-    this.applyTheme();
-    this.persistTheme();
-  }
+  setThemeMode(mode: ThemeMode) {}
 
   loadTheme() {
killedBy: ThemeService should set theme mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: "light"

[Killed] ObjectLiteral
app/core/services/theme.service.ts:18:25
   }
 
   setThemeMode(mode: ThemeMode) {
-    this.currentTheme = { ...this.currentTheme, mode: mode };
+    this.currentTheme = {};
     this.applyTheme();
     this.persistTheme();
killedBy: ThemeService should set theme mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: undefined

[Killed] BlockStatement
app/core/services/theme.service.ts:23:15
     this.persistTheme();
   }
 
-  loadTheme() {
-    const json = localStorage.getItem(this.storageKey);
-    if (!json) {
-      this.applyTheme();
-      return;
-    }
-
-    try {
-      this.currentTheme = JSON.parse(json);
-      this.applyTheme();
-      // eslint-disable-next-line no-empty
-    } catch {}
-  }
+  loadTheme() {}
 
   private applyTheme() {
killedBy: ThemeService should load theme from localStorage when available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: "light"

[Killed] ConditionalExpression
app/core/services/theme.service.ts:25:9
 
   loadTheme() {
     const json = localStorage.getItem(this.storageKey);
-    if (!json) {
+    if (true) {
       this.applyTheme();
       return;
killedBy: ThemeService should load theme from localStorage when available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: "light"

[Killed] ConditionalExpression
app/core/services/theme.service.ts:25:9
 
   loadTheme() {
     const json = localStorage.getItem(this.storageKey);
-    if (!json) {
+    if (false) {
       this.applyTheme();
       return;
killedBy: ThemeService should apply default theme when localStorage is empty
statusReason: TypeError: Cannot read properties of null (reading 'mode')

[Killed] BlockStatement
app/core/services/theme.service.ts:30:9
       return;
     }
 
-    try {
-      this.currentTheme = JSON.parse(json);
-      this.applyTheme();
-      // eslint-disable-next-line no-empty
-    } catch {}
+    try {} catch {}
   }
 
killedBy: ThemeService should load theme from localStorage when available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: "light"

[Killed] BlockStatement
app/core/services/theme.service.ts:37:24
     } catch {}
   }
 
-  private applyTheme() {
-    const html = document.documentElement;
-    html.classList.remove(...themeModes, ...themeColors);
-    html.classList.add(this.currentTheme.mode, this.currentTheme.color);
-  }
+  private applyTheme() {}
 
   private persistTheme() {
killedBy: ThemeService should apply theme classes to document element
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "dark"
Received object: {}

[Killed] BlockStatement
app/core/services/theme.service.ts:43:26
     html.classList.add(this.currentTheme.mode, this.currentTheme.color);
   }
 
-  private persistTheme() {
-    localStorage.setItem(this.storageKey, JSON.stringify(this.currentTheme));
-  }
+  private persistTheme() {}
 }
 
killedBy: ThemeService should set theme color
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
