[Killed] BlockStatement
core/auth/guards/auth.guard.ts:12:36
   private router = inject(Router);
   private authService = inject(AuthService);
 
-  canActivate(): boolean | UrlTree {
-    if (this.authService.isAuthenticated()) {
-      return true;
-    }
-
-    // Redirect to login page if not authenticated
-    return this.router.createUrlTree(['/login']);
-  }
+  canActivate(): boolean | UrlTree {}
 }
 
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
core/auth/guards/auth.guard.ts:13:9
   private authService = inject(AuthService);
 
   canActivate(): boolean | UrlTree {
-    if (this.authService.isAuthenticated()) {
+    if (false) {
       return true;
     }
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: {"_queryParamMap": undefined, "fragment": null, "queryParams": {}, "root": {"children": {"primary": {"children": {}, "parent": [Circular], "segments": [{"_parameterMap": undefined, "parameters": {}, "path": "login"}]}}, "parent": null, "segments": []}}

[Killed] BlockStatement
core/auth/guards/auth.guard.ts:13:45
   private authService = inject(AuthService);
 
   canActivate(): boolean | UrlTree {
-    if (this.authService.isAuthenticated()) {
-      return true;
-    }
+    if (this.authService.isAuthenticated()) {}
 
     // Redirect to login page if not authenticated
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: {"_queryParamMap": undefined, "fragment": null, "queryParams": {}, "root": {"children": {"primary": {"children": {}, "parent": [Circular], "segments": [{"_parameterMap": undefined, "parameters": {}, "path": "login"}]}}, "parent": null, "segments": []}}

[Killed] BooleanLiteral
core/auth/guards/auth.guard.ts:14:14
 
   canActivate(): boolean | UrlTree {
     if (this.authService.isAuthenticated()) {
-      return true;
+      return false;
     }
 
killedBy: AuthGuard should return true when user is authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
