[Killed] BlockStatement
core/auth/interceptors/auth.interceptor.ts:12:91
 export class AuthInterceptor implements HttpInterceptor {
   private readonly authService = inject(AuthService);
 
-  intercept(req: HttpRequest<unknown>, next: HttpHandler): Observable<HttpEvent<unknown>> {
-    const token = this.authService.getToken();
-
-    if (token) {
-      req = req.clone({
-        setHeaders: { Authorization: `Bearer ${token}` },
-      });
-    }
-
-    return next.handle(req);
-  }
+  intercept(req: HttpRequest<unknown>, next: HttpHandler): Observable<HttpEvent<unknown>> {}
 }
 
killedBy: AuthInterceptor should add Authorization header when token is present
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
core/auth/interceptors/auth.interceptor.ts:15:16
   intercept(req: HttpRequest<unknown>, next: HttpHandler): Observable<HttpEvent<unknown>> {
     const token = this.authService.getToken();
 
-    if (token) {
-      req = req.clone({
-        setHeaders: { Authorization: `Bearer ${token}` },
-      });
-    }
+    if (token) {}
 
     return next.handle(req);
killedBy: AuthInterceptor should add Authorization header when token is present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bearer test-jwt-token"
Received: null
