[Killed] ArrowFunction
app/core/services/title.service.ts:7:14
   providedIn: 'root',
 })
 export class TitleService {
-  getTitle = () => 'Angular App';
+  getTitle = () => undefined;
 }
 
killedBy: TitleService should return "Angular App" as title
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Angular App"
Received: undefined

[Killed] StringLiteral
app/core/services/title.service.ts:7:20
   providedIn: 'root',
 })
 export class TitleService {
-  getTitle = () => 'Angular App';
+  getTitle = () => "";
 }
 
killedBy: TitleService should return "Angular App" as title
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Angular App"
Received: ""
