[Killed] BlockStatement
core/auth/services/auth.service.ts:39:44
   isAuthenticated = signal<boolean>(this.hasStoredUser());
   user = signal<User | null>(this.getStoredUser());
 
-  get authState(): Observable<User | null> {
-    return of(this.getStoredUser());
-  }
+  get authState(): Observable<User | null> {}
 
   login(username: string, password: string): Observable<boolean> {
killedBy: AuthService should return Observable<User | null> from authState
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
core/auth/services/auth.service.ts:43:66
     return of(this.getStoredUser());
   }
 
-  login(username: string, password: string): Observable<boolean> {
-    // Admin authentication (local, no API call)
-    if (username === 'admin' && password === 'password') {
-      const user: User = { username, isAdmin: true };
-      this.setAuth(user);
-      return of(true);
-    }
-
-    // Customer authentication via API
-    return this.http.post<AuthResponse>('/api/auth/login', { username, password }).pipe(
-      map(response => {
-        this.saveToken(response.token);
-        const user: User = { username: response.username, isAdmin: false };
-        this.setAuth(user);
-        return true;
-      }),
-      catchError(() => of(false))
-    );
-  }
+  login(username: string, password: string): Observable<boolean> {}
 
   register(
killedBy: AuthInterceptor should add Authorization header when token is present
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] EqualityOperator
core/auth/services/auth.service.ts:45:33
 
   login(username: string, password: string): Observable<boolean> {
     // Admin authentication (local, no API call)
-    if (username === 'admin' && password === 'password') {
+    if (username === 'admin' && password !== 'password') {
       const user: User = { username, isAdmin: true };
       this.setAuth(user);
killedBy: AuthService should login with valid admin credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
core/auth/services/auth.service.ts:45:9
 
   login(username: string, password: string): Observable<boolean> {
     // Admin authentication (local, no API call)
-    if (username === 'admin' && password === 'password') {
+    if (username !== 'admin' && password === 'password') {
       const user: User = { username, isAdmin: true };
       this.setAuth(user);
killedBy: AuthService should login with valid admin credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
core/auth/services/auth.service.ts:46:47
   login(username: string, password: string): Observable<boolean> {
     // Admin authentication (local, no API call)
     if (username === 'admin' && password === 'password') {
-      const user: User = { username, isAdmin: true };
+      const user: User = { username, isAdmin: false };
       this.setAuth(user);
       return of(true);
killedBy: AuthService should login with valid admin credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
core/auth/services/auth.service.ts:48:17
     if (username === 'admin' && password === 'password') {
       const user: User = { username, isAdmin: true };
       this.setAuth(user);
-      return of(true);
+      return of(false);
     }
 

[Survived] ObjectLiteral
core/auth/services/auth.service.ts:52:60
     }
 
     // Customer authentication via API
-    return this.http.post<AuthResponse>('/api/auth/login', { username, password }).pipe(
+    return this.http.post<AuthResponse>('/api/auth/login', {}).pipe(
       map(response => {
         this.saveToken(response.token);

[Killed] BlockStatement
core/auth/services/auth.service.ts:53:23
 
     // Customer authentication via API
     return this.http.post<AuthResponse>('/api/auth/login', { username, password }).pipe(
-      map(response => {
-        this.saveToken(response.token);
-        const user: User = { username: response.username, isAdmin: false };
-        this.setAuth(user);
-        return true;
-      }),
+      map(response => {}),
       catchError(() => of(false))
     );
killedBy: AuthService should login a registered customer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
core/auth/services/auth.service.ts:55:68
     return this.http.post<AuthResponse>('/api/auth/login', { username, password }).pipe(
       map(response => {
         this.saveToken(response.token);
-        const user: User = { username: response.username, isAdmin: false };
+        const user: User = { username: response.username, isAdmin: true };
         this.setAuth(user);
         return true;
killedBy: AuthService should login a registered customer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
core/auth/services/auth.service.ts:57:16
         this.saveToken(response.token);
         const user: User = { username: response.username, isAdmin: false };
         this.setAuth(user);
-        return true;
+        return false;
       }),
       catchError(() => of(false))

[Survived] BooleanLiteral
core/auth/services/auth.service.ts:59:27
         this.setAuth(user);
         return true;
       }),
-      catchError(() => of(false))
+      catchError(() => of(true))
     );
   }

[Survived] ArrowFunction
core/auth/services/auth.service.ts:59:18
         this.setAuth(user);
         return true;
       }),
-      catchError(() => of(false))
+      catchError(() => undefined)
     );
   }

[Survived] StringLiteral
core/auth/services/auth.service.ts:66:13
   register(
     username: string,
     password: string,
-    email = `${username}@shop.com`
+    email = ``
   ): Observable<boolean> {
     if (!username || !password) {

[Killed] BlockStatement
core/auth/services/auth.service.ts:67:26
     username: string,
     password: string,
     email = `${username}@shop.com`
-  ): Observable<boolean> {
-    if (!username || !password) {
-      return of(false);
-    }
-
-    // Admin username is reserved
-    if (username === 'admin') {
-      return of(false);
-    }
-
-    const request: RegisterRequest = { username, email, password };
-
-    return this.http.post<AuthResponse>('/api/auth/register', request).pipe(
-      map(response => {
-        this.saveToken(response.token);
-        const user: User = { username: response.username, isAdmin: false };
-        this.setAuth(user);
-        return true;
-      }),
-      catchError(() => of(false))
-    );
-  }
+  ): Observable<boolean> {}
 
   logout(): void {
killedBy: AuthService should register a new customer
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
core/auth/services/auth.service.ts:68:22
     password: string,
     email = `${username}@shop.com`
   ): Observable<boolean> {
-    if (!username || !password) {
+    if (!username || password) {
       return of(false);
     }
killedBy: AuthService should register a new customer
statusReason: Error: Expected one matching request for criteria "Match URL: /api/auth/register", found none.

[Killed] BooleanLiteral
core/auth/services/auth.service.ts:68:9
     password: string,
     email = `${username}@shop.com`
   ): Observable<boolean> {
-    if (!username || !password) {
+    if (username || !password) {
       return of(false);
     }
killedBy: AuthService should register a new customer
statusReason: Error: Expected one matching request for criteria "Match URL: /api/auth/register", found none.

[Survived] BooleanLiteral
core/auth/services/auth.service.ts:69:17
     email = `${username}@shop.com`
   ): Observable<boolean> {
     if (!username || !password) {
-      return of(false);
+      return of(true);
     }
 

[Killed] EqualityOperator
core/auth/services/auth.service.ts:73:9
     }
 
     // Admin username is reserved
-    if (username === 'admin') {
+    if (username !== 'admin') {
       return of(false);
     }
killedBy: AuthService should register a new customer
statusReason: Error: Expected one matching request for criteria "Match URL: /api/auth/register", found none.

[Killed] BlockStatement
core/auth/services/auth.service.ts:73:31
     }
 
     // Admin username is reserved
-    if (username === 'admin') {
-      return of(false);
-    }
+    if (username === 'admin') {}
 
     const request: RegisterRequest = { username, email, password };
killedBy: AuthService should return false when registering username "admin"
statusReason: Error: Expected no open requests, found 1: POST /api/auth/register

[Survived] BooleanLiteral
core/auth/services/auth.service.ts:74:17
 
     // Admin username is reserved
     if (username === 'admin') {
-      return of(false);
+      return of(true);
     }
 

[Killed] StringLiteral
core/auth/services/auth.service.ts:79:41
 
     const request: RegisterRequest = { username, email, password };
 
-    return this.http.post<AuthResponse>('/api/auth/register', request).pipe(
+    return this.http.post<AuthResponse>("", request).pipe(
       map(response => {
         this.saveToken(response.token);
killedBy: AuthService should register a new customer
statusReason: Error: Expected one matching request for criteria "Match URL: /api/auth/register", found none. Requests received are: POST .

[Killed] BlockStatement
core/auth/services/auth.service.ts:80:23
     const request: RegisterRequest = { username, email, password };
 
     return this.http.post<AuthResponse>('/api/auth/register', request).pipe(
-      map(response => {
-        this.saveToken(response.token);
-        const user: User = { username: response.username, isAdmin: false };
-        this.setAuth(user);
-        return true;
-      }),
+      map(response => {}),
       catchError(() => of(false))
     );
killedBy: AuthService should register a new customer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
core/auth/services/auth.service.ts:90:18
     );
   }
 
-  logout(): void {
-    localStorage.removeItem(this.STORAGE_KEY);
-    localStorage.removeItem(this.TOKEN_KEY);
-    this.isAuthenticated.set(false);
-    this.user.set(null);
-  }
+  logout(): void {}
 
   getToken(): string | null {
killedBy: AuthService should clear auth state on logout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
core/auth/services/auth.service.ts:93:30
   logout(): void {
     localStorage.removeItem(this.STORAGE_KEY);
     localStorage.removeItem(this.TOKEN_KEY);
-    this.isAuthenticated.set(false);
+    this.isAuthenticated.set(true);
     this.user.set(null);
   }
killedBy: AuthService should clear auth state on logout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
core/auth/services/auth.service.ts:97:29
     this.user.set(null);
   }
 
-  getToken(): string | null {
-    try {
-      return localStorage.getItem(this.TOKEN_KEY);
-    } catch {
-      return null;
-    }
-  }
+  getToken(): string | null {}
 
   private hasStoredUser(): boolean {
killedBy: AuthInterceptor should add Authorization header when token is present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bearer test-jwt-token"
Received: null

[Killed] BlockStatement
core/auth/services/auth.service.ts:98:9
   }
 
   getToken(): string | null {
-    try {
-      return localStorage.getItem(this.TOKEN_KEY);
-    } catch {
+    try {} catch {
       return null;
     }
killedBy: AuthInterceptor should add Authorization header when token is present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bearer test-jwt-token"
Received: null

[NoCoverage] BlockStatement
core/auth/services/auth.service.ts:100:13
   getToken(): string | null {
     try {
       return localStorage.getItem(this.TOKEN_KEY);
-    } catch {
-      return null;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
core/auth/services/auth.service.ts:105:36
     }
   }
 
-  private hasStoredUser(): boolean {
-    try {
-      return !!localStorage.getItem(this.STORAGE_KEY);
-    } catch {
-      return false;
-    }
-  }
+  private hasStoredUser(): boolean {}
 
   private getStoredUser(): User | null {
killedBy: AuthService should return false for isAuthenticated when no user is stored
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
core/auth/services/auth.service.ts:106:9
   }
 
   private hasStoredUser(): boolean {
-    try {
-      return !!localStorage.getItem(this.STORAGE_KEY);
-    } catch {
+    try {} catch {
       return false;
     }
killedBy: AuthService should return false for isAuthenticated when no user is stored
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
core/auth/services/auth.service.ts:107:14
 
   private hasStoredUser(): boolean {
     try {
-      return !!localStorage.getItem(this.STORAGE_KEY);
+      return !localStorage.getItem(this.STORAGE_KEY);
     } catch {
       return false;
killedBy: AuthService should return false for isAuthenticated when no user is stored
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[NoCoverage] BlockStatement
core/auth/services/auth.service.ts:108:13
   private hasStoredUser(): boolean {
     try {
       return !!localStorage.getItem(this.STORAGE_KEY);
-    } catch {
-      return false;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
core/auth/services/auth.service.ts:113:40
     }
   }
 
-  private getStoredUser(): User | null {
-    try {
-      const data = localStorage.getItem(this.STORAGE_KEY);
-      return data ? JSON.parse(data) : null;
-    } catch {
-      return null;
-    }
-  }
+  private getStoredUser(): User | null {}
 
   private setAuth(user: User): void {
killedBy: AuthService should return null for user when no user is stored
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
core/auth/services/auth.service.ts:114:9
   }
 
   private getStoredUser(): User | null {
-    try {
-      const data = localStorage.getItem(this.STORAGE_KEY);
-      return data ? JSON.parse(data) : null;
-    } catch {
+    try {} catch {
       return null;
     }
killedBy: AuthService should return null for user when no user is stored
statusReason: Error: expect(received).toBeNull()

Received: undefined

[NoCoverage] BlockStatement
core/auth/services/auth.service.ts:117:13
     try {
       const data = localStorage.getItem(this.STORAGE_KEY);
       return data ? JSON.parse(data) : null;
-    } catch {
-      return null;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
core/auth/services/auth.service.ts:122:37
     }
   }
 
-  private setAuth(user: User): void {
-    try {
-      localStorage.setItem(this.STORAGE_KEY, JSON.stringify(user));
-    } catch {
-      /* quota exceeded */
-    }
-    this.isAuthenticated.set(true);
-    this.user.set(user);
-  }
+  private setAuth(user: User): void {}
 
   private saveToken(token: string): void {
killedBy: AuthService should login with valid admin credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
core/auth/services/auth.service.ts:123:9
   }
 
   private setAuth(user: User): void {
-    try {
-      localStorage.setItem(this.STORAGE_KEY, JSON.stringify(user));
-    } catch {
+    try {} catch {
       /* quota exceeded */
     }
killedBy: AuthService should persist auth across storage reads
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BooleanLiteral
core/auth/services/auth.service.ts:128:30
     } catch {
       /* quota exceeded */
     }
-    this.isAuthenticated.set(true);
+    this.isAuthenticated.set(false);
     this.user.set(user);
   }
killedBy: AuthService should login with valid admin credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
core/auth/services/auth.service.ts:132:42
     this.user.set(user);
   }
 
-  private saveToken(token: string): void {
-    try {
-      localStorage.setItem(this.TOKEN_KEY, token);
-    } catch {
-      /* quota exceeded */
-    }
-  }
+  private saveToken(token: string): void {}
 }
 
killedBy: AuthInterceptor should add Authorization header when token is present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bearer test-jwt-token"
Received: null

[Killed] BlockStatement
core/auth/services/auth.service.ts:133:9
   }
 
   private saveToken(token: string): void {
-    try {
-      localStorage.setItem(this.TOKEN_KEY, token);
-    } catch {
+    try {} catch {
       /* quota exceeded */
     }
killedBy: AuthInterceptor should add Authorization header when token is present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bearer test-jwt-token"
Received: null
