[Killed] ArrayDeclaration
app/features/carriers/carrier.service.ts:11:32
 })
 export class CarrierService {
   private carriersUrl = 'api/carriers';
-  carriers = signal<Carrier[]>([]);
+  carriers = signal<Carrier[]>(["Stryker was here"]);
   loading = signal(false);
   error = signal<string | null>(null);
killedBy: CarrierService should initialize with empty carriers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BooleanLiteral
app/features/carriers/carrier.service.ts:12:20
 export class CarrierService {
   private carriersUrl = 'api/carriers';
   carriers = signal<Carrier[]>([]);
-  loading = signal(false);
+  loading = signal(true);
   error = signal<string | null>(null);
   private readonly http = inject(HttpClient);
killedBy: CarrierService should initialize with loading false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:16:18
   error = signal<string | null>(null);
   private readonly http = inject(HttpClient);
 
-  loadCarriers() {
-    this.loading.set(true);
-    this.error.set(null);
-
-    this.http
-      .get<Carrier[]>(this.carriersUrl)
-      .pipe(
-        tap(carriers => this.carriers.set(carriers)),
-        catchError(() => {
-          this.error.set('Failed to load carriers');
-          this.loading.set(false);
-          return EMPTY;
-        })
-      )
-      .subscribe({
-        complete: () => this.loading.set(false),
-      });
-  }
+  loadCarriers() {}
 
   addCarrier(carrier: Carrier) {
killedBy: CarrierService should load carriers from API
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
app/features/carriers/carrier.service.ts:17:22
   private readonly http = inject(HttpClient);
 
   loadCarriers() {
-    this.loading.set(true);
+    this.loading.set(false);
     this.error.set(null);
 
killedBy: CarrierService should load carriers from API
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
app/features/carriers/carrier.service.ts:23:13
     this.http
       .get<Carrier[]>(this.carriersUrl)
       .pipe(
-        tap(carriers => this.carriers.set(carriers)),
+        tap(() => undefined),
         catchError(() => {
           this.error.set('Failed to load carriers');
killedBy: CarrierService should load carriers from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "createdAt": 2024-01-01T00:00:00.000Z,

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:24:26
       .get<Carrier[]>(this.carriersUrl)
       .pipe(
         tap(carriers => this.carriers.set(carriers)),
-        catchError(() => {
-          this.error.set('Failed to load carriers');
-          this.loading.set(false);
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe({
killedBy: CarrierService should handle load carriers error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
app/features/carriers/carrier.service.ts:26:28
         tap(carriers => this.carriers.set(carriers)),
         catchError(() => {
           this.error.set('Failed to load carriers');
-          this.loading.set(false);
+          this.loading.set(true);
           return EMPTY;
         })

[Killed] ArrowFunction
app/features/carriers/carrier.service.ts:31:19
         })
       )
       .subscribe({
-        complete: () => this.loading.set(false),
+        complete: () => undefined,
       });
   }
killedBy: CarrierService should load carriers from API
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
app/features/carriers/carrier.service.ts:31:42
         })
       )
       .subscribe({
-        complete: () => this.loading.set(false),
+        complete: () => this.loading.set(true),
       });
   }
killedBy: CarrierService should load carriers from API
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:35:32
       });
   }
 
-  addCarrier(carrier: Carrier) {
-    this.http
-      .post<Carrier>(this.carriersUrl, carrier)
-      .pipe(
-        tap(newCarrier => {
-          const current = this.carriers();
-          this.carriers.set([...current, newCarrier]);
-        }),
-        catchError(() => {
-          this.error.set('Failed to add carrier');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  addCarrier(carrier: Carrier) {}
 
   updateCarrier(carrier: Carrier) {
killedBy: CarrierService should add a carrier
statusReason: Error: Expected one matching request for criteria "Match URL: api/carriers", found none.

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:39:27
     this.http
       .post<Carrier>(this.carriersUrl, carrier)
       .pipe(
-        tap(newCarrier => {
-          const current = this.carriers();
-          this.carriers.set([...current, newCarrier]);
-        }),
+        tap(newCarrier => {}),
         catchError(() => {
           this.error.set('Failed to add carrier');
killedBy: CarrierService should add a carrier
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: {"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}
Received array: []

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:43:26
           const current = this.carriers();
           this.carriers.set([...current, newCarrier]);
         }),
-        catchError(() => {
-          this.error.set('Failed to add carrier');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: CarrierService should handle add carrier error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to add carrier"
Received: null

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:51:35
       .subscribe();
   }
 
-  updateCarrier(carrier: Carrier) {
-    this.http
-      .put<Carrier>(`${this.carriersUrl}/${carrier.id}`, carrier)
-      .pipe(
-        tap(() => {
-          const current = this.carriers();
-          const index = current.findIndex(c => c.id === carrier.id);
-          if (index !== -1) {
-            const updated = [...current];
-            updated[index] = carrier;
-            this.carriers.set(updated);
-          }
-        }),
-        catchError(() => {
-          this.error.set('Failed to update carrier');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  updateCarrier(carrier: Carrier) {}
 
   deleteCarrier(id: number) {
killedBy: CarrierService should update a carrier
statusReason: Error: Expected one matching request for criteria "Match URL: api/carriers/1", found none.

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:55:19
     this.http
       .put<Carrier>(`${this.carriersUrl}/${carrier.id}`, carrier)
       .pipe(
-        tap(() => {
-          const current = this.carriers();
-          const index = current.findIndex(c => c.id === carrier.id);
-          if (index !== -1) {
-            const updated = [...current];
-            updated[index] = carrier;
-            this.carriers.set(updated);
-          }
-        }),
+        tap(() => {}),
         catchError(() => {
           this.error.set('Failed to update carrier');
killedBy: CarrierService should update a carrier
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated Carrier"
Received: "Test Carrier"

[Killed] ConditionalExpression
app/features/carriers/carrier.service.ts:57:48
       .pipe(
         tap(() => {
           const current = this.carriers();
-          const index = current.findIndex(c => c.id === carrier.id);
+          const index = current.findIndex(c => false);
           if (index !== -1) {
             const updated = [...current];
killedBy: CarrierService should update a carrier
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated Carrier"
Received: "Test Carrier"

[Killed] EqualityOperator
app/features/carriers/carrier.service.ts:57:48
       .pipe(
         tap(() => {
           const current = this.carriers();
-          const index = current.findIndex(c => c.id === carrier.id);
+          const index = current.findIndex(c => c.id !== carrier.id);
           if (index !== -1) {
             const updated = [...current];
killedBy: CarrierService should update a carrier
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated Carrier"
Received: "Test Carrier"

[Killed] UnaryOperator
app/features/carriers/carrier.service.ts:58:25
         tap(() => {
           const current = this.carriers();
           const index = current.findIndex(c => c.id === carrier.id);
-          if (index !== -1) {
+          if (index !== +1) {
             const updated = [...current];
             updated[index] = carrier;
killedBy: CarrierService should not update carriers array when carrier not found during update
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}]
Received: serializes to the same string

[Killed] ConditionalExpression
app/features/carriers/carrier.service.ts:58:15
         tap(() => {
           const current = this.carriers();
           const index = current.findIndex(c => c.id === carrier.id);
-          if (index !== -1) {
+          if (true) {
             const updated = [...current];
             updated[index] = carrier;
killedBy: CarrierService should not update carriers array when carrier not found during update
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}]
Received: serializes to the same string

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:64:26
             this.carriers.set(updated);
           }
         }),
-        catchError(() => {
-          this.error.set('Failed to update carrier');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: CarrierService should handle update carrier error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to update carrier"
Received: null

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:72:29
       .subscribe();
   }
 
-  deleteCarrier(id: number) {
-    this.http
-      .delete(`${this.carriersUrl}/${id}`)
-      .pipe(
-        tap(() => {
-          const current = this.carriers();
-          this.carriers.set(current.filter(c => c.id !== id));
-        }),
-        catchError(() => {
-          this.error.set('Failed to delete carrier');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  deleteCarrier(id: number) {}
 }
 
killedBy: CarrierService should delete a carrier
statusReason: Error: Expected one matching request for criteria "Match URL: api/carriers/1", found none.

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:76:19
     this.http
       .delete(`${this.carriersUrl}/${id}`)
       .pipe(
-        tap(() => {
-          const current = this.carriers();
-          this.carriers.set(current.filter(c => c.id !== id));
-        }),
+        tap(() => {}),
         catchError(() => {
           this.error.set('Failed to delete carrier');
killedBy: CarrierService should delete a carrier
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not {"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}

[Killed] ConditionalExpression
app/features/carriers/carrier.service.ts:78:49
       .pipe(
         tap(() => {
           const current = this.carriers();
-          this.carriers.set(current.filter(c => c.id !== id));
+          this.carriers.set(current.filter(c => true));
         }),
         catchError(() => {
killedBy: CarrierService should delete a carrier
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not {"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}

[Killed] EqualityOperator
app/features/carriers/carrier.service.ts:78:49
       .pipe(
         tap(() => {
           const current = this.carriers();
-          this.carriers.set(current.filter(c => c.id !== id));
+          this.carriers.set(current.filter(c => c.id === id));
         }),
         catchError(() => {
killedBy: CarrierService should delete a carrier
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not {"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}
Received array:     [{"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example

[Killed] BlockStatement
app/features/carriers/carrier.service.ts:80:26
           const current = this.carriers();
           this.carriers.set(current.filter(c => c.id !== id));
         }),
-        catchError(() => {
-          this.error.set('Failed to delete carrier');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: CarrierService should handle delete carrier error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to delete carrier"
Received: null
