[Killed] StringLiteral
shared/pages/login-page/login-page.ts:42:15
   authMode: AuthMode = 'login';
   tabIndex = 0;
   credentials = {
-    username: '',
+    username: "Stryker was here!",
     password: '',
   };
killedBy: LoginPage should initialize with empty credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Survived] BooleanLiteral
shared/pages/login-page/login-page.ts:48:18
 
   isLoginLoading = false;
   message: string | null = null;
-  messageError = false;
+  messageError = true;
 
   protected router = inject(Router);

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:54:14
   protected authService = inject(AuthService);
   protected titleService = inject(TitleService);
 
-  ngOnInit() {
-    // If already authenticated, redirect based on role
-    const user = this.authService.user();
-    if (user) {
-      if (user.isAdmin) {
-        this.router.navigate(['/admin/users']);
-      } else {
-        this.router.navigate(['/shop/products']);
-      }
-    }
-  }
+  ngOnInit() {}
 
   onLogin() {
killedBy: LoginPage should redirect admin to /admin/users when already authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/admin/users"]

Number of calls: 0

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:57:9
   ngOnInit() {
     // If already authenticated, redirect based on role
     const user = this.authService.user();
-    if (user) {
+    if (true) {
       if (user.isAdmin) {
         this.router.navigate(['/admin/users']);
killedBy: LoginPage should create
statusReason: TypeError: Cannot read properties of null (reading 'isAdmin')

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:57:15
   ngOnInit() {
     // If already authenticated, redirect based on role
     const user = this.authService.user();
-    if (user) {
-      if (user.isAdmin) {
-        this.router.navigate(['/admin/users']);
-      } else {
-        this.router.navigate(['/shop/products']);
-      }
-    }
+    if (user) {}
   }
 
killedBy: LoginPage should redirect admin to /admin/users when already authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/admin/users"]

Number of calls: 0

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:58:11
     // If already authenticated, redirect based on role
     const user = this.authService.user();
     if (user) {
-      if (user.isAdmin) {
+      if (true) {
         this.router.navigate(['/admin/users']);
       } else {
killedBy: LoginPage should redirect customer to /shop/products when already authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/shop/products",
+   "/admin/users",

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:58:25
     // If already authenticated, redirect based on role
     const user = this.authService.user();
     if (user) {
-      if (user.isAdmin) {
-        this.router.navigate(['/admin/users']);
-      } else {
+      if (user.isAdmin) {} else {
         this.router.navigate(['/shop/products']);
       }
killedBy: LoginPage should redirect admin to /admin/users when already authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/admin/users"]

Number of calls: 0

[Killed] StringLiteral
shared/pages/login-page/login-page.ts:59:31
     const user = this.authService.user();
     if (user) {
       if (user.isAdmin) {
-        this.router.navigate(['/admin/users']);
+        this.router.navigate([""]);
       } else {
         this.router.navigate(['/shop/products']);
killedBy: LoginPage should redirect admin to /admin/users when already authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/admin/users",
+   "",

[Killed] ArrayDeclaration
shared/pages/login-page/login-page.ts:59:30
     const user = this.authService.user();
     if (user) {
       if (user.isAdmin) {
-        this.router.navigate(['/admin/users']);
+        this.router.navigate([]);
       } else {
         this.router.navigate(['/shop/products']);
killedBy: LoginPage should redirect admin to /admin/users when already authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/admin/users",
- ]

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:60:14
     if (user) {
       if (user.isAdmin) {
         this.router.navigate(['/admin/users']);
-      } else {
-        this.router.navigate(['/shop/products']);
-      }
+      } else {}
     }
   }
killedBy: LoginPage should redirect customer to /shop/products when already authenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/shop/products"]

Number of calls: 0

[Survived] BooleanLiteral
shared/pages/login-page/login-page.ts:69:25
   onLogin() {
     this.isLoginLoading = true;
     this.message = null;
-    this.messageError = false;
+    this.messageError = true;
 
     // Simple validation

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:72:67
     this.messageError = false;
 
     // Simple validation
-    if (!this.credentials.username || !this.credentials.password) {
-      this.isLoginLoading = false;
-      this.message = 'Please enter both username and password';
-      this.messageError = true;
-      return;
-    }
+    if (!this.credentials.username || !this.credentials.password) {}
 
     this.authService
killedBy: LoginPage should set message when credentials are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please enter both username and password"
Received: "Invalid username or password"

[Killed] LogicalOperator
shared/pages/login-page/login-page.ts:72:9
     this.messageError = false;
 
     // Simple validation
-    if (!this.credentials.username || !this.credentials.password) {
+    if (!this.credentials.username && !this.credentials.password) {
       this.isLoginLoading = false;
       this.message = 'Please enter both username and password';
killedBy: LoginPage should set message when only username is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please enter both username and password"
Received: "Invalid username or password"

[Survived] BooleanLiteral
shared/pages/login-page/login-page.ts:73:29
 
     // Simple validation
     if (!this.credentials.username || !this.credentials.password) {
-      this.isLoginLoading = false;
+      this.isLoginLoading = true;
       this.message = 'Please enter both username and password';
       this.messageError = true;

[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:75:27
     if (!this.credentials.username || !this.credentials.password) {
       this.isLoginLoading = false;
       this.message = 'Please enter both username and password';
-      this.messageError = true;
+      this.messageError = false;
       return;
     }
killedBy: LoginPage should set message when credentials are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:81:29
 
     this.authService
       .login(this.credentials.username, this.credentials.password)
-      .subscribe(success => {
-        this.isLoginLoading = false;
-        if (success) {
-          const user = this.authService.user();
-          if (user?.isAdmin) {
-            this.router.navigate(['/admin/users']);
-          } else {
-            this.router.navigate(['/shop/products']);
-          }
-        } else {
-          this.message = 'Invalid username or password';
-          this.messageError = true;
-        }
-      });
+      .subscribe(success => {});
   }
 
killedBy: LoginPage should set message for wrong credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid username or password"
Received: null

[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:82:31
     this.authService
       .login(this.credentials.username, this.credentials.password)
       .subscribe(success => {
-        this.isLoginLoading = false;
+        this.isLoginLoading = true;
         if (success) {
           const user = this.authService.user();
killedBy: LoginPage should set isLoginLoading to false after login completes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:83:22
       .login(this.credentials.username, this.credentials.password)
       .subscribe(success => {
         this.isLoginLoading = false;
-        if (success) {
-          const user = this.authService.user();
-          if (user?.isAdmin) {
-            this.router.navigate(['/admin/users']);
-          } else {
-            this.router.navigate(['/shop/products']);
-          }
-        } else {
+        if (success) {} else {
           this.message = 'Invalid username or password';
           this.messageError = true;
killedBy: LoginPage should navigate to /admin/users on successful admin login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/admin/users"]

Number of calls: 0

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:83:13
       .login(this.credentials.username, this.credentials.password)
       .subscribe(success => {
         this.isLoginLoading = false;
-        if (success) {
+        if (false) {
           const user = this.authService.user();
           if (user?.isAdmin) {
killedBy: LoginPage should navigate to /admin/users on successful admin login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/admin/users"]

Number of calls: 0

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:85:15
         this.isLoginLoading = false;
         if (success) {
           const user = this.authService.user();
-          if (user?.isAdmin) {
+          if (false) {
             this.router.navigate(['/admin/users']);
           } else {
killedBy: LoginPage should navigate to /admin/users on successful admin login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/admin/users",
+   "/shop/products",

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:85:15
         this.isLoginLoading = false;
         if (success) {
           const user = this.authService.user();
-          if (user?.isAdmin) {
+          if (true) {
             this.router.navigate(['/admin/users']);
           } else {
killedBy: LoginPage should navigate to /shop/products on successful customer login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/shop/products",
+   "/admin/users",

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:90:16
           } else {
             this.router.navigate(['/shop/products']);
           }
-        } else {
-          this.message = 'Invalid username or password';
-          this.messageError = true;
-        }
+        } else {}
       });
   }
killedBy: LoginPage should set message for wrong credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid username or password"
Received: null

[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:92:31
           }
         } else {
           this.message = 'Invalid username or password';
-          this.messageError = true;
+          this.messageError = false;
         }
       });
killedBy: LoginPage should set message for wrong credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
shared/pages/login-page/login-page.ts:98:27
   }
 
   onRegister() {
-    this.isLoginLoading = true;
+    this.isLoginLoading = false;
     this.message = null;
     this.messageError = false;

[Killed] StringLiteral
shared/pages/login-page/login-page.ts:105:22
     // Simple validation
     if (!this.credentials.username || !this.credentials.password) {
       this.isLoginLoading = false;
-      this.message = 'Please enter both username and password';
+      this.message = "";
       this.messageError = true;
       return;
killedBy: LoginPage should set message when register credentials are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please enter both username and password"
Received: ""

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:112:29
 
     this.authService
       .register(this.credentials.username, this.credentials.password)
-      .subscribe(success => {
-        this.isLoginLoading = false;
-        if (success) {
-          this.message = 'Registration successful! Redirecting to shop...';
-          this.messageError = false;
-          setTimeout(() => {
-            this.router.navigate(['/shop/products']);
-          }, 1000);
-        } else {
-          this.message = 'Username already taken';
-          this.messageError = true;
-        }
-      });
+      .subscribe(success => {});
   }
 
killedBy: LoginPage should set message when username already taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Username already taken"
Received: null

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:114:13
       .register(this.credentials.username, this.credentials.password)
       .subscribe(success => {
         this.isLoginLoading = false;
-        if (success) {
+        if (true) {
           this.message = 'Registration successful! Redirecting to shop...';
           this.messageError = false;
killedBy: LoginPage should set message when username already taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Username already taken"
Received: "Registration successful! Redirecting to shop..."

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:114:22
       .register(this.credentials.username, this.credentials.password)
       .subscribe(success => {
         this.isLoginLoading = false;
-        if (success) {
-          this.message = 'Registration successful! Redirecting to shop...';
-          this.messageError = false;
-          setTimeout(() => {
-            this.router.navigate(['/shop/products']);
-          }, 1000);
-        } else {
+        if (success) {} else {
           this.message = 'Username already taken';
           this.messageError = true;
killedBy: LoginPage should show success message and navigate on successful registration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Registration successful! Redirecting to shop..."
Received: null

[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:116:31
         this.isLoginLoading = false;
         if (success) {
           this.message = 'Registration successful! Redirecting to shop...';
-          this.messageError = false;
+          this.messageError = true;
           setTimeout(() => {
             this.router.navigate(['/shop/products']);
killedBy: LoginPage should show success message and navigate on successful registration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:117:28
         if (success) {
           this.message = 'Registration successful! Redirecting to shop...';
           this.messageError = false;
-          setTimeout(() => {
-            this.router.navigate(['/shop/products']);
-          }, 1000);
+          setTimeout(() => {}, 1000);
         } else {
           this.message = 'Username already taken';
killedBy: LoginPage should show success message and navigate on successful registration
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/shop/products"]

Number of calls: 0

[Killed] ArrayDeclaration
shared/pages/login-page/login-page.ts:118:34
           this.message = 'Registration successful! Redirecting to shop...';
           this.messageError = false;
           setTimeout(() => {
-            this.router.navigate(['/shop/products']);
+            this.router.navigate([]);
           }, 1000);
         } else {
killedBy: LoginPage should show success message and navigate on successful registration
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/shop/products",
- ]

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:120:16
           setTimeout(() => {
             this.router.navigate(['/shop/products']);
           }, 1000);
-        } else {
-          this.message = 'Username already taken';
-          this.messageError = true;
-        }
+        } else {}
       });
   }
killedBy: LoginPage should set message when username already taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Username already taken"
Received: null

[Killed] StringLiteral
shared/pages/login-page/login-page.ts:121:26
             this.router.navigate(['/shop/products']);
           }, 1000);
         } else {
-          this.message = 'Username already taken';
+          this.message = "";
           this.messageError = true;
         }
killedBy: LoginPage should set message when username already taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Username already taken"
Received: ""

[Killed] BooleanLiteral
shared/pages/login-page/login-page.ts:122:31
           }, 1000);
         } else {
           this.message = 'Username already taken';
-          this.messageError = true;
+          this.messageError = false;
         }
       });
killedBy: LoginPage should set message when username already taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:127:19
       });
   }
 
-  switchToLogin() {
-    this.authMode = 'login';
-    this.tabIndex = 0;
-    this.message = null;
-    this.messageError = false;
-    this.credentials = { username: '', password: '' };
-  }
+  switchToLogin() {}
 
   switchToRegister() {
killedBy: LoginPage should switch to login mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "login"
Received: "register"

[Killed] StringLiteral
shared/pages/login-page/login-page.ts:132:50
     this.tabIndex = 0;
     this.message = null;
     this.messageError = false;
-    this.credentials = { username: '', password: '' };
+    this.credentials = { username: '', password: "Stryker was here!" };
   }
 
killedBy: LoginPage should switch to login mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:135:22
     this.credentials = { username: '', password: '' };
   }
 
-  switchToRegister() {
-    this.authMode = 'register';
-    this.tabIndex = 1;
-    this.message = null;
-    this.messageError = false;
-    this.credentials = { username: '', password: '' };
-  }
+  switchToRegister() {}
 
   onTabChange(index: number) {
killedBy: LoginPage should switch to register mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "register"
Received: "login"

[Killed] StringLiteral
shared/pages/login-page/login-page.ts:136:21
   }
 
   switchToRegister() {
-    this.authMode = 'register';
+    this.authMode = "";
     this.tabIndex = 1;
     this.message = null;
killedBy: LoginPage should switch to register mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "register"
Received: ""

[Killed] ObjectLiteral
shared/pages/login-page/login-page.ts:140:24
     this.tabIndex = 1;
     this.message = null;
     this.messageError = false;
-    this.credentials = { username: '', password: '' };
+    this.credentials = {};
   }
 
killedBy: LoginPage should switch to register mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:143:30
     this.credentials = { username: '', password: '' };
   }
 
-  onTabChange(index: number) {
-    if (index === 0) {
-      this.authMode = 'login';
-    } else {
-      this.authMode = 'register';
-    }
-    this.message = null;
-    this.messageError = false;
-    this.credentials = { username: '', password: '' };
-  }
+  onTabChange(index: number) {}
 }
 
killedBy: LoginPage should handle tab change to register
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "register"
Received: "login"

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:144:9
   }
 
   onTabChange(index: number) {
-    if (index === 0) {
+    if (true) {
       this.authMode = 'login';
     } else {
killedBy: LoginPage should handle tab change to register
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "register"
Received: "login"

[Killed] ConditionalExpression
shared/pages/login-page/login-page.ts:144:9
   }
 
   onTabChange(index: number) {
-    if (index === 0) {
+    if (false) {
       this.authMode = 'login';
     } else {
killedBy: LoginPage should handle tab change to login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "login"
Received: "register"

[Killed] BlockStatement
shared/pages/login-page/login-page.ts:146:12
   onTabChange(index: number) {
     if (index === 0) {
       this.authMode = 'login';
-    } else {
-      this.authMode = 'register';
-    }
+    } else {}
     this.message = null;
     this.messageError = false;
killedBy: LoginPage should handle tab change to register
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "register"
Received: "login"

[Killed] StringLiteral
shared/pages/login-page/login-page.ts:147:23
     if (index === 0) {
       this.authMode = 'login';
     } else {
-      this.authMode = 'register';
+      this.authMode = "";
     }
     this.message = null;
killedBy: LoginPage should handle tab change to register
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "register"
Received: ""

[Killed] StringLiteral
shared/pages/login-page/login-page.ts:151:36
     }
     this.message = null;
     this.messageError = false;
-    this.credentials = { username: '', password: '' };
+    this.credentials = { username: "Stryker was here!", password: '' };
   }
 }
killedBy: LoginPage should handle tab change to login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"
