[Survived] BooleanLiteral
carriers/components/carrier-dialog/carrier-dialog.ts:38:15
   @Inject(MAT_DIALOG_DATA) public data: CarrierDialogData = {};
 
   carrierForm!: FormGroup;
-  isEditing = !!this.data.carrier;
+  isEditing = !this.data.carrier;
   hasUnsavedChanges = signal(false);
 

[Killed] BooleanLiteral
carriers/components/carrier-dialog/carrier-dialog.ts:39:30
 
   carrierForm!: FormGroup;
   isEditing = !!this.data.carrier;
-  hasUnsavedChanges = signal(false);
+  hasUnsavedChanges = signal(true);
 
   ngOnInit(): void {
killedBy: CarrierDialog should return false from hasUnsavedChangesFn initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
carriers/components/carrier-dialog/carrier-dialog.ts:41:20
   isEditing = !!this.data.carrier;
   hasUnsavedChanges = signal(false);
 
-  ngOnInit(): void {
-    this.initializeForm();
-  }
+  ngOnInit(): void {}
 
   private initializeForm(): void {
killedBy: CarrierDialog should create
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Killed] BlockStatement
carriers/components/carrier-dialog/carrier-dialog.ts:45:34
     this.initializeForm();
   }
 
-  private initializeForm(): void {
-    this.carrierForm = this.fb.group({
-      name: [this.data.carrier?.name || '', Validators.required],
-      trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
-      isActive: [this.data.carrier?.isActive || true],
-    });
-
-    // Listen for form changes to track unsaved changes
-    this.carrierForm.valueChanges.subscribe(() => {
-      this.hasUnsavedChanges.set(true);
-    });
-  }
+  private initializeForm(): void {}
 
   onSubmit(): void {
killedBy: CarrierDialog should create
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Killed] ObjectLiteral
carriers/components/carrier-dialog/carrier-dialog.ts:46:38
   }
 
   private initializeForm(): void {
-    this.carrierForm = this.fb.group({
-      name: [this.data.carrier?.name || '', Validators.required],
-      trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
-      isActive: [this.data.carrier?.isActive || true],
-    });
+    this.carrierForm = this.fb.group({});
 
     // Listen for form changes to track unsaved changes
killedBy: CarrierDialog should create
statusReason: Error: Cannot find control with name: 'name'

[Killed] ConditionalExpression
carriers/components/carrier-dialog/carrier-dialog.ts:47:14
 
   private initializeForm(): void {
     this.carrierForm = this.fb.group({
-      name: [this.data.carrier?.name || '', Validators.required],
+      name: [true, Validators.required],
       trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
       isActive: [this.data.carrier?.isActive || true],
killedBy: CarrierDialog should initialize form with default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: true

[Killed] ConditionalExpression
carriers/components/carrier-dialog/carrier-dialog.ts:47:14
 
   private initializeForm(): void {
     this.carrierForm = this.fb.group({
-      name: [this.data.carrier?.name || '', Validators.required],
+      name: [false, Validators.required],
       trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
       isActive: [this.data.carrier?.isActive || true],
killedBy: CarrierDialog should initialize form with default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: false

[Killed] OptionalChaining
carriers/components/carrier-dialog/carrier-dialog.ts:48:21
   private initializeForm(): void {
     this.carrierForm = this.fb.group({
       name: [this.data.carrier?.name || '', Validators.required],
-      trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
+      trackingUrl: [this.data.carrier.trackingUrl || '', Validators.required],
       isActive: [this.data.carrier?.isActive || true],
     });
killedBy: CarrierDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'trackingUrl')

[Killed] LogicalOperator
carriers/components/carrier-dialog/carrier-dialog.ts:48:21
   private initializeForm(): void {
     this.carrierForm = this.fb.group({
       name: [this.data.carrier?.name || '', Validators.required],
-      trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
+      trackingUrl: [this.data.carrier?.trackingUrl && '', Validators.required],
       isActive: [this.data.carrier?.isActive || true],
     });
killedBy: CarrierDialog should initialize form with default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Killed] ConditionalExpression
carriers/components/carrier-dialog/carrier-dialog.ts:49:18
     this.carrierForm = this.fb.group({
       name: [this.data.carrier?.name || '', Validators.required],
       trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
-      isActive: [this.data.carrier?.isActive || true],
+      isActive: [false],
     });
 
killedBy: CarrierDialog should initialize form with default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
carriers/components/carrier-dialog/carrier-dialog.ts:49:49
     this.carrierForm = this.fb.group({
       name: [this.data.carrier?.name || '', Validators.required],
       trackingUrl: [this.data.carrier?.trackingUrl || '', Validators.required],
-      isActive: [this.data.carrier?.isActive || true],
+      isActive: [this.data.carrier?.isActive || false],
     });
 
killedBy: CarrierDialog should initialize form with default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
carriers/components/carrier-dialog/carrier-dialog.ts:53:51
     });
 
     // Listen for form changes to track unsaved changes
-    this.carrierForm.valueChanges.subscribe(() => {
-      this.hasUnsavedChanges.set(true);
-    });
+    this.carrierForm.valueChanges.subscribe(() => {});
   }
 
killedBy: CarrierDialog should return true from hasUnsavedChangesFn after form changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
carriers/components/carrier-dialog/carrier-dialog.ts:54:34
 
     // Listen for form changes to track unsaved changes
     this.carrierForm.valueChanges.subscribe(() => {
-      this.hasUnsavedChanges.set(true);
+      this.hasUnsavedChanges.set(false);
     });
   }
killedBy: CarrierDialog should return true from hasUnsavedChangesFn after form changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
carriers/components/carrier-dialog/carrier-dialog.ts:58:20
     });
   }
 
-  onSubmit(): void {
-    if (this.carrierForm.valid) {
-      const formData = this.carrierForm.value;
-      const carrierData: Carrier = {
-        ...this.data.carrier,
-        ...formData,
-        id: this.data.carrier?.id || 0,
-        createdAt: this.data.carrier?.createdAt || new Date(),
-        updatedAt: new Date(),
-      };
-
-      this.dialogRef.close(carrierData);
-    }
-  }
+  onSubmit(): void {}
 
   onCancel(): void {
killedBy: CarrierDialog should close dialog with data on valid submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
carriers/components/carrier-dialog/carrier-dialog.ts:59:9
   }
 
   onSubmit(): void {
-    if (this.carrierForm.valid) {
+    if (true) {
       const formData = this.carrierForm.value;
       const carrierData: Carrier = {
killedBy: CarrierDialog should not close dialog on invalid submit
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"createdAt": 2026-04-23T08:52:28.747Z, "id": 0, "isActive": true, "name": "", "trackingUrl": "", "updatedAt": 2026-04-23T08:52:28.747Z}

[Killed] ConditionalExpression
carriers/components/carrier-dialog/carrier-dialog.ts:59:9
   }
 
   onSubmit(): void {
-    if (this.carrierForm.valid) {
+    if (false) {
       const formData = this.carrierForm.value;
       const carrierData: Carrier = {
killedBy: CarrierDialog should close dialog with data on valid submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] OptionalChaining
carriers/components/carrier-dialog/carrier-dialog.ts:64:13
       const carrierData: Carrier = {
         ...this.data.carrier,
         ...formData,
-        id: this.data.carrier?.id || 0,
+        id: this.data.carrier.id || 0,
         createdAt: this.data.carrier?.createdAt || new Date(),
         updatedAt: new Date(),
killedBy: CarrierDialog should close dialog with data on valid submit
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ConditionalExpression
carriers/components/carrier-dialog/carrier-dialog.ts:64:13
       const carrierData: Carrier = {
         ...this.data.carrier,
         ...formData,
-        id: this.data.carrier?.id || 0,
+        id: true,
         createdAt: this.data.carrier?.createdAt || new Date(),
         updatedAt: new Date(),

[Killed] OptionalChaining
carriers/components/carrier-dialog/carrier-dialog.ts:65:20
         ...this.data.carrier,
         ...formData,
         id: this.data.carrier?.id || 0,
-        createdAt: this.data.carrier?.createdAt || new Date(),
+        createdAt: this.data.carrier.createdAt || new Date(),
         updatedAt: new Date(),
       };
killedBy: CarrierDialog should close dialog with data on valid submit
statusReason: TypeError: Cannot read properties of undefined (reading 'createdAt')

[Survived] ConditionalExpression
carriers/components/carrier-dialog/carrier-dialog.ts:65:20
         ...this.data.carrier,
         ...formData,
         id: this.data.carrier?.id || 0,
-        createdAt: this.data.carrier?.createdAt || new Date(),
+        createdAt: true,
         updatedAt: new Date(),
       };

[Killed] BlockStatement
carriers/components/carrier-dialog/carrier-dialog.ts:73:20
     }
   }
 
-  onCancel(): void {
-    this.dialogRef.close();
-  }
+  onCancel(): void {}
 
   hasUnsavedChangesFn(): boolean {
killedBy: CarrierDialog should close dialog on cancel
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
carriers/components/carrier-dialog/carrier-dialog.ts:77:34
     this.dialogRef.close();
   }
 
-  hasUnsavedChangesFn(): boolean {
-    return this.hasUnsavedChanges();
-  }
+  hasUnsavedChangesFn(): boolean {}
 }
 
killedBy: CarrierDialog should return false from hasUnsavedChangesFn initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
