[Killed] ObjectLiteral
carriers/components/carriers-page/carriers-page.ts:66:5
   private changeDetectorRef = inject(ChangeDetectorRef);
 
   columns = [
-    { key: 'id', label: 'ID' },
+    {},
     { key: 'name', label: 'Name' },
     { key: 'trackingUrl', label: 'Tracking URL' },
killedBy: CarriersPage should create
statusReason: TypeError: columnDef._columnCssClassName is not iterable (cannot read property undefined)

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:66:12
   private changeDetectorRef = inject(ChangeDetectorRef);
 
   columns = [
-    { key: 'id', label: 'ID' },
+    { key: "", label: 'ID' },
     { key: 'name', label: 'Name' },
     { key: 'trackingUrl', label: 'Tracking URL' },
killedBy: CarriersPage should create
statusReason: Error: Could not find column with id "".

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:67:27
 
   columns = [
     { key: 'id', label: 'ID' },
-    { key: 'name', label: 'Name' },
+    { key: 'name', label: "" },
     { key: 'trackingUrl', label: 'Tracking URL' },
     { key: 'isActive', label: 'Active' },
killedBy: CarriersPage should have correct column labels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Name"
Received: ""

[Killed] ObjectLiteral
carriers/components/carriers-page/carriers-page.ts:67:5
 
   columns = [
     { key: 'id', label: 'ID' },
-    { key: 'name', label: 'Name' },
+    {},
     { key: 'trackingUrl', label: 'Tracking URL' },
     { key: 'isActive', label: 'Active' },
killedBy: CarriersPage should create
statusReason: TypeError: columnDef._columnCssClassName is not iterable (cannot read property undefined)

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:68:34
   columns = [
     { key: 'id', label: 'ID' },
     { key: 'name', label: 'Name' },
-    { key: 'trackingUrl', label: 'Tracking URL' },
+    { key: 'trackingUrl', label: "" },
     { key: 'isActive', label: 'Active' },
     { key: 'createdAt', label: 'Created' },
killedBy: CarriersPage should have correct column labels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Tracking URL"
Received: ""

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:69:12
     { key: 'id', label: 'ID' },
     { key: 'name', label: 'Name' },
     { key: 'trackingUrl', label: 'Tracking URL' },
-    { key: 'isActive', label: 'Active' },
+    { key: "", label: 'Active' },
     { key: 'createdAt', label: 'Created' },
     { key: 'updatedAt', label: 'Updated' },
killedBy: CarriersPage should create
statusReason: Error: Could not find column with id "".

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:70:32
     { key: 'name', label: 'Name' },
     { key: 'trackingUrl', label: 'Tracking URL' },
     { key: 'isActive', label: 'Active' },
-    { key: 'createdAt', label: 'Created' },
+    { key: 'createdAt', label: "" },
     { key: 'updatedAt', label: 'Updated' },
   ];
killedBy: CarriersPage should have correct column labels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Created"
Received: ""

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:71:12
     { key: 'trackingUrl', label: 'Tracking URL' },
     { key: 'isActive', label: 'Active' },
     { key: 'createdAt', label: 'Created' },
-    { key: 'updatedAt', label: 'Updated' },
+    { key: "", label: 'Updated' },
   ];
   private readonly dateColumns = ['createdAt', 'updatedAt'];
killedBy: CarriersPage should create
statusReason: Error: Could not find column with id "".

[Killed] ArrowFunction
carriers/components/carriers-page/carriers-page.ts:75:53
   ];
   private readonly dateColumns = ['createdAt', 'updatedAt'];
   private readonly booleanColumns = ['isActive'];
-  displayedColumns = ['select', ...this.columns.map(c => c.key)];
+  displayedColumns = ['select', ...this.columns.map(() => undefined)];
   selection = new SelectionModel<Carrier>(true, []);
   dataSource = new MatTableDataSource<Carrier>();
killedBy: CarriersPage should create
statusReason: Error: Could not find column with id "undefined".

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:75:23
   ];
   private readonly dateColumns = ['createdAt', 'updatedAt'];
   private readonly booleanColumns = ['isActive'];
-  displayedColumns = ['select', ...this.columns.map(c => c.key)];
+  displayedColumns = ["", ...this.columns.map(c => c.key)];
   selection = new SelectionModel<Carrier>(true, []);
   dataSource = new MatTableDataSource<Carrier>();
killedBy: CarriersPage should create
statusReason: Error: Could not find column with id "".

[Killed] BooleanLiteral
carriers/components/carriers-page/carriers-page.ts:76:43
   private readonly dateColumns = ['createdAt', 'updatedAt'];
   private readonly booleanColumns = ['isActive'];
   displayedColumns = ['select', ...this.columns.map(c => c.key)];
-  selection = new SelectionModel<Carrier>(true, []);
+  selection = new SelectionModel<Carrier>(false, []);
   dataSource = new MatTableDataSource<Carrier>();
   filterValue = '';
killedBy: CarriersPage should not edit when multiple carriers selected
statusReason: Error: Cannot pass multiple values into SelectionModel with single-value mode.

[Killed] ArrayDeclaration
carriers/components/carriers-page/carriers-page.ts:76:49
   private readonly dateColumns = ['createdAt', 'updatedAt'];
   private readonly booleanColumns = ['isActive'];
   displayedColumns = ['select', ...this.columns.map(c => c.key)];
-  selection = new SelectionModel<Carrier>(true, []);
+  selection = new SelectionModel<Carrier>(true, ["Stryker was here"]);
   dataSource = new MatTableDataSource<Carrier>();
   filterValue = '';
killedBy: CarriersPage should check if all selected - all selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
carriers/components/carriers-page/carriers-page.ts:78:17
   displayedColumns = ['select', ...this.columns.map(c => c.key)];
   selection = new SelectionModel<Carrier>(true, []);
   dataSource = new MatTableDataSource<Carrier>();
-  filterValue = '';
+  filterValue = "Stryker was here!";
   private dialogOpen = signal(false);
   private activeDialogRef: MatDialogRef<CarrierDialog> | null = null;

[Survived] BooleanLiteral
carriers/components/carriers-page/carriers-page.ts:79:31
   selection = new SelectionModel<Carrier>(true, []);
   dataSource = new MatTableDataSource<Carrier>();
   filterValue = '';
-  private dialogOpen = signal(false);
+  private dialogOpen = signal(true);
   private activeDialogRef: MatDialogRef<CarrierDialog> | null = null;
 

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:89:39
   @ViewChild(MatSort) sort!: MatSort;
   @ViewChild(MatPaginator) paginator!: MatPaginator;
 
-  readonly errorEffect = effect(() => {
-    const msg = this.error();
-    if (msg) {
-      this.snackBar.open(msg, 'Close', { duration: 4000 });
-    }
-  });
+  readonly errorEffect = effect(() => {});
 
   readonly tableEffect = effect(() => {
killedBy: CarriersPage should show snackbar with error message via error effect
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Test error", "Close", {"duration": 4000}

Number of calls: 0

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:91:14
 
   readonly errorEffect = effect(() => {
     const msg = this.error();
-    if (msg) {
-      this.snackBar.open(msg, 'Close', { duration: 4000 });
-    }
+    if (msg) {}
   });
 
killedBy: CarriersPage should show snackbar with error message via error effect
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Test error", "Close", {"duration": 4000}

Number of calls: 0

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:91:9
 
   readonly errorEffect = effect(() => {
     const msg = this.error();
-    if (msg) {
+    if (false) {
       this.snackBar.open(msg, 'Close', { duration: 4000 });
     }
killedBy: CarriersPage should show snackbar with error message via error effect
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Test error", "Close", {"duration": 4000}

Number of calls: 0

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:96:39
     }
   });
 
-  readonly tableEffect = effect(() => {
-    this.dataSource.data = this.carriers();
-    this.applyFilter(this.filterValue);
-    this.changeDetectorRef.markForCheck();
-  });
+  readonly tableEffect = effect(() => {});
 
   ngOnInit() {
killedBy: CarriersPage should set dataSource data from carriers signal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "createdAt": 2024-01-01T00:00:00.000Z,

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:102:14
     this.changeDetectorRef.markForCheck();
   });
 
-  ngOnInit() {
-    this.carrierService.loadCarriers();
-  }
+  ngOnInit() {}
 
   ngAfterViewInit() {
killedBy: CarriersPage should load carriers on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BlockStatement
carriers/components/carriers-page/carriers-page.ts:106:21
     this.carrierService.loadCarriers();
   }
 
-  ngAfterViewInit() {
-    this.dataSource.sort = this.sort;
-    this.dataSource.paginator = this.paginator;
-  }
+  ngAfterViewInit() {}
 
   applyFilter(value: string) {

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:111:30
     this.dataSource.paginator = this.paginator;
   }
 
-  applyFilter(value: string) {
-    this.filterValue = value.trim().toLowerCase();
-    this.dataSource.filter = this.filterValue;
-  }
+  applyFilter(value: string) {}
 
   isAllSelected() {
killedBy: CarriersPage should apply filter with trim and lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: ""

[Killed] MethodExpression
carriers/components/carriers-page/carriers-page.ts:112:24
   }
 
   applyFilter(value: string) {
-    this.filterValue = value.trim().toLowerCase();
+    this.filterValue = value.trim().toUpperCase();
     this.dataSource.filter = this.filterValue;
   }
killedBy: CarriersPage should apply filter with trim and lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: "TEST"

[Killed] MethodExpression
carriers/components/carriers-page/carriers-page.ts:112:24
   }
 
   applyFilter(value: string) {
-    this.filterValue = value.trim().toLowerCase();
+    this.filterValue = value.toLowerCase();
     this.dataSource.filter = this.filterValue;
   }
killedBy: CarriersPage should apply filter with trim and lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: "  test  "

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:116:19
     this.dataSource.filter = this.filterValue;
   }
 
-  isAllSelected() {
-    const numSelected = this.selection.selected.length;
-    const numRows = this.dataSource.data.length;
-    return numSelected === numRows;
-  }
+  isAllSelected() {}
 
   toggleAllRows() {
killedBy: CarriersPage should check if all selected - all selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
carriers/components/carriers-page/carriers-page.ts:119:12
   isAllSelected() {
     const numSelected = this.selection.selected.length;
     const numRows = this.dataSource.data.length;
-    return numSelected === numRows;
+    return numSelected !== numRows;
   }
 
killedBy: CarriersPage should check if all selected - all selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:119:12
   isAllSelected() {
     const numSelected = this.selection.selected.length;
     const numRows = this.dataSource.data.length;
-    return numSelected === numRows;
+    return false;
   }
 
killedBy: CarriersPage should check if all selected - all selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:122:19
     return numSelected === numRows;
   }
 
-  toggleAllRows() {
-    if (this.isAllSelected()) {
-      this.selection.clear();
-    } else {
-      this.dataSource.data.forEach(row => this.selection.select(row));
-    }
-  }
+  toggleAllRows() {}
 
   openAddDialog() {
killedBy: CarriersPage should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:123:9
   }
 
   toggleAllRows() {
-    if (this.isAllSelected()) {
+    if (true) {
       this.selection.clear();
     } else {
killedBy: CarriersPage should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:123:9
   }
 
   toggleAllRows() {
-    if (this.isAllSelected()) {
+    if (false) {
       this.selection.clear();
     } else {
killedBy: CarriersPage should toggle all rows - deselect all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:125:12
   toggleAllRows() {
     if (this.isAllSelected()) {
       this.selection.clear();
-    } else {
-      this.dataSource.data.forEach(row => this.selection.select(row));
-    }
+    } else {}
   }
 
killedBy: CarriersPage should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
carriers/components/carriers-page/carriers-page.ts:126:36
     if (this.isAllSelected()) {
       this.selection.clear();
     } else {
-      this.dataSource.data.forEach(row => this.selection.select(row));
+      this.dataSource.data.forEach(() => undefined);
     }
   }
killedBy: CarriersPage should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:130:19
     }
   }
 
-  openAddDialog() {
-    const ref = this.dialog.open(CarrierDialog, {
-      data: { carrier: undefined },
-      panelClass: 'carrier-dialog',
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
-    ref.afterClosed().subscribe((result: Carrier | undefined) => {
-      this.activeDialogRef = null;
-      if (result) {
-        this.carrierService.addCarrier(result);
-        this.snackBar.open('Carrier added successfully', 'Close', { duration: 3000 });
-      }
-    });
-    return ref as MatDialogRef<CarrierDialog>;
-  }
+  openAddDialog() {}
 
   openEditDialog(carrier: Carrier) {
killedBy: CarriersPage should call addCarrier
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"closeOnNavigation": false, "data": {"carrier": undefined}, "panelClass": "carrier-dialog"}

Number of calls: 0

[Killed] ObjectLiteral
carriers/components/carriers-page/carriers-page.ts:131:49
   }
 
   openAddDialog() {
-    const ref = this.dialog.open(CarrierDialog, {
-      data: { carrier: undefined },
-      panelClass: 'carrier-dialog',
-      closeOnNavigation: false,
-    });
+    const ref = this.dialog.open(CarrierDialog, {});
 
     this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
killedBy: CarriersPage should call addCarrier
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"closeOnNavigation": false, "data": {"carrier": undefined}, "panelClass": "carrier-dialog"}
Received: [Function CarrierDialog], {}

Number of calls: 1

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:133:19
   openAddDialog() {
     const ref = this.dialog.open(CarrierDialog, {
       data: { carrier: undefined },
-      panelClass: 'carrier-dialog',
+      panelClass: "",
       closeOnNavigation: false,
     });
killedBy: CarriersPage should call addCarrier
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"closeOnNavigation": false, "data": {"carrier": undefined}, "panelClass": "carrier-dialog"}
Received: [Function CarrierDialog], {"closeOnNavigation": false, "data": {"carrier": undefined}, "panelClass": ""}

Number of calls: 1

[Killed] BooleanLiteral
carriers/components/carriers-page/carriers-page.ts:134:26
     const ref = this.dialog.open(CarrierDialog, {
       data: { carrier: undefined },
       panelClass: 'carrier-dialog',
-      closeOnNavigation: false,
+      closeOnNavigation: true,
     });
 
killedBy: CarriersPage should call addCarrier
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"closeOnNavigation": false, "data": {"carrier": undefined}, "panelClass": "carrier-dialog"}
Received: [Function CarrierDialog], {"closeOnNavigation": true, "data": {"carrier": undefined}, "panelClass": "carrier-dialog"}

Number of calls: 1

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:138:66
     });
 
     this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
-    ref.afterClosed().subscribe((result: Carrier | undefined) => {
-      this.activeDialogRef = null;
-      if (result) {
-        this.carrierService.addCarrier(result);
-        this.snackBar.open('Carrier added successfully', 'Close', { duration: 3000 });
-      }
-    });
+    ref.afterClosed().subscribe((result: Carrier | undefined) => {});
     return ref as MatDialogRef<CarrierDialog>;
   }
killedBy: CarriersPage should open add dialog and add carrier on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": 2026-04-24T09:01:33.184Z, "id": 0, "isActive": true, "name": "New Carrier", "trackingUrl": "https://new.com", "updatedAt": 2026-04-24T09:01:33.184Z}

Number of calls: 0

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:140:11
     this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
     ref.afterClosed().subscribe((result: Carrier | undefined) => {
       this.activeDialogRef = null;
-      if (result) {
+      if (false) {
         this.carrierService.addCarrier(result);
         this.snackBar.open('Carrier added successfully', 'Close', { duration: 3000 });
killedBy: CarriersPage should open add dialog and add carrier on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": 2026-04-24T09:01:36.048Z, "id": 0, "isActive": true, "name": "New Carrier", "trackingUrl": "https://new.com", "updatedAt": 2026-04-24T09:01:36.048Z}

Number of calls: 0

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:140:11
     this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
     ref.afterClosed().subscribe((result: Carrier | undefined) => {
       this.activeDialogRef = null;
-      if (result) {
+      if (true) {
         this.carrierService.addCarrier(result);
         this.snackBar.open('Carrier added successfully', 'Close', { duration: 3000 });
killedBy: CarriersPage should not add carrier when dialog closed without result
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: undefined

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:142:28
       this.activeDialogRef = null;
       if (result) {
         this.carrierService.addCarrier(result);
-        this.snackBar.open('Carrier added successfully', 'Close', { duration: 3000 });
+        this.snackBar.open("", 'Close', { duration: 3000 });
       }
     });
killedBy: CarriersPage should open add dialog and add carrier on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "Carrier added successfully",
+ "",
  "Close",

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:142:58
       this.activeDialogRef = null;
       if (result) {
         this.carrierService.addCarrier(result);
-        this.snackBar.open('Carrier added successfully', 'Close', { duration: 3000 });
+        this.snackBar.open('Carrier added successfully', "", { duration: 3000 });
       }
     });
killedBy: CarriersPage should open add dialog and add carrier on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Carrier added successfully",
- "Close",
+ "",

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:148:36
     return ref as MatDialogRef<CarrierDialog>;
   }
 
-  openEditDialog(carrier: Carrier) {
-    const ref = this.dialog.open(CarrierDialog, {
-      data: { carrier },
-      panelClass: 'carrier-dialog',
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
-    ref.afterClosed().subscribe((result: Carrier | undefined) => {
-      this.activeDialogRef = null;
-      if (result) {
-        this.carrierService.updateCarrier(result);
-        this.snackBar.open('Carrier updated successfully', 'Close', { duration: 3000 });
-      }
-    });
-    return ref as MatDialogRef<CarrierDialog>;
-  }
+  openEditDialog(carrier: Carrier) {}
 
   addCarrier() {
killedBy: CarriersPage should open edit dialog when one carrier selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
carriers/components/carriers-page/carriers-page.ts:150:13
 
   openEditDialog(carrier: Carrier) {
     const ref = this.dialog.open(CarrierDialog, {
-      data: { carrier },
+      data: {},
       panelClass: 'carrier-dialog',
       closeOnNavigation: false,
killedBy: CarriersPage should open edit dialog with carrier data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"closeOnNavigation": false, "data": {"carrier": {"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Test Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}}, "panelClass": "carrier-dialog"}
Received: [Function CarrierDialog], {"close

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:156:66
     });
 
     this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
-    ref.afterClosed().subscribe((result: Carrier | undefined) => {
-      this.activeDialogRef = null;
-      if (result) {
-        this.carrierService.updateCarrier(result);
-        this.snackBar.open('Carrier updated successfully', 'Close', { duration: 3000 });
-      }
-    });
+    ref.afterClosed().subscribe((result: Carrier | undefined) => {});
     return ref as MatDialogRef<CarrierDialog>;
   }
killedBy: CarriersPage should open edit dialog and update carrier on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Updated Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}

Number of calls: 0

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:158:19
     this.activeDialogRef = ref as MatDialogRef<CarrierDialog>;
     ref.afterClosed().subscribe((result: Carrier | undefined) => {
       this.activeDialogRef = null;
-      if (result) {
-        this.carrierService.updateCarrier(result);
-        this.snackBar.open('Carrier updated successfully', 'Close', { duration: 3000 });
-      }
+      if (result) {}
     });
     return ref as MatDialogRef<CarrierDialog>;
killedBy: CarriersPage should open edit dialog and update carrier on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": 2024-01-01T00:00:00.000Z, "id": 1, "isActive": true, "name": "Updated Carrier", "trackingUrl": "https://example.com/tracking", "updatedAt": 2024-01-02T00:00:00.000Z}

Number of calls: 0

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:160:60
       this.activeDialogRef = null;
       if (result) {
         this.carrierService.updateCarrier(result);
-        this.snackBar.open('Carrier updated successfully', 'Close', { duration: 3000 });
+        this.snackBar.open('Carrier updated successfully', "", { duration: 3000 });
       }
     });
killedBy: CarriersPage should open edit dialog and update carrier on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Carrier updated successfully",
- "Close",
+ "",

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:166:16
     return ref as MatDialogRef<CarrierDialog>;
   }
 
-  addCarrier() {
-    this.openAddDialog();
-  }
+  addCarrier() {}
 
   editCarrier() {
killedBy: CarriersPage should call addCarrier
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"closeOnNavigation": false, "data": {"carrier": undefined}, "panelClass": "carrier-dialog"}

Number of calls: 0

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:170:17
     this.openAddDialog();
   }
 
-  editCarrier() {
-    if (this.selection.selected.length !== 1) return;
-    this.openEditDialog(this.selection.selected[0]);
-  }
+  editCarrier() {}
 
   deleteCarriers() {
killedBy: CarriersPage should open edit dialog when one carrier selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:171:9
   }
 
   editCarrier() {
-    if (this.selection.selected.length !== 1) return;
+    if (true) return;
     this.openEditDialog(this.selection.selected[0]);
   }
killedBy: CarriersPage should open edit dialog when one carrier selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
carriers/components/carriers-page/carriers-page.ts:171:9
   }
 
   editCarrier() {
-    if (this.selection.selected.length !== 1) return;
+    if (this.selection.selected.length === 1) return;
     this.openEditDialog(this.selection.selected[0]);
   }
killedBy: CarriersPage should not edit when no carrier selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [Function CarrierDialog], {"closeOnNavigation": false, "data": {"carrier": undefined}, "panelClass": "carrier-dialog"}

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:176:9
   }
 
   deleteCarriers() {
-    if (this.selection.selected.length === 0) return;
+    if (false) return;
 
     const dialogData: ConfirmationDialogData = {
killedBy: CarriersPage should not delete when selection is empty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [Function ConfirmationDialog], {"data": {"cancelText": "Cancel", "confirmText": "Delete", "message": "Do you really want to delete 0 carrier(s)?", "title": "Delete Carriers"}}

[Killed] EqualityOperator
carriers/components/carriers-page/carriers-page.ts:176:9
   }
 
   deleteCarriers() {
-    if (this.selection.selected.length === 0) return;
+    if (this.selection.selected.length !== 0) return;
 
     const dialogData: ConfirmationDialogData = {
killedBy: CarriersPage should delete carriers when confirmed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:180:16
 
     const dialogData: ConfirmationDialogData = {
       title: 'Delete Carriers',
-      message: `Do you really want to delete ${this.selection.selected.length} carrier(s)?`,
+      message: ``,
       confirmText: 'Delete',
       cancelText: 'Cancel',
killedBy: CarriersPage should open delete confirmation dialog with correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [Function ConfirmationDialog],
  Object {
    "data": Object {

[Killed] StringLiteral
carriers/components/carriers-page/carriers-page.ts:182:19
       title: 'Delete Carriers',
       message: `Do you really want to delete ${this.selection.selected.length} carrier(s)?`,
       confirmText: 'Delete',
-      cancelText: 'Cancel',
+      cancelText: "",
     };
 
killedBy: CarriersPage should open delete confirmation dialog with correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [Function ConfirmationDialog],
  Object {
    "data": Object {
