[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:189:63
       data: dialogData,
     });
 
-    dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
-
-      this.selection.selected.forEach(carrier => {
-        this.carrierService.deleteCarrier(carrier.id);
-      });
-
-      this.selection.clear();
-      this.snackBar.open(
-        `${this.selection.selected.length} carrier(s) deleted successfully`,
-        'Close',
-        { duration: 3000 }
-      );
-      this.changeDetectorRef.markForCheck();
-    });
+    dialogRef.afterClosed().subscribe((confirmed: boolean) => {});
   }
 
killedBy: CarriersPage should delete carriers when confirmed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BooleanLiteral
carriers/components/carriers-page/carriers-page.ts:190:11
     });
 
     dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
+      if (confirmed) return;
 
       this.selection.selected.forEach(carrier => {
killedBy: CarriersPage should delete carriers when confirmed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
carriers/components/carriers-page/carriers-page.ts:190:11
     });
 
     dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
+      if (true) return;
 
       this.selection.selected.forEach(carrier => {
killedBy: CarriersPage should delete carriers when confirmed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:192:50
     dialogRef.afterClosed().subscribe((confirmed: boolean) => {
       if (!confirmed) return;
 
-      this.selection.selected.forEach(carrier => {
-        this.carrierService.deleteCarrier(carrier.id);
-      });
+      this.selection.selected.forEach(carrier => {});
 
       this.selection.clear();
killedBy: CarriersPage should delete carriers when confirmed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Survived] StringLiteral
carriers/components/carriers-page/carriers-page.ts:198:9
 
       this.selection.clear();
       this.snackBar.open(
-        `${this.selection.selected.length} carrier(s) deleted successfully`,
+        ``,
         'Close',
         { duration: 3000 }

[Survived] StringLiteral
carriers/components/carriers-page/carriers-page.ts:199:9
       this.selection.clear();
       this.snackBar.open(
         `${this.selection.selected.length} carrier(s) deleted successfully`,
-        'Close',
+        "",
         { duration: 3000 }
       );

[Survived] ObjectLiteral
carriers/components/carriers-page/carriers-page.ts:200:9
       this.snackBar.open(
         `${this.selection.selected.length} carrier(s) deleted successfully`,
         'Close',
-        { duration: 3000 }
+        {}
       );
       this.changeDetectorRef.markForCheck();

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:206:38
     });
   }
 
-  isDateColumn(key: string): boolean {
-    return this.dateColumns.includes(key);
-  }
+  isDateColumn(key: string): boolean {}
 
   isBooleanColumn(key: string): boolean {
killedBy: CarriersPage should check if column is date column
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
carriers/components/carriers-page/carriers-page.ts:210:41
     return this.dateColumns.includes(key);
   }
 
-  isBooleanColumn(key: string): boolean {
-    return this.booleanColumns.includes(key);
-  }
+  isBooleanColumn(key: string): boolean {}
 }
 
killedBy: CarriersPage should check if column is boolean column
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
