[Killed] ArrowFunction
app/features/cart/cart.service.ts:12:28
   private cartItems = signal<CartItem[]>([]);
 
   cartItems$ = this.cartItems.asReadonly();
-  cartItemCount = computed(() => this.cartItems().reduce((sum, item) => sum + item.quantity, 0));
+  cartItemCount = computed(() => undefined);
 
   addToCart(product: Product, quantity = 1) {
killedBy: CartService cartItemCount should return 0 for an empty cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArrowFunction
app/features/cart/cart.service.ts:12:58
   private cartItems = signal<CartItem[]>([]);
 
   cartItems$ = this.cartItems.asReadonly();
-  cartItemCount = computed(() => this.cartItems().reduce((sum, item) => sum + item.quantity, 0));
+  cartItemCount = computed(() => this.cartItems().reduce(() => undefined, 0));
 
   addToCart(product: Product, quantity = 1) {
killedBy: CartService cartItemCount should return the total count of items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
app/features/cart/cart.service.ts:14:45
   cartItems$ = this.cartItems.asReadonly();
   cartItemCount = computed(() => this.cartItems().reduce((sum, item) => sum + item.quantity, 0));
 
-  addToCart(product: Product, quantity = 1) {
-    const current = this.cartItems();
-    const existingItem = current.find(item => item.product.id === product.id);
-
-    if (existingItem) {
-      this.cartItems.update(items =>
-        items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
-        )
-      );
-    } else {
-      this.cartItems.update(items => [...items, { product, quantity }]);
-    }
-  }
+  addToCart(product: Product, quantity = 1) {}
 
   removeFromCart(productId: number) {
killedBy: CartService addToCart should add a new product to the cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:16:47
 
   addToCart(product: Product, quantity = 1) {
     const current = this.cartItems();
-    const existingItem = current.find(item => item.product.id === product.id);
+    const existingItem = current.find(item => true);
 
     if (existingItem) {
killedBy: CartService addToCart should handle adding different products
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArrowFunction
app/features/cart/cart.service.ts:16:39
 
   addToCart(product: Product, quantity = 1) {
     const current = this.cartItems();
-    const existingItem = current.find(item => item.product.id === product.id);
+    const existingItem = current.find(() => undefined);
 
     if (existingItem) {
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:18:9
     const current = this.cartItems();
     const existingItem = current.find(item => item.product.id === product.id);
 
-    if (existingItem) {
+    if (false) {
       this.cartItems.update(items =>
         items.map(item =>
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
app/features/cart/cart.service.ts:18:23
     const current = this.cartItems();
     const existingItem = current.find(item => item.product.id === product.id);
 
-    if (existingItem) {
-      this.cartItems.update(items =>
-        items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
-        )
-      );
-    } else {
+    if (existingItem) {} else {
       this.cartItems.update(items => [...items, { product, quantity }]);
     }
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] ArrowFunction
app/features/cart/cart.service.ts:19:29
     const existingItem = current.find(item => item.product.id === product.id);
 
     if (existingItem) {
-      this.cartItems.update(items =>
-        items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
-        )
+      this.cartItems.update(() => undefined
       );
     } else {
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
app/features/cart/cart.service.ts:20:19
 
     if (existingItem) {
       this.cartItems.update(items =>
-        items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
+        items.map(() => undefined
         )
       );
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: TypeError: Cannot read properties of undefined (reading 'quantity')

[Killed] EqualityOperator
app/features/cart/cart.service.ts:21:11
     if (existingItem) {
       this.cartItems.update(items =>
         items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
+          item.product.id !== product.id ? { ...item, quantity: item.quantity + quantity } : item
         )
       );
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:21:11
     if (existingItem) {
       this.cartItems.update(items =>
         items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
+          false ? { ...item, quantity: item.quantity + quantity } : item
         )
       );
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] BlockStatement
app/features/cart/cart.service.ts:24:12
           item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
         )
       );
-    } else {
-      this.cartItems.update(items => [...items, { product, quantity }]);
-    }
+    } else {}
   }
 
killedBy: CartService addToCart should add a new product to the cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
app/features/cart/cart.service.ts:25:29
         )
       );
     } else {
-      this.cartItems.update(items => [...items, { product, quantity }]);
+      this.cartItems.update(() => undefined);
     }
   }
killedBy: CartService addToCart should add a new product to the cart
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/features/cart/cart.service.ts:29:37
     }
   }
 
-  removeFromCart(productId: number) {
-    this.cartItems.update(items => items.filter(item => item.product.id !== productId));
-  }
+  removeFromCart(productId: number) {}
 
   updateQuantity(productId: number, quantity: number) {
killedBy: CartService removeFromCart should remove a product from the cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:30:57
   }
 
   removeFromCart(productId: number) {
-    this.cartItems.update(items => items.filter(item => item.product.id !== productId));
+    this.cartItems.update(items => items.filter(item => false));
   }
 
killedBy: CartService removeFromCart should not affect other products
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:30:57
   }
 
   removeFromCart(productId: number) {
-    this.cartItems.update(items => items.filter(item => item.product.id !== productId));
+    this.cartItems.update(items => items.filter(item => true));
   }
 
killedBy: CartService removeFromCart should remove a product from the cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
app/features/cart/cart.service.ts:33:55
     this.cartItems.update(items => items.filter(item => item.product.id !== productId));
   }
 
-  updateQuantity(productId: number, quantity: number) {
-    if (quantity <= 0) {
-      this.removeFromCart(productId);
-      return;
-    }
-
-    this.cartItems.update(items =>
-      items.map(item => (item.product.id === productId ? { ...item, quantity } : item))
-    );
-  }
+  updateQuantity(productId: number, quantity: number) {}
 
   clearCart() {
killedBy: CartService updateQuantity should update the quantity of a product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] EqualityOperator
app/features/cart/cart.service.ts:34:9
   }
 
   updateQuantity(productId: number, quantity: number) {
-    if (quantity <= 0) {
+    if (quantity < 0) {
       this.removeFromCart(productId);
       return;
killedBy: CartService updateQuantity should remove the product when quantity is set to 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
app/features/cart/cart.service.ts:34:9
   }
 
   updateQuantity(productId: number, quantity: number) {
-    if (quantity <= 0) {
+    if (quantity > 0) {
       this.removeFromCart(productId);
       return;
killedBy: CartService updateQuantity should update the quantity of a product
statusReason: TypeError: Cannot read properties of undefined (reading 'quantity')

[Killed] ArrowFunction
app/features/cart/cart.service.ts:39:27
       return;
     }
 
-    this.cartItems.update(items =>
-      items.map(item => (item.product.id === productId ? { ...item, quantity } : item))
+    this.cartItems.update(() => undefined
     );
   }
killedBy: CartService updateQuantity should update the quantity of a product
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:40:26
     }
 
     this.cartItems.update(items =>
-      items.map(item => (item.product.id === productId ? { ...item, quantity } : item))
+      items.map(item => (false ? { ...item, quantity } : item))
     );
   }
killedBy: CartService updateQuantity should update the quantity of a product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] ArrowFunction
app/features/cart/cart.service.ts:40:17
     }
 
     this.cartItems.update(items =>
-      items.map(item => (item.product.id === productId ? { ...item, quantity } : item))
+      items.map(() => undefined)
     );
   }
killedBy: CartService updateQuantity should update the quantity of a product
statusReason: TypeError: Cannot read properties of undefined (reading 'quantity')

[Killed] BlockStatement
app/features/cart/cart.service.ts:44:15
     );
   }
 
-  clearCart() {
-    this.cartItems.set([]);
-  }
+  clearCart() {}
 
   getSubtotal(): number {
killedBy: CartService clearCart should remove all items from the cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
app/features/cart/cart.service.ts:48:25
     this.cartItems.set([]);
   }
 
-  getSubtotal(): number {
-    return this.cartItems().reduce((sum, item) => sum + item.product.price * item.quantity, 0);
-  }
+  getSubtotal(): number {}
 }
 
killedBy: CartService getSubtotal should return 0 for an empty cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArrowFunction
app/features/cart/cart.service.ts:49:36
   }
 
   getSubtotal(): number {
-    return this.cartItems().reduce((sum, item) => sum + item.product.price * item.quantity, 0);
+    return this.cartItems().reduce(() => undefined, 0);
   }
 }
killedBy: CartService getSubtotal should calculate the subtotal correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: undefined

[Killed] ArithmeticOperator
app/features/cart/cart.service.ts:49:57
   }
 
   getSubtotal(): number {
-    return this.cartItems().reduce((sum, item) => sum + item.product.price * item.quantity, 0);
+    return this.cartItems().reduce((sum, item) => sum + item.product.price / item.quantity, 0);
   }
 }
killedBy: CartService getSubtotal should calculate the subtotal correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 25
