[Killed] ArrayDeclaration
cart/components/cart-page/cart-page.ts:21:27
   changeDetection: ChangeDetectionStrategy.OnPush,
 })
 export class CartPage implements OnInit, OnDestroy {
-  cartItems: CartItem[] = [];
+  cartItems: CartItem[] = ["Stryker was here"];
   subtotal = 0;
   shipping = 5.99;
killedBy: CartPage should create
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] BlockStatement
cart/components/cart-page/cart-page.ts:28:20
 
   private router = inject(Router);
 
-  ngOnInit(): void {
-    this.loadCart();
-  }
+  ngOnInit(): void {}
 
   ngOnDestroy(): void {

[Survived] BlockStatement
cart/components/cart-page/cart-page.ts:32:23
     this.loadCart();
   }
 
-  ngOnDestroy(): void {
-    this.saveCart();
-  }
+  ngOnDestroy(): void {}
 
   loadCart(): void {

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:36:20
     this.saveCart();
   }
 
-  loadCart(): void {
-    const cartData = localStorage.getItem('shoppingCart');
-    if (cartData) {
-      this.cartItems = JSON.parse(cartData);
-      this.calculateTotals();
-    }
-  }
+  loadCart(): void {}
 
   saveCart(): void {
killedBy: CartPage should load cart from localStorage
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
cart/components/cart-page/cart-page.ts:38:9
 
   loadCart(): void {
     const cartData = localStorage.getItem('shoppingCart');
-    if (cartData) {
+    if (true) {
       this.cartItems = JSON.parse(cartData);
       this.calculateTotals();
killedBy: CartPage should create
statusReason: TypeError: Cannot read properties of null (reading 'reduce')

[Killed] ConditionalExpression
cart/components/cart-page/cart-page.ts:38:9
 
   loadCart(): void {
     const cartData = localStorage.getItem('shoppingCart');
-    if (cartData) {
+    if (false) {
       this.cartItems = JSON.parse(cartData);
       this.calculateTotals();
killedBy: CartPage should load cart from localStorage
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:44:20
     }
   }
 
-  saveCart(): void {
-    localStorage.setItem('shoppingCart', JSON.stringify(this.cartItems));
-    this.calculateTotals();
-  }
+  saveCart(): void {}
 
   updateQuantity(item: CartItem, newQuantity: number): void {
killedBy: CartPage should not checkout when cart is empty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "Checkout functionality would be implemented here!"

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:49:61
     this.calculateTotals();
   }
 
-  updateQuantity(item: CartItem, newQuantity: number): void {
-    if (newQuantity <= 0) {
-      this.removeItem(item);
-      return;
-    }
-
-    item.quantity = newQuantity;
-    this.saveCart();
-  }
+  updateQuantity(item: CartItem, newQuantity: number): void {}
 
   removeItem(item: CartItem): void {
killedBy: CartPage should update quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:50:27
   }
 
   updateQuantity(item: CartItem, newQuantity: number): void {
-    if (newQuantity <= 0) {
-      this.removeItem(item);
-      return;
-    }
+    if (newQuantity <= 0) {}
 
     item.quantity = newQuantity;
killedBy: CartPage should remove item when quantity is 0 or less
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"product": {"category": "Test Category", "description": "Test Description", "id": 1, "image": "https://example.com/image.jpg", "price": 100, "rating": {"count": 100, "rate": 4.5}, "title": "Test Product"}, "quantity": 0}]

[Killed] ConditionalExpression
cart/components/cart-page/cart-page.ts:50:9
   }
 
   updateQuantity(item: CartItem, newQuantity: number): void {
-    if (newQuantity <= 0) {
+    if (true) {
       this.removeItem(item);
       return;
killedBy: CartPage should update quantity
statusReason: TypeError: Cannot read properties of undefined (reading 'quantity')

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:59:36
     this.saveCart();
   }
 
-  removeItem(item: CartItem): void {
-    this.cartItems = this.cartItems.filter(cartItem => cartItem !== item);
-    this.saveCart();
-  }
+  removeItem(item: CartItem): void {}
 
   calculateTotals(): void {
killedBy: CartPage should remove item when quantity is 0 or less
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"product": {"category": "Test Category", "description": "Test Description", "id": 1, "image": "https://example.com/image.jpg", "price": 100, "rating": {"count": 100, "rate": 4.5}, "title": "Test Product"}, "quantity": 1}]

[Killed] EqualityOperator
cart/components/cart-page/cart-page.ts:60:56
   }
 
   removeItem(item: CartItem): void {
-    this.cartItems = this.cartItems.filter(cartItem => cartItem !== item);
+    this.cartItems = this.cartItems.filter(cartItem => cartItem === item);
     this.saveCart();
   }
killedBy: CartPage should remove item when quantity is 0 or less
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"product": {"category": "Test Category", "description": "Test Description", "id": 1, "image": "https://example.com/image.jpg", "price": 100, "rating": {"count": 100, "rate": 4.5}, "title": "Test Product"}, "quantity": 1}]

[Killed] MethodExpression
cart/components/cart-page/cart-page.ts:60:22
   }
 
   removeItem(item: CartItem): void {
-    this.cartItems = this.cartItems.filter(cartItem => cartItem !== item);
+    this.cartItems = this.cartItems;
     this.saveCart();
   }
killedBy: CartPage should remove item when quantity is 0 or less
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"product": {"category": "Test Category", "description": "Test Description", "id": 1, "image": "https://example.com/image.jpg", "price": 100, "rating": {"count": 100, "rate": 4.5}, "title": "Test Product"}, "quantity": 1}]

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:64:27
     this.saveCart();
   }
 
-  calculateTotals(): void {
-    this.subtotal = this.cartItems.reduce(
-      (sum, item) => sum + item.product.price * item.quantity,
-      0
-    );
-    this.total = this.subtotal + this.shipping;
-  }
+  calculateTotals(): void {}
 
   checkout(): void {
killedBy: CartPage should calculate totals correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 0

[Killed] ArrowFunction
cart/components/cart-page/cart-page.ts:66:7
 
   calculateTotals(): void {
     this.subtotal = this.cartItems.reduce(
-      (sum, item) => sum + item.product.price * item.quantity,
+      () => undefined,
       0
     );
killedBy: CartPage should calculate totals correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: undefined

[Killed] ArithmeticOperator
cart/components/cart-page/cart-page.ts:66:28
 
   calculateTotals(): void {
     this.subtotal = this.cartItems.reduce(
-      (sum, item) => sum + item.product.price * item.quantity,
+      (sum, item) => sum + item.product.price / item.quantity,
       0
     );
killedBy: CartPage should calculate totals correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 100

[Killed] ArithmeticOperator
cart/components/cart-page/cart-page.ts:69:18
       (sum, item) => sum + item.product.price * item.quantity,
       0
     );
-    this.total = this.subtotal + this.shipping;
+    this.total = this.subtotal - this.shipping;
   }
 
killedBy: CartPage should calculate totals correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 255.99
Received: 244.01

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:72:20
     this.total = this.subtotal + this.shipping;
   }
 
-  checkout(): void {
-    if (this.cartItems.length === 0) {
-      return;
-    }
-
-    // In a real application, this would navigate to a checkout page
-    // For now, we'll just show an alert
-    alert('Checkout functionality would be implemented here!');
-    this.cartItems = [];
-    this.saveCart();
-    this.router.navigate(['/products']);
-  }
+  checkout(): void {}
 }
 
killedBy: CartPage should checkout with cart items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Checkout functionality would be implemented here!"

Number of calls: 0

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:73:38
   }
 
   checkout(): void {
-    if (this.cartItems.length === 0) {
-      return;
-    }
+    if (this.cartItems.length === 0) {}
 
     // In a real application, this would navigate to a checkout page
killedBy: CartPage should not checkout when cart is empty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "Checkout functionality would be implemented here!"

[Killed] ConditionalExpression
cart/components/cart-page/cart-page.ts:73:9
   }
 
   checkout(): void {
-    if (this.cartItems.length === 0) {
+    if (true) {
       return;
     }
killedBy: CartPage should checkout with cart items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Checkout functionality would be implemented here!"

Number of calls: 0
