[Killed] ArrayDeclaration
customers/components/customer-dialog/customer-dialog.ts:31:46
   data = inject<{ mode: DialogMode; customer?: Customer }>(MAT_DIALOG_DATA);
   dialogMode = DialogMode;
 
-  private _subs: { unsubscribe(): void }[] = [];
+  private _subs: { unsubscribe(): void }[] = ["Stryker was here"];
   private pendingService = inject(PendingChangesService);
 
killedBy: CustomerDialog should create
statusReason: Error: 1 component threw errors during cleanup

[Killed] OptionalChaining
customers/components/customer-dialog/customer-dialog.ts:34:31
   private _subs: { unsubscribe(): void }[] = [];
   private pendingService = inject(PendingChangesService);
 
-  firstName = new FormControl(this.data.customer?.firstName ?? '', {
+  firstName = new FormControl(this.data.customer.firstName ?? '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: CustomerDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'firstName')

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:34:31
   private _subs: { unsubscribe(): void }[] = [];
   private pendingService = inject(PendingChangesService);
 
-  firstName = new FormControl(this.data.customer?.firstName ?? '', {
+  firstName = new FormControl(this.data.customer?.firstName && '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: CustomerDialog should initialize firstName with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Survived] BooleanLiteral
customers/components/customer-dialog/customer-dialog.ts:35:18
   private pendingService = inject(PendingChangesService);
 
   firstName = new FormControl(this.data.customer?.firstName ?? '', {
-    nonNullable: true,
+    nonNullable: false,
     validators: Validators.required,
   });

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:39:30
     validators: Validators.required,
   });
 
-  lastName = new FormControl(this.data.customer?.lastName ?? '', {
+  lastName = new FormControl(this.data.customer?.lastName && '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: CustomerDialog should initialize lastName with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Killed] OptionalChaining
customers/components/customer-dialog/customer-dialog.ts:39:30
     validators: Validators.required,
   });
 
-  lastName = new FormControl(this.data.customer?.lastName ?? '', {
+  lastName = new FormControl(this.data.customer.lastName ?? '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: CustomerDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'lastName')

[Survived] BooleanLiteral
customers/components/customer-dialog/customer-dialog.ts:40:18
   });
 
   lastName = new FormControl(this.data.customer?.lastName ?? '', {
-    nonNullable: true,
+    nonNullable: false,
     validators: Validators.required,
   });

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:44:27
     validators: Validators.required,
   });
 
-  email = new FormControl(this.data.customer?.email ?? '', {
+  email = new FormControl(this.data.customer?.email && '', {
     nonNullable: true,
     validators: [Validators.required, Validators.email],
killedBy: CustomerDialog should initialize email with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Killed] OptionalChaining
customers/components/customer-dialog/customer-dialog.ts:44:27
     validators: Validators.required,
   });
 
-  email = new FormControl(this.data.customer?.email ?? '', {
+  email = new FormControl(this.data.customer.email ?? '', {
     nonNullable: true,
     validators: [Validators.required, Validators.email],
killedBy: CustomerDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Survived] BooleanLiteral
customers/components/customer-dialog/customer-dialog.ts:45:18
   });
 
   email = new FormControl(this.data.customer?.email ?? '', {
-    nonNullable: true,
+    nonNullable: false,
     validators: [Validators.required, Validators.email],
   });

[Killed] OptionalChaining
customers/components/customer-dialog/customer-dialog.ts:49:33
     validators: [Validators.required, Validators.email],
   });
 
-  phoneNumber = new FormControl(this.data.customer?.phoneNumber ?? '', {
+  phoneNumber = new FormControl(this.data.customer.phoneNumber ?? '', {
     nonNullable: true,
   });
killedBy: CustomerDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'phoneNumber')

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:49:33
     validators: [Validators.required, Validators.email],
   });
 
-  phoneNumber = new FormControl(this.data.customer?.phoneNumber ?? '', {
+  phoneNumber = new FormControl(this.data.customer?.phoneNumber && '', {
     nonNullable: true,
   });
killedBy: CustomerDialog should initialize phoneNumber with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Survived] BooleanLiteral
customers/components/customer-dialog/customer-dialog.ts:50:18
   });
 
   phoneNumber = new FormControl(this.data.customer?.phoneNumber ?? '', {
-    nonNullable: true,
+    nonNullable: false,
   });
 

[Killed] ConditionalExpression
customers/components/customer-dialog/customer-dialog.ts:54:62
   });
 
   isActive = new FormControl(
-    { value: this.data.customer?.isActive ?? true, disabled: this.data.mode === DialogMode.View },
+    { value: this.data.customer?.isActive ?? true, disabled: true },
     {
       nonNullable: true,
killedBy: CustomerDialog Edit Mode should not disable controls in Edit mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:54:14
   });
 
   isActive = new FormControl(
-    { value: this.data.customer?.isActive ?? true, disabled: this.data.mode === DialogMode.View },
+    { value: this.data.customer?.isActive && true, disabled: this.data.mode === DialogMode.View },
     {
       nonNullable: true,
killedBy: CustomerDialog should initialize isActive with true in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Survived] BooleanLiteral
customers/components/customer-dialog/customer-dialog.ts:56:20
   isActive = new FormControl(
     { value: this.data.customer?.isActive ?? true, disabled: this.data.mode === DialogMode.View },
     {
-      nonNullable: true,
+      nonNullable: false,
     }
   );

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:60:14
     }
   );
 
-  ngOnInit() {
-    if (this.data.mode === DialogMode.View) {
-      this.firstName.disable();
-      this.lastName.disable();
-      this.email.disable();
-      this.isActive.disable();
-      this.phoneNumber.disable();
-    }
-    // dynamic disableClose: prevent closing when the user made changes
-    // initially allow close (unless in view mode where fields are disabled)
-    this.dialogRef.disableClose = false;
-
-    const markDisable = () => {
-      const anyDirty =
-        this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
-      this.dialogRef.disableClose = anyDirty;
-      this.pendingService.setPending(anyDirty);
-    };
-
-    // subscribe to value changes to update disableClose and pending state
-    this._subs.push(this.firstName.valueChanges.subscribe(markDisable));
-    this._subs.push(this.lastName.valueChanges.subscribe(markDisable));
-    this._subs.push(this.email.valueChanges.subscribe(markDisable));
-    this._subs.push(this.isActive.valueChanges.subscribe(markDisable));
-  }
+  ngOnInit() {}
 
   isValid(): boolean {
killedBy: CustomerDialog should set disableClose on field changes via valueChanges
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
customers/components/customer-dialog/customer-dialog.ts:61:9
   );
 
   ngOnInit() {
-    if (this.data.mode === DialogMode.View) {
+    if (false) {
       this.firstName.disable();
       this.lastName.disable();
killedBy: CustomerDialog View Mode should disable all controls in View mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
customers/components/customer-dialog/customer-dialog.ts:61:9
   );
 
   ngOnInit() {
-    if (this.data.mode === DialogMode.View) {
+    if (this.data.mode !== DialogMode.View) {
       this.firstName.disable();
       this.lastName.disable();
killedBy: CustomerDialog should be valid when all required fields are filled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
customers/components/customer-dialog/customer-dialog.ts:70:35
     }
     // dynamic disableClose: prevent closing when the user made changes
     // initially allow close (unless in view mode where fields are disabled)
-    this.dialogRef.disableClose = false;
+    this.dialogRef.disableClose = true;
 
     const markDisable = () => {

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:72:31
     // initially allow close (unless in view mode where fields are disabled)
     this.dialogRef.disableClose = false;
 
-    const markDisable = () => {
-      const anyDirty =
-        this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
-      this.dialogRef.disableClose = anyDirty;
-      this.pendingService.setPending(anyDirty);
-    };
+    const markDisable = () => {};
 
     // subscribe to value changes to update disableClose and pending state
killedBy: CustomerDialog should set disableClose on field changes via valueChanges
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:74:9
 
     const markDisable = () => {
       const anyDirty =
-        this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
+        (this.firstName.dirty || this.lastName.dirty || this.email.dirty) && this.isActive.dirty;
       this.dialogRef.disableClose = anyDirty;
       this.pendingService.setPending(anyDirty);
killedBy: CustomerDialog should set disableClose on field changes via valueChanges
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:74:9
 
     const markDisable = () => {
       const anyDirty =
-        this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
+        (this.firstName.dirty || this.lastName.dirty) && this.email.dirty || this.isActive.dirty;
       this.dialogRef.disableClose = anyDirty;
       this.pendingService.setPending(anyDirty);
killedBy: CustomerDialog should set disableClose on field changes via valueChanges
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:86:22
     this._subs.push(this.isActive.valueChanges.subscribe(markDisable));
   }
 
-  isValid(): boolean {
-    return this.firstName.valid && this.lastName.valid && this.email.valid;
-  }
+  isValid(): boolean {}
 
   save() {
killedBy: CustomerDialog should be valid when all required fields are filled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
customers/components/customer-dialog/customer-dialog.ts:87:12
   }
 
   isValid(): boolean {
-    return this.firstName.valid && this.lastName.valid && this.email.valid;
+    return false;
   }
 
killedBy: CustomerDialog should be valid when all required fields are filled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
customers/components/customer-dialog/customer-dialog.ts:87:12
   }
 
   isValid(): boolean {
-    return this.firstName.valid && this.lastName.valid && this.email.valid;
+    return true;
   }
 
killedBy: CustomerDialog should be invalid when firstName is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:90:10
     return this.firstName.valid && this.lastName.valid && this.email.valid;
   }
 
-  save() {
-    if (!this.isValid()) {
-      return;
-    }
-
-    this.dialogRef.close({
-      id: this.data.customer?.id ?? 0,
-      firstName: this.firstName.value,
-      lastName: this.lastName.value,
-      email: this.email.value,
-      isActive: this.isActive.value,
-      phoneNumber: this.phoneNumber.value,
-    });
-  }
+  save() {}
 
   cancel() {
killedBy: CustomerDialog should close dialog with customer data on save
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:91:26
   }
 
   save() {
-    if (!this.isValid()) {
-      return;
-    }
+    if (!this.isValid()) {}
 
     this.dialogRef.close({
killedBy: CustomerDialog should not close dialog on invalid save
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"email": "", "firstName": "", "id": 0, "isActive": true, "lastName": "", "phoneNumber": ""}

[Killed] ConditionalExpression
customers/components/customer-dialog/customer-dialog.ts:91:9
   }
 
   save() {
-    if (!this.isValid()) {
+    if (true) {
       return;
     }
killedBy: CustomerDialog should close dialog with customer data on save
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] OptionalChaining
customers/components/customer-dialog/customer-dialog.ts:96:11
     }
 
     this.dialogRef.close({
-      id: this.data.customer?.id ?? 0,
+      id: this.data.customer.id ?? 0,
       firstName: this.firstName.value,
       lastName: this.lastName.value,
killedBy: CustomerDialog should close dialog with customer data on save
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:96:11
     }
 
     this.dialogRef.close({
-      id: this.data.customer?.id ?? 0,
+      id: this.data.customer?.id && 0,
       firstName: this.firstName.value,
       lastName: this.lastName.value,
killedBy: CustomerDialog should save customer with correct data structure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "email": "jane@test.com",
    "firstName": "Jane",

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:105:12
     });
   }
 
-  cancel() {
-    this.dialogRef.close();
-  }
+  cancel() {}
 
   ngOnDestroy(): void {
killedBy: CustomerDialog should close dialog on cancel
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:109:23
     this.dialogRef.close();
   }
 
-  ngOnDestroy(): void {
-    this._subs.forEach(s => s.unsubscribe());
-    this.pendingService.clear();
-  }
+  ngOnDestroy(): void {}
 
   // Expose unsaved state for navigation guards
killedBy: CustomerDialog should call pendingService.clear on destroy
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ArrowFunction
customers/components/customer-dialog/customer-dialog.ts:110:24
   }
 
   ngOnDestroy(): void {
-    this._subs.forEach(s => s.unsubscribe());
+    this._subs.forEach(() => undefined);
     this.pendingService.clear();
   }

[Killed] BlockStatement
customers/components/customer-dialog/customer-dialog.ts:115:32
   }
 
   // Expose unsaved state for navigation guards
-  hasUnsavedChanges(): boolean {
-    return this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
-  }
+  hasUnsavedChanges(): boolean {}
 }
 
killedBy: CustomerDialog should check for unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] LogicalOperator
customers/components/customer-dialog/customer-dialog.ts:116:12
 
   // Expose unsaved state for navigation guards
   hasUnsavedChanges(): boolean {
-    return this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
+    return this.firstName.dirty && this.lastName.dirty || this.email.dirty || this.isActive.dirty;
   }
 }
killedBy: CustomerDialog should check for unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
customers/components/customer-dialog/customer-dialog.ts:116:12
 
   // Expose unsaved state for navigation guards
   hasUnsavedChanges(): boolean {
-    return this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
+    return true;
   }
 }
killedBy: CustomerDialog should check for unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
