[Killed] ArrayDeclaration
customers/components/customers-table/customers-table.ts:71:13
   private router = inject(Router);
   private pendingService = inject(PendingChangesService);
 
-  columns = [
-    { key: 'id', label: 'Id' },
-    { key: 'firstName', label: 'First Name' },
-    { key: 'lastName', label: 'Last Name' },
-    { key: 'email', label: 'Email' },
-    { key: 'phoneNumber', label: 'Phone Number' },
-    { key: 'isActive', label: 'Active' },
-  ];
+  columns = [];
   displayedColumns = ['select', ...this.columns.map(c => c.key)];
   selection = new SelectionModel<Customer>(true, []);
killedBy: CustomersTable should have columns defined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] StringLiteral
customers/components/customers-table/customers-table.ts:72:12
   private pendingService = inject(PendingChangesService);
 
   columns = [
-    { key: 'id', label: 'Id' },
+    { key: "", label: 'Id' },
     { key: 'firstName', label: 'First Name' },
     { key: 'lastName', label: 'Last Name' },
killedBy: CustomersTable should create
statusReason: Error: Could not find column with id "".

[Killed] ObjectLiteral
customers/components/customers-table/customers-table.ts:72:5
   private pendingService = inject(PendingChangesService);
 
   columns = [
-    { key: 'id', label: 'Id' },
+    {},
     { key: 'firstName', label: 'First Name' },
     { key: 'lastName', label: 'Last Name' },
killedBy: CustomersTable should create
statusReason: TypeError: columnDef._columnCssClassName is not iterable (cannot read property undefined)

[Survived] StringLiteral
customers/components/customers-table/customers-table.ts:73:32
 
   columns = [
     { key: 'id', label: 'Id' },
-    { key: 'firstName', label: 'First Name' },
+    { key: 'firstName', label: "" },
     { key: 'lastName', label: 'Last Name' },
     { key: 'email', label: 'Email' },

[Killed] ObjectLiteral
customers/components/customers-table/customers-table.ts:74:5
   columns = [
     { key: 'id', label: 'Id' },
     { key: 'firstName', label: 'First Name' },
-    { key: 'lastName', label: 'Last Name' },
+    {},
     { key: 'email', label: 'Email' },
     { key: 'phoneNumber', label: 'Phone Number' },
killedBy: CustomersTable should create
statusReason: TypeError: columnDef._columnCssClassName is not iterable (cannot read property undefined)

[Killed] StringLiteral
customers/components/customers-table/customers-table.ts:76:12
     { key: 'firstName', label: 'First Name' },
     { key: 'lastName', label: 'Last Name' },
     { key: 'email', label: 'Email' },
-    { key: 'phoneNumber', label: 'Phone Number' },
+    { key: "", label: 'Phone Number' },
     { key: 'isActive', label: 'Active' },
   ];
killedBy: CustomersTable should create
statusReason: Error: Could not find column with id "".

[Killed] StringLiteral
customers/components/customers-table/customers-table.ts:77:12
     { key: 'lastName', label: 'Last Name' },
     { key: 'email', label: 'Email' },
     { key: 'phoneNumber', label: 'Phone Number' },
-    { key: 'isActive', label: 'Active' },
+    { key: "", label: 'Active' },
   ];
   displayedColumns = ['select', ...this.columns.map(c => c.key)];
killedBy: CustomersTable should create
statusReason: Error: Could not find column with id "".

[Killed] ArrowFunction
customers/components/customers-table/customers-table.ts:79:53
     { key: 'phoneNumber', label: 'Phone Number' },
     { key: 'isActive', label: 'Active' },
   ];
-  displayedColumns = ['select', ...this.columns.map(c => c.key)];
+  displayedColumns = ['select', ...this.columns.map(() => undefined)];
   selection = new SelectionModel<Customer>(true, []);
   dataSource = new MatTableDataSource<Customer>();
killedBy: CustomersTable should create
statusReason: Error: Could not find column with id "undefined".

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:80:44
     { key: 'isActive', label: 'Active' },
   ];
   displayedColumns = ['select', ...this.columns.map(c => c.key)];
-  selection = new SelectionModel<Customer>(true, []);
+  selection = new SelectionModel<Customer>(false, []);
   dataSource = new MatTableDataSource<Customer>();
   filterValue = '';
killedBy: CustomersTable should not edit when multiple customers selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["/customers", 2, "edit"]

[Killed] ArrayDeclaration
customers/components/customers-table/customers-table.ts:80:50
     { key: 'isActive', label: 'Active' },
   ];
   displayedColumns = ['select', ...this.columns.map(c => c.key)];
-  selection = new SelectionModel<Customer>(true, []);
+  selection = new SelectionModel<Customer>(true, ["Stryker was here"]);
   dataSource = new MatTableDataSource<Customer>();
   filterValue = '';
killedBy: CustomersTable should return true when all rows are selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] StringLiteral
customers/components/customers-table/customers-table.ts:96:31
   readonly errorEffect = effect(() => {
     const msg = this.error();
     if (msg) {
-      this.snackBar.open(msg, 'Close', { duration: 4000 });
+      this.snackBar.open(msg, "", { duration: 4000 });
     }
   });

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:100:39
     }
   });
 
-  readonly tableEffect = effect(() => {
-    this.dataSource.data = this.customers();
-    this.applyFilter(this.filterValue);
-    this.changeDetectorRef.markForCheck();
-  });
+  readonly tableEffect = effect(() => {});
 
   readonly routeEffect = effect(() => {
killedBy: CustomersTable should update dataSource.data when customers signal changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "email": "john@example.com",

[Survived] ConditionalExpression
customers/components/customers-table/customers-table.ts:110:9
     const rs = this.routeState();
     const customers = this.customers();
 
-    if (this.dialogOpen()) return;
+    if (true) return;
 
     const { id, isNew, isEdit } = rs;

[Survived] ConditionalExpression
customers/components/customers-table/customers-table.ts:110:9
     const rs = this.routeState();
     const customers = this.customers();
 
-    if (this.dialogOpen()) return;
+    if (false) return;
 
     const { id, isNew, isEdit } = rs;

[Survived] ConditionalExpression
customers/components/customers-table/customers-table.ts:114:9
 
     const { id, isNew, isEdit } = rs;
 
-    if (!customers.length) return;
+    if (false) return;
 
     if (isNew) {

[Survived] ConditionalExpression
customers/components/customers-table/customers-table.ts:114:9
 
     const { id, isNew, isEdit } = rs;
 
-    if (!customers.length) return;
+    if (true) return;
 
     if (isNew) {

[Killed] ConditionalExpression
customers/components/customers-table/customers-table.ts:116:9
 
     if (!customers.length) return;
 
-    if (isNew) {
+    if (true) {
       this.dialogOpen.set(true);
       const ref = this.openAddDialog();
killedBy: CustomersTable should update dataSource.data when customers signal changes
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Survived] ConditionalExpression
customers/components/customers-table/customers-table.ts:116:9
 
     if (!customers.length) return;
 
-    if (isNew) {
+    if (false) {
       this.dialogOpen.set(true);
       const ref = this.openAddDialog();

[NoCoverage] BooleanLiteral
customers/components/customers-table/customers-table.ts:117:27
     if (!customers.length) return;
 
     if (isNew) {
-      this.dialogOpen.set(true);
+      this.dialogOpen.set(false);
       const ref = this.openAddDialog();
       ref.afterClosed().subscribe(result => {

[NoCoverage] BlockStatement
customers/components/customers-table/customers-table.ts:119:45
     if (isNew) {
       this.dialogOpen.set(true);
       const ref = this.openAddDialog();
-      ref.afterClosed().subscribe(result => {
-        this.dialogOpen.set(false);
-        this.pendingService.clear();
-        this.pendingService.clearActiveDialog();
-        this.router.navigate(['/customers']);
-        if (result) this.customerService.addCustomer(result);
-      });
+      ref.afterClosed().subscribe(result => {});
       return;
     }

[NoCoverage] BooleanLiteral
customers/components/customers-table/customers-table.ts:120:29
       this.dialogOpen.set(true);
       const ref = this.openAddDialog();
       ref.afterClosed().subscribe(result => {
-        this.dialogOpen.set(false);
+        this.dialogOpen.set(true);
         this.pendingService.clear();
         this.pendingService.clearActiveDialog();

[NoCoverage] StringLiteral
customers/components/customers-table/customers-table.ts:123:31
         this.dialogOpen.set(false);
         this.pendingService.clear();
         this.pendingService.clearActiveDialog();
-        this.router.navigate(['/customers']);
+        this.router.navigate([""]);
         if (result) this.customerService.addCustomer(result);
       });

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:124:13
         this.pendingService.clear();
         this.pendingService.clearActiveDialog();
         this.router.navigate(['/customers']);
-        if (result) this.customerService.addCustomer(result);
+        if (false) this.customerService.addCustomer(result);
       });
       return;

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:124:13
         this.pendingService.clear();
         this.pendingService.clearActiveDialog();
         this.router.navigate(['/customers']);
-        if (result) this.customerService.addCustomer(result);
+        if (true) this.customerService.addCustomer(result);
       });
       return;

[Survived] ConditionalExpression
customers/components/customers-table/customers-table.ts:129:9
       return;
     }
 
-    if (!id) return;
+    if (true) return;
 
     const customer = customers.find(c => c.id === +id);

[Survived] BooleanLiteral
customers/components/customers-table/customers-table.ts:129:9
       return;
     }
 
-    if (!id) return;
+    if (id) return;
 
     const customer = customers.find(c => c.id === +id);

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:131:42
 
     if (!id) return;
 
-    const customer = customers.find(c => c.id === +id);
+    const customer = customers.find(c => true);
     if (!customer) return;
 

[NoCoverage] ArrowFunction
customers/components/customers-table/customers-table.ts:131:37
 
     if (!id) return;
 
-    const customer = customers.find(c => c.id === +id);
+    const customer = customers.find(() => undefined);
     if (!customer) return;
 

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:132:9
     if (!id) return;
 
     const customer = customers.find(c => c.id === +id);
-    if (!customer) return;
+    if (true) return;
 
     this.dialogOpen.set(true);

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:132:9
     if (!id) return;
 
     const customer = customers.find(c => c.id === +id);
-    if (!customer) return;
+    if (false) return;
 
     this.dialogOpen.set(true);

[NoCoverage] BooleanLiteral
customers/components/customers-table/customers-table.ts:134:25
     const customer = customers.find(c => c.id === +id);
     if (!customer) return;
 
-    this.dialogOpen.set(true);
+    this.dialogOpen.set(false);
     const ref = isEdit ? this.openEditDialog(customer) : this.openViewDialog(customer);
     ref.afterClosed().subscribe(result => {

[NoCoverage] BlockStatement
customers/components/customers-table/customers-table.ts:136:43
 
     this.dialogOpen.set(true);
     const ref = isEdit ? this.openEditDialog(customer) : this.openViewDialog(customer);
-    ref.afterClosed().subscribe(result => {
-      this.dialogOpen.set(false);
-      this.pendingService.clear();
-      this.pendingService.clearActiveDialog();
-      this.router.navigate(['/customers']);
-      if (isEdit && result) this.customerService.updateCustomer(result);
-    });
+    ref.afterClosed().subscribe(result => {});
   });
 

[NoCoverage] LogicalOperator
customers/components/customers-table/customers-table.ts:141:11
       this.pendingService.clear();
       this.pendingService.clearActiveDialog();
       this.router.navigate(['/customers']);
-      if (isEdit && result) this.customerService.updateCustomer(result);
+      if (isEdit || result) this.customerService.updateCustomer(result);
     });
   });

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:141:11
       this.pendingService.clear();
       this.pendingService.clearActiveDialog();
       this.router.navigate(['/customers']);
-      if (isEdit && result) this.customerService.updateCustomer(result);
+      if (false) this.customerService.updateCustomer(result);
     });
   });

[Survived] ArrowFunction
customers/components/customers-table/customers-table.ts:147:14
 
   routeState = toSignal(
     this.router.events.pipe(
-      filter(e => e instanceof NavigationEnd),
+      filter(() => undefined),
       startWith(null),
       map(() => this.getDeepestRouteState())

[Killed] ArrowFunction
customers/components/customers-table/customers-table.ts:149:11
     this.router.events.pipe(
       filter(e => e instanceof NavigationEnd),
       startWith(null),
-      map(() => this.getDeepestRouteState())
+      map(() => undefined)
     ),
     { initialValue: { id: this.route.snapshot.paramMap.get('id'), isNew: false, isEdit: false } }
killedBy: CustomersTable should create
statusReason: TypeError: Cannot destructure property 'id' of 'rs' as it is undefined.

[Survived] BooleanLiteral
customers/components/customers-table/customers-table.ts:151:74
       startWith(null),
       map(() => this.getDeepestRouteState())
     ),
-    { initialValue: { id: this.route.snapshot.paramMap.get('id'), isNew: false, isEdit: false } }
+    { initialValue: { id: this.route.snapshot.paramMap.get('id'), isNew: true, isEdit: false } }
   );
 

[Survived] BooleanLiteral
customers/components/customers-table/customers-table.ts:151:89
       startWith(null),
       map(() => this.getDeepestRouteState())
     ),
-    { initialValue: { id: this.route.snapshot.paramMap.get('id'), isNew: false, isEdit: false } }
+    { initialValue: { id: this.route.snapshot.paramMap.get('id'), isNew: false, isEdit: true } }
   );
 

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:154:34
     { initialValue: { id: this.route.snapshot.paramMap.get('id'), isNew: false, isEdit: false } }
   );
 
-  private getDeepestRouteState() {
-    let snapshot = this.router.routerState.snapshot.root;
-    while (snapshot.firstChild) {
-      snapshot = snapshot.firstChild;
-    }
-
-    const id = snapshot.paramMap.get('id');
-    const isNew = snapshot.url.some(s => s.path === 'new');
-    const isEdit = snapshot.url.some(s => s.path === 'edit');
-    return { id, isNew, isEdit };
-  }
+  private getDeepestRouteState() {}
 
   ngOnInit() {
killedBy: CustomersTable should create
statusReason: TypeError: Cannot destructure property 'id' of 'rs' as it is undefined.

[NoCoverage] BlockStatement
customers/components/customers-table/customers-table.ts:156:33
 
   private getDeepestRouteState() {
     let snapshot = this.router.routerState.snapshot.root;
-    while (snapshot.firstChild) {
-      snapshot = snapshot.firstChild;
-    }
+    while (snapshot.firstChild) {}
 
     const id = snapshot.paramMap.get('id');

[Survived] ConditionalExpression
customers/components/customers-table/customers-table.ts:156:12
 
   private getDeepestRouteState() {
     let snapshot = this.router.routerState.snapshot.root;
-    while (snapshot.firstChild) {
+    while (false) {
       snapshot = snapshot.firstChild;
     }

[Killed] MethodExpression
customers/components/customers-table/customers-table.ts:161:19
     }
 
     const id = snapshot.paramMap.get('id');
-    const isNew = snapshot.url.some(s => s.path === 'new');
+    const isNew = snapshot.url.every(s => s.path === 'new');
     const isEdit = snapshot.url.some(s => s.path === 'edit');
     return { id, isNew, isEdit };
killedBy: CustomersTable should update dataSource.data when customers signal changes
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:161:42
     }
 
     const id = snapshot.paramMap.get('id');
-    const isNew = snapshot.url.some(s => s.path === 'new');
+    const isNew = snapshot.url.some(s => true);
     const isEdit = snapshot.url.some(s => s.path === 'edit');
     return { id, isNew, isEdit };

[NoCoverage] ConditionalExpression
customers/components/customers-table/customers-table.ts:162:43
 
     const id = snapshot.paramMap.get('id');
     const isNew = snapshot.url.some(s => s.path === 'new');
-    const isEdit = snapshot.url.some(s => s.path === 'edit');
+    const isEdit = snapshot.url.some(s => false);
     return { id, isNew, isEdit };
   }

[Survived] MethodExpression
customers/components/customers-table/customers-table.ts:162:20
 
     const id = snapshot.paramMap.get('id');
     const isNew = snapshot.url.some(s => s.path === 'new');
-    const isEdit = snapshot.url.some(s => s.path === 'edit');
+    const isEdit = snapshot.url.every(s => s.path === 'edit');
     return { id, isNew, isEdit };
   }

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:166:14
     return { id, isNew, isEdit };
   }
 
-  ngOnInit() {
-    this.customerService.loadCustomers();
-  }
+  ngOnInit() {}
 
   ngAfterViewInit() {
killedBy: CustomersTable should load customers on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:187:31
   }
 
   toggleAllRows() {
-    if (this.isAllSelected()) {
-      this.selection.clear();
-    } else {
+    if (this.isAllSelected()) {} else {
       this.dataSource.data.forEach(row => this.selection.select(row));
     }
killedBy: CustomersTable should toggle all rows - deselect all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:194:38
     }
   }
 
-  openViewDialog(customer: Customer) {
-    const ref = this.dialog.open(CustomerDialog, {
-      panelClass: ['customer-dialog', 'mode-view'],
-      data: { mode: DialogMode.View, customer },
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<CustomerDialog>;
-    this.pendingService.setActiveDialog(this.activeDialogRef);
-    ref.afterClosed().subscribe(() => {
-      this.activeDialogRef = null;
-      this.pendingService.clearActiveDialog();
-      this.pendingService.clear();
-    });
-    return ref as MatDialogRef<CustomerDialog>;
-  }
+  openViewDialog(customer: Customer) {}
 
   openEditDialog(customer: Customer) {
killedBy: CustomersTable should call openViewDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ArrayDeclaration
customers/components/customers-table/customers-table.ts:196:19
 
   openViewDialog(customer: Customer) {
     const ref = this.dialog.open(CustomerDialog, {
-      panelClass: ['customer-dialog', 'mode-view'],
+      panelClass: [],
       data: { mode: DialogMode.View, customer },
       closeOnNavigation: false,
killedBy: CustomersTable should call openViewDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Received: [Function CustomerDialog], {"closeOnNavigation": false, "data": {"customer": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}, "mode": "view"}, "panelClass": []}

Number of calls: 1

[Killed] ObjectLiteral
customers/components/customers-table/customers-table.ts:197:13
   openViewDialog(customer: Customer) {
     const ref = this.dialog.open(CustomerDialog, {
       panelClass: ['customer-dialog', 'mode-view'],
-      data: { mode: DialogMode.View, customer },
+      data: {},
       closeOnNavigation: false,
     });
killedBy: CustomersTable should call openViewDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Received: [Function CustomerDialog], {"closeOnNavigation": false, "data": {}, "panelClass": ["customer-dialog", "mode-view"]}

Number of calls: 1

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:198:26
     const ref = this.dialog.open(CustomerDialog, {
       panelClass: ['customer-dialog', 'mode-view'],
       data: { mode: DialogMode.View, customer },
-      closeOnNavigation: false,
+      closeOnNavigation: true,
     });
 
killedBy: CustomersTable should call openViewDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Received: [Function CustomerDialog], {"closeOnNavigation": true, "data": {"customer": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}, "mode": "view"}, "panelClass": ["customer-dialog", "mode-view"]}

Number of calls: 1

[Survived] BlockStatement
customers/components/customers-table/customers-table.ts:203:39
 
     this.activeDialogRef = ref as MatDialogRef<CustomerDialog>;
     this.pendingService.setActiveDialog(this.activeDialogRef);
-    ref.afterClosed().subscribe(() => {
-      this.activeDialogRef = null;
-      this.pendingService.clearActiveDialog();
-      this.pendingService.clear();
-    });
+    ref.afterClosed().subscribe(() => {});
     return ref as MatDialogRef<CustomerDialog>;
   }

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:211:38
     return ref as MatDialogRef<CustomerDialog>;
   }
 
-  openEditDialog(customer: Customer) {
-    const ref = this.dialog.open(CustomerDialog, {
-      data: { mode: DialogMode.Edit, customer },
-      panelClass: 'customer-dialog',
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<CustomerDialog>;
-    this.pendingService.setActiveDialog(this.activeDialogRef);
-    ref.afterClosed().subscribe(() => {
-      this.activeDialogRef = null;
-      this.pendingService.clearActiveDialog();
-      this.pendingService.clear();
-    });
-    return ref as MatDialogRef<CustomerDialog>;
-  }
+  openEditDialog(customer: Customer) {}
 
   openAddDialog() {
killedBy: CustomersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function CustomerDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"customer": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}, "mode": "edit"}, "panelClass": "customer-dialog"}

Number of calls: 0

[Killed] ObjectLiteral
customers/components/customers-table/customers-table.ts:212:50
   }
 
   openEditDialog(customer: Customer) {
-    const ref = this.dialog.open(CustomerDialog, {
-      data: { mode: DialogMode.Edit, customer },
-      panelClass: 'customer-dialog',
-      closeOnNavigation: false,
-    });
+    const ref = this.dialog.open(CustomerDialog, {});
 
     this.activeDialogRef = ref as MatDialogRef<CustomerDialog>;
killedBy: CustomersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function CustomerDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"customer": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}, "mode": "edit"}, "panelClass": "customer-dialog"}
Received: [Function CustomerDialog], {}

[Killed] StringLiteral
customers/components/customers-table/customers-table.ts:214:19
   openEditDialog(customer: Customer) {
     const ref = this.dialog.open(CustomerDialog, {
       data: { mode: DialogMode.Edit, customer },
-      panelClass: 'customer-dialog',
+      panelClass: "",
       closeOnNavigation: false,
     });
killedBy: CustomersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function CustomerDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"customer": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}, "mode": "edit"}, "panelClass": "customer-dialog"}
Received: [Function CustomerDialog], {"c

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:215:26
     const ref = this.dialog.open(CustomerDialog, {
       data: { mode: DialogMode.Edit, customer },
       panelClass: 'customer-dialog',
-      closeOnNavigation: false,
+      closeOnNavigation: true,
     });
 
killedBy: CustomersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function CustomerDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"customer": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}, "mode": "edit"}, "panelClass": "customer-dialog"}
Received: [Function CustomerDialog], {"c

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:228:19
     return ref as MatDialogRef<CustomerDialog>;
   }
 
-  openAddDialog() {
-    const ref = this.dialog.open(CustomerDialog, {
-      data: { mode: DialogMode.Add },
-      panelClass: 'customer-dialog',
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<CustomerDialog>;
-    this.pendingService.setActiveDialog(this.activeDialogRef);
-    ref.afterClosed().subscribe(() => {
-      this.activeDialogRef = null;
-      this.pendingService.clearActiveDialog();
-      this.pendingService.clear();
-    });
-    return ref as MatDialogRef<CustomerDialog>;
-  }
+  openAddDialog() {}
 
   // Called by router CanDeactivate guard
killedBy: CustomersTable should call openAddDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function CustomerDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "add"}, "panelClass": "customer-dialog"}

Number of calls: 0

[Killed] ObjectLiteral
customers/components/customers-table/customers-table.ts:230:13
 
   openAddDialog() {
     const ref = this.dialog.open(CustomerDialog, {
-      data: { mode: DialogMode.Add },
+      data: {},
       panelClass: 'customer-dialog',
       closeOnNavigation: false,
killedBy: CustomersTable should call openAddDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function CustomerDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "add"}, "panelClass": "customer-dialog"}
Received: [Function CustomerDialog], {"closeOnNavigation": false, "data": {}, "panelClass": "customer-dialog"}

Number of calls: 1

[Killed] StringLiteral
customers/components/customers-table/customers-table.ts:231:19
   openAddDialog() {
     const ref = this.dialog.open(CustomerDialog, {
       data: { mode: DialogMode.Add },
-      panelClass: 'customer-dialog',
+      panelClass: "",
       closeOnNavigation: false,
     });
killedBy: CustomersTable should call openAddDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function CustomerDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "add"}, "panelClass": "customer-dialog"}
Received: [Function CustomerDialog], {"closeOnNavigation": false, "data": {"mode": "add"}, "panelClass": ""}

Number of calls: 1

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:247:39
 
   // Called by router CanDeactivate guard
   canDeactivate(): boolean {
-    if (!this.activeDialogRef) return true;
+    if (!this.activeDialogRef) return false;
     const inst = this.activeDialogRef.componentInstance as {
       hasUnsavedChanges?: () => boolean;
killedBy: CustomersTable should return true from canDeactivate when no active dialog
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:247:9
 
   // Called by router CanDeactivate guard
   canDeactivate(): boolean {
-    if (!this.activeDialogRef) return true;
+    if (this.activeDialogRef) return true;
     const inst = this.activeDialogRef.componentInstance as {
       hasUnsavedChanges?: () => boolean;
killedBy: CustomersTable should return true from canDeactivate when no active dialog
statusReason: TypeError: Cannot read properties of null (reading 'componentInstance')
