[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:255:9
       email?: { dirty?: boolean };
       isActive?: { dirty?: boolean };
     };
-    if (!inst) return true;
+    if (inst) return true;
     let unsaved = false;
     if (typeof inst.hasUnsavedChanges === 'function') {
killedBy: CustomersTable should return false from canDeactivate when has unsaved changes and user cancels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
customers/components/customers-table/customers-table.ts:255:9
       email?: { dirty?: boolean };
       isActive?: { dirty?: boolean };
     };
-    if (!inst) return true;
+    if (true) return true;
     let unsaved = false;
     if (typeof inst.hasUnsavedChanges === 'function') {
killedBy: CustomersTable should return false from canDeactivate when has unsaved changes and user cancels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
customers/components/customers-table/customers-table.ts:256:19
       isActive?: { dirty?: boolean };
     };
     if (!inst) return true;
-    let unsaved = false;
+    let unsaved = true;
     if (typeof inst.hasUnsavedChanges === 'function') {
       unsaved = inst.hasUnsavedChanges();

[Killed] ConditionalExpression
customers/components/customers-table/customers-table.ts:257:9
     };
     if (!inst) return true;
     let unsaved = false;
-    if (typeof inst.hasUnsavedChanges === 'function') {
+    if (false) {
       unsaved = inst.hasUnsavedChanges();
     } else {
killedBy: CustomersTable should return false from canDeactivate when has unsaved changes and user cancels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
customers/components/customers-table/customers-table.ts:257:9
     };
     if (!inst) return true;
     let unsaved = false;
-    if (typeof inst.hasUnsavedChanges === 'function') {
+    if (typeof inst.hasUnsavedChanges !== 'function') {
       unsaved = inst.hasUnsavedChanges();
     } else {
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: TypeError: inst.hasUnsavedChanges is not a function

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:259:12
     let unsaved = false;
     if (typeof inst.hasUnsavedChanges === 'function') {
       unsaved = inst.hasUnsavedChanges();
-    } else {
-      unsaved = !!(
-        inst.firstName?.dirty ||
-        inst.lastName?.dirty ||
-        inst.email?.dirty ||
-        inst.isActive?.dirty
-      );
-    }
+    } else {}
     if (!unsaved) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
killedBy: CustomersTable should fallback to checking individual field dirty state when hasUnsavedChanges not available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:260:18
     if (typeof inst.hasUnsavedChanges === 'function') {
       unsaved = inst.hasUnsavedChanges();
     } else {
-      unsaved = !!(
-        inst.firstName?.dirty ||
-        inst.lastName?.dirty ||
-        inst.email?.dirty ||
-        inst.isActive?.dirty
-      );
+      unsaved = !inst.firstName?.dirty || inst.lastName?.dirty || inst.email?.dirty || inst.isActive?.dirty;
     }
     if (!unsaved) return true;
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:260:17
     if (typeof inst.hasUnsavedChanges === 'function') {
       unsaved = inst.hasUnsavedChanges();
     } else {
-      unsaved = !!(
-        inst.firstName?.dirty ||
-        inst.lastName?.dirty ||
-        inst.email?.dirty ||
-        inst.isActive?.dirty
-      );
+      unsaved = !(inst.firstName?.dirty || inst.lastName?.dirty || inst.email?.dirty || inst.isActive?.dirty);
     }
     if (!unsaved) return true;
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
customers/components/customers-table/customers-table.ts:261:9
       unsaved = inst.hasUnsavedChanges();
     } else {
       unsaved = !!(
-        inst.firstName?.dirty ||
-        inst.lastName?.dirty ||
-        inst.email?.dirty ||
-        inst.isActive?.dirty
+        (inst.firstName?.dirty || inst.lastName?.dirty || inst.email?.dirty) && inst.isActive?.dirty
       );
     }
killedBy: CustomersTable should fallback to checking individual field dirty state when hasUnsavedChanges not available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] OptionalChaining
customers/components/customers-table/customers-table.ts:261:9
       unsaved = inst.hasUnsavedChanges();
     } else {
       unsaved = !!(
-        inst.firstName?.dirty ||
+        inst.firstName.dirty ||
         inst.lastName?.dirty ||
         inst.email?.dirty ||
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: TypeError: Cannot read properties of undefined (reading 'dirty')

[Killed] OptionalChaining
customers/components/customers-table/customers-table.ts:262:9
     } else {
       unsaved = !!(
         inst.firstName?.dirty ||
-        inst.lastName?.dirty ||
+        inst.lastName.dirty ||
         inst.email?.dirty ||
         inst.isActive?.dirty
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: TypeError: Cannot read properties of undefined (reading 'dirty')

[Killed] OptionalChaining
customers/components/customers-table/customers-table.ts:263:9
       unsaved = !!(
         inst.firstName?.dirty ||
         inst.lastName?.dirty ||
-        inst.email?.dirty ||
+        inst.email.dirty ||
         inst.isActive?.dirty
       );
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: TypeError: Cannot read properties of undefined (reading 'dirty')

[Killed] OptionalChaining
customers/components/customers-table/customers-table.ts:264:9
         inst.firstName?.dirty ||
         inst.lastName?.dirty ||
         inst.email?.dirty ||
-        inst.isActive?.dirty
+        inst.isActive.dirty
       );
     }
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: TypeError: Cannot read properties of undefined (reading 'dirty')

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:267:9
         inst.isActive?.dirty
       );
     }
-    if (!unsaved) return true;
+    if (unsaved) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
     if (confirmLeave) {
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
customers/components/customers-table/customers-table.ts:267:26
         inst.isActive?.dirty
       );
     }
-    if (!unsaved) return true;
+    if (!unsaved) return false;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
     if (confirmLeave) {
killedBy: CustomersTable should return true from canDeactivate when no unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:269:23
     }
     if (!unsaved) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
-    if (confirmLeave) {
-      // close the dialog so it doesn't persist after navigation
-      try {
-        this.activeDialogRef.close();
-      } catch {
-        /* ignore */
-      }
-    }
+    if (confirmLeave) {}
     return confirmLeave;
   }
killedBy: CustomersTable should close dialog when user confirms leave with unsaved changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
customers/components/customers-table/customers-table.ts:269:9
     }
     if (!unsaved) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
-    if (confirmLeave) {
+    if (false) {
       // close the dialog so it doesn't persist after navigation
       try {
killedBy: CustomersTable should close dialog when user confirms leave with unsaved changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:271:11
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
     if (confirmLeave) {
       // close the dialog so it doesn't persist after navigation
-      try {
-        this.activeDialogRef.close();
-      } catch {
+      try {} catch {
         /* ignore */
       }
killedBy: CustomersTable should close dialog when user confirms leave with unsaved changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:280:36
     return confirmLeave;
   }
 
-  viewCustomer(customer: Customer) {
-    this.router.navigate(['/customers', customer.id]);
-  }
+  viewCustomer(customer: Customer) {}
 
   addCustomer() {
killedBy: CustomersTable should open view dialog via router
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/customers", 1]

Number of calls: 0

[Killed] ArrayDeclaration
customers/components/customers-table/customers-table.ts:281:26
   }
 
   viewCustomer(customer: Customer) {
-    this.router.navigate(['/customers', customer.id]);
+    this.router.navigate([]);
   }
 
killedBy: CustomersTable should open view dialog via router
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/customers",
-   1,

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:284:17
     this.router.navigate(['/customers', customer.id]);
   }
 
-  addCustomer() {
-    this.router.navigate(['/customers/new']);
-  }
+  addCustomer() {}
 
   editCustomer() {
killedBy: CustomersTable should navigate to add customer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/customers/new"]

Number of calls: 0

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:288:18
     this.router.navigate(['/customers/new']);
   }
 
-  editCustomer() {
-    if (this.selection.selected.length !== 1) return;
-    this.router.navigate(['/customers', this.selection.selected[0].id, 'edit']);
-  }
+  editCustomer() {}
 
   deleteCustomers() {
killedBy: CustomersTable should edit selected customer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/customers", 1, "edit"]

Number of calls: 0

[Killed] ConditionalExpression
customers/components/customers-table/customers-table.ts:289:9
   }
 
   editCustomer() {
-    if (this.selection.selected.length !== 1) return;
+    if (false) return;
     this.router.navigate(['/customers', this.selection.selected[0].id, 'edit']);
   }
killedBy: CustomersTable should not edit when no customer selected
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
customers/components/customers-table/customers-table.ts:289:9
   }
 
   editCustomer() {
-    if (this.selection.selected.length !== 1) return;
+    if (this.selection.selected.length === 1) return;
     this.router.navigate(['/customers', this.selection.selected[0].id, 'edit']);
   }
killedBy: CustomersTable should edit selected customer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/customers", 1, "edit"]

Number of calls: 0

[Killed] StringLiteral
customers/components/customers-table/customers-table.ts:290:27
 
   editCustomer() {
     if (this.selection.selected.length !== 1) return;
-    this.router.navigate(['/customers', this.selection.selected[0].id, 'edit']);
+    this.router.navigate(["", this.selection.selected[0].id, 'edit']);
   }
 
killedBy: CustomersTable should edit selected customer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/customers",
+   "",

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:293:21
     this.router.navigate(['/customers', this.selection.selected[0].id, 'edit']);
   }
 
-  deleteCustomers() {
-    const dialogData: ConfirmationDialogData = {
-      title: 'Delete customers',
-      message: 'Do you really want to delete these customers?',
-      confirmText: 'Delete',
-      cancelText: 'Cancel',
-    };
-
-    const dialogRef = this.dialog.open(ConfirmationDialog, {
-      data: dialogData,
-    });
-
-    dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
-
-      this.customerService.deleteCustomers(this.selection.selected.map(r => r.id));
-
-      this.selection.clear();
-      this.changeDetectorRef.markForCheck();
-    });
-  }
+  deleteCustomers() {}
 }
 
killedBy: CustomersTable should call deleteCustomers and show confirmation dialog
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
customers/components/customers-table/customers-table.ts:305:63
       data: dialogData,
     });
 
-    dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
-
-      this.customerService.deleteCustomers(this.selection.selected.map(r => r.id));
-
-      this.selection.clear();
-      this.changeDetectorRef.markForCheck();
-    });
+    dialogRef.afterClosed().subscribe((confirmed: boolean) => {});
   }
 }
killedBy: CustomersTable should delete customers when user confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [1, 2]

Number of calls: 0

[Killed] ConditionalExpression
customers/components/customers-table/customers-table.ts:306:11
     });
 
     dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
+      if (false) return;
 
       this.customerService.deleteCustomers(this.selection.selected.map(r => r.id));
killedBy: CustomersTable should not delete customers when user cancels
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1]

[Killed] ArrowFunction
customers/components/customers-table/customers-table.ts:308:72
     dialogRef.afterClosed().subscribe((confirmed: boolean) => {
       if (!confirmed) return;
 
-      this.customerService.deleteCustomers(this.selection.selected.map(r => r.id));
+      this.customerService.deleteCustomers(this.selection.selected.map(() => undefined));
 
       this.selection.clear();
killedBy: CustomersTable should delete customers when user confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   1,
-   2,
