[Killed] BooleanLiteral
app/features/customers/customer.service.ts:13:20
 export class CustomerService {
   private customersUrl = 'api/customers';
   customers = signal<Customer[]>([]);
-  loading = signal(false);
+  loading = signal(true);
   error = signal<string | null>(null);
   private readonly http = inject(HttpClient);
killedBy: CustomerService should initialize with loading false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
app/features/customers/customer.service.ts:19:9
 
   loadCustomers() {
     // Skip API call if customers are already loaded
-    if (this.customers().length > 0) {
+    if (this.customers().length <= 0) {
       return;
     }
killedBy: CustomerService should load customers from API
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/features/customers/customer.service.ts:19:38
 
   loadCustomers() {
     // Skip API call if customers are already loaded
-    if (this.customers().length > 0) {
-      return;
-    }
+    if (this.customers().length > 0) {}
 
     this.loading.set(true);
killedBy: CustomerService should not reload customers if already loaded
statusReason: Error: Expected zero matching requests for criteria "Match URL: api/customers", found 1.

[Killed] BooleanLiteral
app/features/customers/customer.service.ts:23:22
       return;
     }
 
-    this.loading.set(true);
+    this.loading.set(false);
     this.error.set(null);
 
killedBy: CustomerService should load customers from API
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/features/customers/customer.service.ts:29:26
     this.http
       .get<Customer[]>(this.customersUrl)
       .pipe(
-        tap(customers => {
-          customers.forEach(c => {
-            if (typeof c.isActive === 'string') {
-              c.isActive = c.isActive === 'true';
-            }
-          });
-          this.customers.set(customers);
-        }),
+        tap(customers => {}),
         catchError(() => {
           this.error.set('Failed to load customers');
killedBy: CustomerService should load customers from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "email": "john.doe@example.com",

[Killed] BlockStatement
app/features/customers/customer.service.ts:30:34
       .get<Customer[]>(this.customersUrl)
       .pipe(
         tap(customers => {
-          customers.forEach(c => {
-            if (typeof c.isActive === 'string') {
-              c.isActive = c.isActive === 'true';
-            }
-          });
+          customers.forEach(c => {});
           this.customers.set(customers);
         }),
killedBy: CustomerService should convert string isActive to boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] EqualityOperator
app/features/customers/customer.service.ts:31:17
       .pipe(
         tap(customers => {
           customers.forEach(c => {
-            if (typeof c.isActive === 'string') {
+            if (typeof c.isActive !== 'string') {
               c.isActive = c.isActive === 'true';
             }
killedBy: CustomerService should convert string isActive to boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] BlockStatement
app/features/customers/customer.service.ts:31:49
       .pipe(
         tap(customers => {
           customers.forEach(c => {
-            if (typeof c.isActive === 'string') {
-              c.isActive = c.isActive === 'true';
-            }
+            if (typeof c.isActive === 'string') {}
           });
           this.customers.set(customers);
killedBy: CustomerService should convert string isActive to boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] EqualityOperator
app/features/customers/customer.service.ts:32:28
         tap(customers => {
           customers.forEach(c => {
             if (typeof c.isActive === 'string') {
-              c.isActive = c.isActive === 'true';
+              c.isActive = c.isActive !== 'true';
             }
           });
killedBy: CustomerService should convert string isActive to boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
app/features/customers/customer.service.ts:32:28
         tap(customers => {
           customers.forEach(c => {
             if (typeof c.isActive === 'string') {
-              c.isActive = c.isActive === 'true';
+              c.isActive = true;
             }
           });
killedBy: CustomerService should convert string isActive "false" to boolean false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/features/customers/customer.service.ts:37:26
           });
           this.customers.set(customers);
         }),
-        catchError(() => {
-          this.error.set('Failed to load customers');
-          this.loading.set(false);
-          return of([]);
-        })
+        catchError(() => {})
       )
       .subscribe({
killedBy: CustomerService should handle load customers error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
app/features/customers/customer.service.ts:39:28
         }),
         catchError(() => {
           this.error.set('Failed to load customers');
-          this.loading.set(false);
+          this.loading.set(true);
           return of([]);
         })

[Killed] BlockStatement
app/features/customers/customer.service.ts:48:35
       });
   }
 
-  addCustomer(customer: Customer) {
-    this.http
-      .post<Customer>(this.customersUrl, customer)
-      .pipe(
-        tap(newCustomer => {
-          const current = this.customers();
-          this.customers.set([...current, newCustomer]);
-        }),
-        catchError(() => {
-          this.error.set('Failed to add customer');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  addCustomer(customer: Customer) {}
 
   updateCustomer(customer: Customer) {
killedBy: CustomerService should add a customer
statusReason: Error: Expected one matching request for criteria "Match URL: api/customers", found none.

[Killed] BlockStatement
app/features/customers/customer.service.ts:52:28
     this.http
       .post<Customer>(this.customersUrl, customer)
       .pipe(
-        tap(newCustomer => {
-          const current = this.customers();
-          this.customers.set([...current, newCustomer]);
-        }),
+        tap(newCustomer => {}),
         catchError(() => {
           this.error.set('Failed to add customer');
killedBy: CustomerService should add a customer
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: {"email": "john.doe@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}
Received array: []

[Killed] ArrayDeclaration
app/features/customers/customer.service.ts:54:30
       .pipe(
         tap(newCustomer => {
           const current = this.customers();
-          this.customers.set([...current, newCustomer]);
+          this.customers.set([]);
         }),
         catchError(() => {
killedBy: CustomerService should add a customer
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: {"email": "john.doe@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}
Received array: []

[Killed] BlockStatement
app/features/customers/customer.service.ts:56:26
           const current = this.customers();
           this.customers.set([...current, newCustomer]);
         }),
-        catchError(() => {
-          this.error.set('Failed to add customer');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: CustomerService should handle add customer error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to add customer"
Received: null

[Killed] StringLiteral
app/features/customers/customer.service.ts:57:26
           this.customers.set([...current, newCustomer]);
         }),
         catchError(() => {
-          this.error.set('Failed to add customer');
+          this.error.set("");
           return EMPTY;
         })
killedBy: CustomerService should handle add customer error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to add customer"
Received: ""

[Killed] BlockStatement
app/features/customers/customer.service.ts:64:38
       .subscribe();
   }
 
-  updateCustomer(customer: Customer) {
-    this.http
-      .put<Customer>(`${this.customersUrl}/${customer.id}`, customer)
-      .pipe(
-        tap(() => {
-          const current = this.customers();
-          const index = current.findIndex(c => c.id === customer.id);
-          if (index !== -1) {
-            const updated = [...current];
-            updated[index] = customer;
-            this.customers.set(updated);
-          }
-        }),
-        catchError(() => {
-          this.error.set('Failed to update customer');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  updateCustomer(customer: Customer) {}
 
   deleteCustomers(ids: number[]) {
killedBy: CustomerService should update a customer
statusReason: Error: Expected one matching request for criteria "Match URL: api/customers/1", found none.

[Killed] BlockStatement
app/features/customers/customer.service.ts:68:19
     this.http
       .put<Customer>(`${this.customersUrl}/${customer.id}`, customer)
       .pipe(
-        tap(() => {
-          const current = this.customers();
-          const index = current.findIndex(c => c.id === customer.id);
-          if (index !== -1) {
-            const updated = [...current];
-            updated[index] = customer;
-            this.customers.set(updated);
-          }
-        }),
+        tap(() => {}),
         catchError(() => {
           this.error.set('Failed to update customer');
killedBy: CustomerService should update a customer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Jane"
Received: "John"

[Killed] EqualityOperator
app/features/customers/customer.service.ts:70:48
       .pipe(
         tap(() => {
           const current = this.customers();
-          const index = current.findIndex(c => c.id === customer.id);
+          const index = current.findIndex(c => c.id !== customer.id);
           if (index !== -1) {
             const updated = [...current];
killedBy: CustomerService should update a customer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Jane"
Received: "John"

[Killed] ConditionalExpression
app/features/customers/customer.service.ts:70:48
       .pipe(
         tap(() => {
           const current = this.customers();
-          const index = current.findIndex(c => c.id === customer.id);
+          const index = current.findIndex(c => true);
           if (index !== -1) {
             const updated = [...current];
killedBy: CustomerService should not update customers array when customer not found during update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
      "email": "john.doe@example.com",

[Killed] ConditionalExpression
app/features/customers/customer.service.ts:71:15
         tap(() => {
           const current = this.customers();
           const index = current.findIndex(c => c.id === customer.id);
-          if (index !== -1) {
+          if (false) {
             const updated = [...current];
             updated[index] = customer;
killedBy: CustomerService should update a customer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Jane"
Received: "John"

[Killed] ConditionalExpression
app/features/customers/customer.service.ts:71:15
         tap(() => {
           const current = this.customers();
           const index = current.findIndex(c => c.id === customer.id);
-          if (index !== -1) {
+          if (true) {
             const updated = [...current];
             updated[index] = customer;
killedBy: CustomerService should not update customers array when customer not found during update
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "john.doe@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}]
Received: serializes to the same string

[Killed] BlockStatement
app/features/customers/customer.service.ts:77:26
             this.customers.set(updated);
           }
         }),
-        catchError(() => {
-          this.error.set('Failed to update customer');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: CustomerService should handle update customer error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to update customer"
Received: null

[Killed] BlockStatement
app/features/customers/customer.service.ts:85:34
       .subscribe();
   }
 
-  deleteCustomers(ids: number[]) {
-    this.http
-      .delete(this.customersUrl, { body: ids })
-      .pipe(
-        tap(() => {
-          const current = this.customers();
-          this.customers.set(current.filter(c => !ids.includes(c.id)));
-        }),
-        catchError(() => {
-          this.error.set('Failed to delete customers');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  deleteCustomers(ids: number[]) {}
 }
 
killedBy: CustomerService should delete customers
statusReason: Error: Expected one matching request for criteria "Match URL: api/customers", found none.

[Killed] BlockStatement
app/features/customers/customer.service.ts:89:19
     this.http
       .delete(this.customersUrl, { body: ids })
       .pipe(
-        tap(() => {
-          const current = this.customers();
-          this.customers.set(current.filter(c => !ids.includes(c.id)));
-        }),
+        tap(() => {}),
         catchError(() => {
           this.error.set('Failed to delete customers');
killedBy: CustomerService should delete customers
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not {"email": "john.doe@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}
Received array:     [{"email": "john.doe@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}, {"email": "john.doe@example.com",

[Killed] ArrowFunction
app/features/customers/customer.service.ts:91:45
       .pipe(
         tap(() => {
           const current = this.customers();
-          this.customers.set(current.filter(c => !ids.includes(c.id)));
+          this.customers.set(current.filter(() => undefined));
         }),
         catchError(() => {
killedBy: CustomerService should filter customers by ids when deleting
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "email": "john.doe@example.com",

[Killed] BooleanLiteral
app/features/customers/customer.service.ts:91:50
       .pipe(
         tap(() => {
           const current = this.customers();
-          this.customers.set(current.filter(c => !ids.includes(c.id)));
+          this.customers.set(current.filter(c => ids.includes(c.id)));
         }),
         catchError(() => {
killedBy: CustomerService should delete customers
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not {"email": "john.doe@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}
Received array:     [{"email": "john.doe@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}]

[Killed] BlockStatement
app/features/customers/customer.service.ts:93:26
           const current = this.customers();
           this.customers.set(current.filter(c => !ids.includes(c.id)));
         }),
-        catchError(() => {
-          this.error.set('Failed to delete customers');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: CustomerService should handle delete customers error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to delete customers"
Received: null
