[Killed] BooleanLiteral
products/components/products-page/products-page.ts:21:20
   private productService = inject(ProductService);
 
   products = signal<Product[]>([]);
-  loading = signal(false);
+  loading = signal(true);
   error = signal<string | null>(null);
 
killedBy: ProductsPage should initialize loading as false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
products/components/products-page/products-page.ts:24:14
   loading = signal(false);
   error = signal<string | null>(null);
 
-  ngOnInit() {
-    this.loadProducts();
-  }
+  ngOnInit() {}
 
   loadProducts() {
killedBy: ProductsPage should load products on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
products/components/products-page/products-page.ts:28:18
     this.loadProducts();
   }
 
-  loadProducts() {
-    this.loading.set(true);
-    this.error.set(null);
-
-    this.productService.loadProducts().subscribe({
-      next: products => {
-        this.products.set(products);
-        this.loading.set(false);
-      },
-      error: () => {
-        this.error.set('Failed to load products');
-        this.loading.set(false);
-      },
-    });
-  }
+  loadProducts() {}
 
   trackByProductId(index: number, product: Product): number {
killedBy: ProductsPage should load products on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
products/components/products-page/products-page.ts:29:22
   }
 
   loadProducts() {
-    this.loading.set(true);
+    this.loading.set(false);
     this.error.set(null);
 
killedBy: ProductsPage should set loading to true when loading products
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
products/components/products-page/products-page.ts:33:25
     this.error.set(null);
 
     this.productService.loadProducts().subscribe({
-      next: products => {
-        this.products.set(products);
-        this.loading.set(false);
-      },
+      next: products => {},
       error: () => {
         this.error.set('Failed to load products');
killedBy: ProductsPage should set loading to true when loading products
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
products/components/products-page/products-page.ts:35:26
     this.productService.loadProducts().subscribe({
       next: products => {
         this.products.set(products);
-        this.loading.set(false);
+        this.loading.set(true);
       },
       error: () => {
killedBy: ProductsPage should set loading to true when loading products
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
products/components/products-page/products-page.ts:37:20
         this.products.set(products);
         this.loading.set(false);
       },
-      error: () => {
-        this.error.set('Failed to load products');
-        this.loading.set(false);
-      },
+      error: () => {},
     });
   }
killedBy: ProductsPage should set error message when load fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to load products"
Received: null

[Killed] StringLiteral
products/components/products-page/products-page.ts:38:24
         this.loading.set(false);
       },
       error: () => {
-        this.error.set('Failed to load products');
+        this.error.set("");
         this.loading.set(false);
       },
killedBy: ProductsPage should set error message when load fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to load products"
Received: ""

[Killed] BooleanLiteral
products/components/products-page/products-page.ts:39:26
       },
       error: () => {
         this.error.set('Failed to load products');
-        this.loading.set(false);
+        this.loading.set(true);
       },
     });
killedBy: ProductsPage should set loading to false when load fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
products/components/products-page/products-page.ts:44:61
     });
   }
 
-  trackByProductId(index: number, product: Product): number {
-    return product.id;
-  }
+  trackByProductId(index: number, product: Product): number {}
 
   addToCart(product: Product): void {
killedBy: ProductsPage should track product by id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
products/components/products-page/products-page.ts:59:11
     // Get existing cart items from localStorage
     const cartData = localStorage.getItem('shoppingCart');
     if (cartData) {
-      try {
-        cartItems = JSON.parse(cartData);
-      } catch {
+      try {} catch {
         // If JSON is invalid, start with empty cart
         cartItems = [];
killedBy: ProductsPage should increase quantity when adding existing product to cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Survived] BlockStatement
products/components/products-page/products-page.ts:61:15
     if (cartData) {
       try {
         cartItems = JSON.parse(cartData);
-      } catch {
-        // If JSON is invalid, start with empty cart
-        cartItems = [];
-      }
+      } catch {}
     }
 

[Killed] ArrowFunction
products/components/products-page/products-page.ts:68:51
     }
 
     // Check if product is already in cart
-    const existingItemIndex = cartItems.findIndex(item => item.product.id === product.id);
+    const existingItemIndex = cartItems.findIndex(() => undefined);
 
     if (existingItemIndex > -1) {
killedBy: ProductsPage should increase quantity when adding existing product to cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
products/components/products-page/products-page.ts:68:59
     }
 
     // Check if product is already in cart
-    const existingItemIndex = cartItems.findIndex(item => item.product.id === product.id);
+    const existingItemIndex = cartItems.findIndex(item => false);
 
     if (existingItemIndex > -1) {
killedBy: ProductsPage should increase quantity when adding existing product to cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
products/components/products-page/products-page.ts:70:33
     // Check if product is already in cart
     const existingItemIndex = cartItems.findIndex(item => item.product.id === product.id);
 
-    if (existingItemIndex > -1) {
-      // Increase quantity if product already exists
-      cartItems[existingItemIndex].quantity += 1;
-    } else {
+    if (existingItemIndex > -1) {} else {
       // Add new product to cart
       cartItems.push({
killedBy: ProductsPage should increase quantity when adding existing product to cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] UnaryOperator
products/components/products-page/products-page.ts:70:29
     // Check if product is already in cart
     const existingItemIndex = cartItems.findIndex(item => item.product.id === product.id);
 
-    if (existingItemIndex > -1) {
+    if (existingItemIndex > +1) {
       // Increase quantity if product already exists
       cartItems[existingItemIndex].quantity += 1;
killedBy: ProductsPage should increase quantity when adding existing product to cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] AssignmentOperator
products/components/products-page/products-page.ts:72:7
 
     if (existingItemIndex > -1) {
       // Increase quantity if product already exists
-      cartItems[existingItemIndex].quantity += 1;
+      cartItems[existingItemIndex].quantity -= 1;
     } else {
       // Add new product to cart
killedBy: ProductsPage should increase quantity when adding existing product to cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
products/components/products-page/products-page.ts:73:12
     if (existingItemIndex > -1) {
       // Increase quantity if product already exists
       cartItems[existingItemIndex].quantity += 1;
-    } else {
-      // Add new product to cart
-      cartItems.push({
-        product: product,
-        quantity: 1,
-      });
-    }
+    } else {}
 
     // Save updated cart to localStorage
killedBy: ProductsPage should add product to cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
