[Killed] StringLiteral
app/features/products/product.service.ts:10:25
   providedIn: 'root',
 })
 export class ProductService {
-  private productsUrl = 'api/products';
+  private productsUrl = "";
   private readonly http = inject(HttpClient);
 
killedBy: ProductService should load products from API
statusReason: Error: Expected one matching request for criteria "Match URL: api/products", found none. Requests received are: GET .

[Killed] BlockStatement
app/features/products/product.service.ts:13:41
   private productsUrl = 'api/products';
   private readonly http = inject(HttpClient);
 
-  loadProducts(): Observable<Product[]> {
-    return this.http.get<Product[]>(this.productsUrl);
-  }
+  loadProducts(): Observable<Product[]> {}
 }
 
killedBy: ProductService should load products from API
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
