[Killed] BlockStatement
shared/components/cart-icon/cart-icon.ts:18:20
 export class CartIcon implements OnInit, OnDestroy {
   cartItemCount = 0;
 
-  ngOnInit(): void {
-    this.loadCartCount();
-    // Listen for storage changes to update cart count
-    window.addEventListener('storage', this.loadCartCount.bind(this));
-  }
+  ngOnInit(): void {}
 
   ngOnDestroy(): void {
killedBy: CartIcon should add storage event listener on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "storage", Any<Function>

Number of calls: 0

[Killed] BlockStatement
shared/components/cart-icon/cart-icon.ts:24:23
     window.addEventListener('storage', this.loadCartCount.bind(this));
   }
 
-  ngOnDestroy(): void {
-    window.removeEventListener('storage', this.loadCartCount.bind(this));
-  }
+  ngOnDestroy(): void {}
 
   loadCartCount(): void {
killedBy: CartIcon should remove storage event listener on destroy
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "storage", Any<Function>

Number of calls: 0

[Killed] StringLiteral
shared/components/cart-icon/cart-icon.ts:25:32
   }
 
   ngOnDestroy(): void {
-    window.removeEventListener('storage', this.loadCartCount.bind(this));
+    window.removeEventListener("", this.loadCartCount.bind(this));
   }
 
killedBy: CartIcon should remove storage event listener on destroy
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "storage", Any<Function>
Received: "", [Function bound loadCartCount]

Number of calls: 1

[Killed] BlockStatement
shared/components/cart-icon/cart-icon.ts:28:25
     window.removeEventListener('storage', this.loadCartCount.bind(this));
   }
 
-  loadCartCount(): void {
-    try {
-      const cartData = localStorage.getItem('shoppingCart');
-      if (cartData) {
-        const cartItems = JSON.parse(cartData);
-        this.cartItemCount = cartItems.reduce(
-          (total: number, item: { quantity: number }) => total + item.quantity,
-          0
-        );
-      } else {
-        this.cartItemCount = 0;
-      }
-    } catch {
-      this.cartItemCount = 0;
-    }
-  }
+  loadCartCount(): void {}
 }
 
killedBy: CartIcon should load cart count from localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
shared/components/cart-icon/cart-icon.ts:29:9
   }
 
   loadCartCount(): void {
-    try {
-      const cartData = localStorage.getItem('shoppingCart');
-      if (cartData) {
-        const cartItems = JSON.parse(cartData);
-        this.cartItemCount = cartItems.reduce(
-          (total: number, item: { quantity: number }) => total + item.quantity,
-          0
-        );
-      } else {
-        this.cartItemCount = 0;
-      }
-    } catch {
+    try {} catch {
       this.cartItemCount = 0;
     }
killedBy: CartIcon should load cart count from localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
shared/components/cart-icon/cart-icon.ts:31:21
   loadCartCount(): void {
     try {
       const cartData = localStorage.getItem('shoppingCart');
-      if (cartData) {
-        const cartItems = JSON.parse(cartData);
-        this.cartItemCount = cartItems.reduce(
-          (total: number, item: { quantity: number }) => total + item.quantity,
-          0
-        );
-      } else {
+      if (cartData) {} else {
         this.cartItemCount = 0;
       }
killedBy: CartIcon should load cart count from localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
shared/components/cart-icon/cart-icon.ts:34:58
       if (cartData) {
         const cartItems = JSON.parse(cartData);
         this.cartItemCount = cartItems.reduce(
-          (total: number, item: { quantity: number }) => total + item.quantity,
+          (total: number, item: { quantity: number }) => total - item.quantity,
           0
         );
killedBy: CartIcon should load cart count from localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] ArrowFunction
shared/components/cart-icon/cart-icon.ts:34:11
       if (cartData) {
         const cartItems = JSON.parse(cartData);
         this.cartItemCount = cartItems.reduce(
-          (total: number, item: { quantity: number }) => total + item.quantity,
+          () => undefined,
           0
         );
killedBy: CartIcon should load cart count from localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Survived] BlockStatement
shared/components/cart-icon/cart-icon.ts:37:14
           (total: number, item: { quantity: number }) => total + item.quantity,
           0
         );
-      } else {
-        this.cartItemCount = 0;
-      }
+      } else {}
     } catch {
       this.cartItemCount = 0;

[Survived] BlockStatement
shared/components/cart-icon/cart-icon.ts:40:13
       } else {
         this.cartItemCount = 0;
       }
-    } catch {
-      this.cartItemCount = 0;
-    }
+    } catch {}
   }
 }
