[Killed] BlockStatement
shared/components/confirmation-dialog/confirmation-dialog.ts:24:13
   data: ConfirmationDialogData = inject(MAT_DIALOG_DATA);
   dialogRef = inject(MatDialogRef<ConfirmationDialog>);
 
-  confirm() {
-    this.dialogRef.close(true);
-  }
+  confirm() {}
 
   cancel() {
killedBy: ConfirmationDialog should close with true on confirm
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true

Number of calls: 0

[Killed] BooleanLiteral
shared/components/confirmation-dialog/confirmation-dialog.ts:25:26
   dialogRef = inject(MatDialogRef<ConfirmationDialog>);
 
   confirm() {
-    this.dialogRef.close(true);
+    this.dialogRef.close(false);
   }
 
killedBy: ConfirmationDialog should close with true on confirm
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true
Received: false

Number of calls: 1

[Killed] BlockStatement
shared/components/confirmation-dialog/confirmation-dialog.ts:28:12
     this.dialogRef.close(true);
   }
 
-  cancel() {
-    this.dialogRef.close(false);
-  }
+  cancel() {}
 }
 
killedBy: ConfirmationDialog should close with false on cancel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: false

Number of calls: 0

[Killed] BooleanLiteral
shared/components/confirmation-dialog/confirmation-dialog.ts:29:26
   }
 
   cancel() {
-    this.dialogRef.close(false);
+    this.dialogRef.close(true);
   }
 }
killedBy: ConfirmationDialog should close with false on cancel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: false
Received: true

Number of calls: 1
