[Killed] BlockStatement
shared/components/theme-selector/theme-selector.ts:30:14
   themeColors = themeColors;
   themeModes = themeModes;
 
-  ngOnInit() {
-    this.themeService.loadTheme();
-  }
+  ngOnInit() {}
 }
 
killedBy: ThemeSelector should call themeService.loadTheme on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
