[Killed] ObjectLiteral
shared/pages/contact-page/contact-page.ts:23:31
   changeDetection: ChangeDetectionStrategy.OnPush,
 })
 export class ContactPage {
-  contactForm = new FormGroup({
-    name: new FormControl('', [Validators.required, Validators.minLength(2)]),
-    email: new FormControl('', [Validators.required, Validators.email]),
-    subject: new FormControl('', [Validators.required, Validators.minLength(5)]),
-    message: new FormControl('', [Validators.required, Validators.minLength(10)]),
-  });
+  contactForm = new FormGroup({});
 
   onSubmit() {
killedBy: ContactPage should create
statusReason: Error: Cannot find control with name: 'name'

[Killed] ArrayDeclaration
shared/pages/contact-page/contact-page.ts:24:31
 })
 export class ContactPage {
   contactForm = new FormGroup({
-    name: new FormControl('', [Validators.required, Validators.minLength(2)]),
+    name: new FormControl('', []),
     email: new FormControl('', [Validators.required, Validators.email]),
     subject: new FormControl('', [Validators.required, Validators.minLength(5)]),
killedBy: ContactPage should have required and minLength validators for name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrayDeclaration
shared/pages/contact-page/contact-page.ts:25:32
 export class ContactPage {
   contactForm = new FormGroup({
     name: new FormControl('', [Validators.required, Validators.minLength(2)]),
-    email: new FormControl('', [Validators.required, Validators.email]),
+    email: new FormControl('', []),
     subject: new FormControl('', [Validators.required, Validators.minLength(5)]),
     message: new FormControl('', [Validators.required, Validators.minLength(10)]),
killedBy: ContactPage should have required and email validators for email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrayDeclaration
shared/pages/contact-page/contact-page.ts:26:34
   contactForm = new FormGroup({
     name: new FormControl('', [Validators.required, Validators.minLength(2)]),
     email: new FormControl('', [Validators.required, Validators.email]),
-    subject: new FormControl('', [Validators.required, Validators.minLength(5)]),
+    subject: new FormControl('', []),
     message: new FormControl('', [Validators.required, Validators.minLength(10)]),
   });
killedBy: ContactPage should have required and minLength validators for subject
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
shared/pages/contact-page/contact-page.ts:30:14
     message: new FormControl('', [Validators.required, Validators.minLength(10)]),
   });
 
-  onSubmit() {
-    // Here you would typically send the data to a backend service
-    alert('Thank you for your message! We will get back to you soon.');
-    this.contactForm.reset();
-  }
+  onSubmit() {}
 
   get name() {
killedBy: ContactPage should reset form on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Thank you for your message! We will get back to you soon."

Number of calls: 0

[Killed] BlockStatement
shared/pages/contact-page/contact-page.ts:36:14
     this.contactForm.reset();
   }
 
-  get name() {
-    return this.contactForm.get('name');
-  }
+  get name() {}
   get email() {
     return this.contactForm.get('email');
killedBy: ContactPage should provide accessors for form controls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BlockStatement
shared/pages/contact-page/contact-page.ts:39:15
   get name() {
     return this.contactForm.get('name');
   }
-  get email() {
-    return this.contactForm.get('email');
-  }
+  get email() {}
   get subject() {
     return this.contactForm.get('subject');
killedBy: ContactPage should provide accessors for form controls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] StringLiteral
shared/pages/contact-page/contact-page.ts:40:33
     return this.contactForm.get('name');
   }
   get email() {
-    return this.contactForm.get('email');
+    return this.contactForm.get("");
   }
   get subject() {
killedBy: ContactPage should provide accessors for form controls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: null

[Killed] BlockStatement
shared/pages/contact-page/contact-page.ts:42:17
   get email() {
     return this.contactForm.get('email');
   }
-  get subject() {
-    return this.contactForm.get('subject');
-  }
+  get subject() {}
   get message() {
     return this.contactForm.get('message');
killedBy: ContactPage should provide accessors for form controls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BlockStatement
shared/pages/contact-page/contact-page.ts:45:17
   get subject() {
     return this.contactForm.get('subject');
   }
-  get message() {
-    return this.contactForm.get('message');
-  }
+  get message() {}
 }
 
killedBy: ContactPage should provide accessors for form controls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined
