[Killed] BlockStatement
app/shared/utils/stringUtils.ts:1:54
-export const capitalize = (value: string): string => {
-  return value.charAt(0).toUpperCase() + value.slice(1);
-};
+export const capitalize = (value: string): string => {};
 
killedBy: capitalize should capitalize the first letter of a string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: undefined

[Killed] MethodExpression
app/shared/utils/stringUtils.ts:2:10
 export const capitalize = (value: string): string => {
-  return value.charAt(0).toUpperCase() + value.slice(1);
+  return value.toUpperCase() + value.slice(1);
 };
 
killedBy: capitalize should capitalize the first letter of a string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: "HELLOello"

[Killed] MethodExpression
app/shared/utils/stringUtils.ts:2:10
 export const capitalize = (value: string): string => {
-  return value.charAt(0).toUpperCase() + value.slice(1);
+  return value.charAt(0).toLowerCase() + value.slice(1);
 };
 
killedBy: capitalize should capitalize the first letter of a string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: "hello"
