[Killed] StringLiteral
src/app/app.routes.ts:16:55
 import { EcommerceLayout } from './shared/layouts/ecommerce-layout/ecommerce-layout';
 
 export const routes: Routes = [
-  { path: '', redirectTo: 'shop/products', pathMatch: 'full' },
+  { path: '', redirectTo: 'shop/products', pathMatch: "" },
   { path: 'login', component: LoginPage },
   {
killedBy: app.routes should have a root redirect to login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "full"
Received: ""

[Killed] StringLiteral
src/app/app.routes.ts:17:11
 
 export const routes: Routes = [
   { path: '', redirectTo: 'shop/products', pathMatch: 'full' },
-  { path: 'login', component: LoginPage },
+  { path: "", component: LoginPage },
   {
     path: 'admin',
killedBy: app.routes should have a login route with LoginPage component
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] StringLiteral
src/app/app.routes.ts:23:31
     component: AdminLayout,
     canActivate: [AuthGuard],
     children: [
-      { path: '', redirectTo: 'users', pathMatch: 'full' },
+      { path: '', redirectTo: "", pathMatch: 'full' },
       { path: 'customers', redirectTo: 'users', pathMatch: 'full' },
       {
killedBy: app.routes should have admin redirect to users by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "users"
Received: ""

[Killed] StringLiteral
src/app/app.routes.ts:23:15
     component: AdminLayout,
     canActivate: [AuthGuard],
     children: [
-      { path: '', redirectTo: 'users', pathMatch: 'full' },
+      { path: "Stryker was here!", redirectTo: 'users', pathMatch: 'full' },
       { path: 'customers', redirectTo: 'users', pathMatch: 'full' },
       {
killedBy: app.routes should have admin redirect to users by default
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] StringLiteral
src/app/app.routes.ts:24:15
     canActivate: [AuthGuard],
     children: [
       { path: '', redirectTo: 'users', pathMatch: 'full' },
-      { path: 'customers', redirectTo: 'users', pathMatch: 'full' },
+      { path: "", redirectTo: 'users', pathMatch: 'full' },
       {
         path: 'users',

[Killed] ObjectLiteral
src/app/app.routes.ts:25:7
     children: [
       { path: '', redirectTo: 'users', pathMatch: 'full' },
       { path: 'customers', redirectTo: 'users', pathMatch: 'full' },
-      {
-        path: 'users',
-        component: UsersTable,
-        canDeactivate: [PendingChangesGuard],
-        runGuardsAndResolvers: 'always',
-      },
+      {},
       {
         path: 'users/new',
killedBy: app.routes should have users routes nested under admin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
src/app/app.routes.ts:31:7
         canDeactivate: [PendingChangesGuard],
         runGuardsAndResolvers: 'always',
       },
-      {
-        path: 'users/new',
-        component: UsersTable,
-        canDeactivate: [PendingChangesGuard],
-        runGuardsAndResolvers: 'always',
-      },
+      {},
       {
         path: 'users/:id',
killedBy: app.routes should have users/new route nested under admin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] StringLiteral
src/app/app.routes.ts:32:15
         runGuardsAndResolvers: 'always',
       },
       {
-        path: 'users/new',
+        path: "",
         component: UsersTable,
         canDeactivate: [PendingChangesGuard],
killedBy: app.routes should have users/new route nested under admin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] StringLiteral
src/app/app.routes.ts:50:15
         runGuardsAndResolvers: 'always',
       },
       { path: 'products', component: ProductsPage },
-      { path: 'user', component: UserPage },
+      { path: "", component: UserPage },
     ],
   },
killedBy: app.routes should have user route nested under admin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
src/app/app.routes.ts:50:7
         runGuardsAndResolvers: 'always',
       },
       { path: 'products', component: ProductsPage },
-      { path: 'user', component: UserPage },
+      {},
     ],
   },
killedBy: app.routes should have user route nested under admin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
src/app/app.routes.ts:57:7
     path: 'shop',
     component: EcommerceLayout,
     children: [
-      { path: 'products', component: ProductsPage },
+      {},
       { path: 'products/:id', component: ProductDetailPage },
       { path: 'cart', component: CartPage },
killedBy: app.routes should have products route nested under shop
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] ObjectLiteral
src/app/app.routes.ts:58:7
     component: EcommerceLayout,
     children: [
       { path: 'products', component: ProductsPage },
-      { path: 'products/:id', component: ProductDetailPage },
+      {},
       { path: 'cart', component: CartPage },
       { path: 'orders', component: OrdersPage },
