[Killed] BlockStatement
app/core/services/pending-changes.service.ts:24:26
     this._activeDialog = null;
   }
 
-  setPending(v: boolean) {
-    this._pending = v;
-    // Always remove first to prevent duplicate handlers (idempotent)
-    window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-    if (v) {
-      window.addEventListener('beforeunload', this._beforeUnloadHandler);
-    }
-  }
+  setPending(v: boolean) {}
 
   clear() {
killedBy: PendingChangesService should set pending to true and add event listener
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
app/core/services/pending-changes.service.ts:27:32
   setPending(v: boolean) {
     this._pending = v;
     // Always remove first to prevent duplicate handlers (idempotent)
-    window.removeEventListener('beforeunload', this._beforeUnloadHandler);
+    window.removeEventListener("", this._beforeUnloadHandler);
     if (v) {
       window.addEventListener('beforeunload', this._beforeUnloadHandler);
killedBy: PendingChangesService should set pending to false and remove event listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "beforeunload", Any<Function>
Received
       1: "", [Function _beforeUnloadHandler]
       2: "", [Function _beforeUnloadHandler]

Number of calls: 2

[Killed] ConditionalExpression
app/core/services/pending-changes.service.ts:28:9
     this._pending = v;
     // Always remove first to prevent duplicate handlers (idempotent)
     window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-    if (v) {
+    if (false) {
       window.addEventListener('beforeunload', this._beforeUnloadHandler);
     }
killedBy: PendingChangesService should set pending to true and add event listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "beforeunload", Any<Function>

Number of calls: 0

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:28:12
     this._pending = v;
     // Always remove first to prevent duplicate handlers (idempotent)
     window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-    if (v) {
-      window.addEventListener('beforeunload', this._beforeUnloadHandler);
-    }
+    if (v) {}
   }
 
killedBy: PendingChangesService should set pending to true and add event listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "beforeunload", Any<Function>

Number of calls: 0

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:46:25
   // clear the pending flag and close any open dialog that was registered.
   confirmNavigation(): boolean {
     // If nothing pending, still close any registered dialog and allow navigation
-    if (!this._pending) {
-      const dialogRef = this._activeDialog;
-      this._activeDialog = null;
-      try {
-        dialogRef?.close();
-      } catch {
-        /* ignore */
-      }
-      window.removeEventListener('beforeunload', this._beforeUnloadHandler);
-      return true;
-    }
+    if (!this._pending) {}
 
     const ok = window.confirm('You have unsaved changes. Leave without saving?');
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
app/core/services/pending-changes.service.ts:49:11
     if (!this._pending) {
       const dialogRef = this._activeDialog;
       this._activeDialog = null;
-      try {
-        dialogRef?.close();
-      } catch {
+      try {} catch {
         /* ignore */
       }
killedBy: PendingChangesService should set active dialog
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] OptionalChaining
app/core/services/pending-changes.service.ts:50:9
       const dialogRef = this._activeDialog;
       this._activeDialog = null;
       try {
-        dialogRef?.close();
+        dialogRef.close();
       } catch {
         /* ignore */

[Killed] StringLiteral
app/core/services/pending-changes.service.ts:54:34
       } catch {
         /* ignore */
       }
-      window.removeEventListener('beforeunload', this._beforeUnloadHandler);
+      window.removeEventListener("", this._beforeUnloadHandler);
       return true;
     }
killedBy: PendingChangesService should return true when confirmNavigation is called with no pending changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "beforeunload", Any<Function>
Received: "", [Function _beforeUnloadHandler]

Number of calls: 1

[Killed] ConditionalExpression
app/core/services/pending-changes.service.ts:59:9
     }
 
     const ok = window.confirm('You have unsaved changes. Leave without saving?');
-    if (ok) {
+    if (false) {
       this._pending = false;
       const dialogRef = this._activeDialog;
killedBy: PendingChangesService should call dialog.close() in confirmNavigation when pending and user confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
