[Killed] ArrowFunction
app/features/cart/cart.service.ts:19:32
 
   cartItems$ = this.cartItems.asReadonly();
   cartItemCount = computed(() => this.cartItems().reduce((sum, item) => sum + item.quantity, 0));
-  selectedItemCount = computed(() =>
-    this.cartItems()
-      .filter(item => item.selected)
-      .reduce((sum, item) => sum + item.quantity, 0)
+  selectedItemCount = computed(() => undefined
   );
 
killedBy: CartService selectedItemCount should return 0 for an empty cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] MethodExpression
app/features/cart/cart.service.ts:20:5
   cartItems$ = this.cartItems.asReadonly();
   cartItemCount = computed(() => this.cartItems().reduce((sum, item) => sum + item.quantity, 0));
   selectedItemCount = computed(() =>
-    this.cartItems()
-      .filter(item => item.selected)
+    this.cartItems()
       .reduce((sum, item) => sum + item.quantity, 0)
   );
killedBy: CartService selectedItemCount should return count of only selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 5

[Killed] ArrowFunction
app/features/cart/cart.service.ts:21:15
   cartItemCount = computed(() => this.cartItems().reduce((sum, item) => sum + item.quantity, 0));
   selectedItemCount = computed(() =>
     this.cartItems()
-      .filter(item => item.selected)
+      .filter(() => undefined)
       .reduce((sum, item) => sum + item.quantity, 0)
   );
killedBy: CartService selectedItemCount should return count of only selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
app/features/cart/cart.service.ts:22:30
   selectedItemCount = computed(() =>
     this.cartItems()
       .filter(item => item.selected)
-      .reduce((sum, item) => sum + item.quantity, 0)
+      .reduce((sum, item) => sum - item.quantity, 0)
   );
 
killedBy: CartService selectedItemCount should return count of only selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] ArrowFunction
app/features/cart/cart.service.ts:22:15
   selectedItemCount = computed(() =>
     this.cartItems()
       .filter(item => item.selected)
-      .reduce((sum, item) => sum + item.quantity, 0)
+      .reduce(() => undefined, 0)
   );
 
killedBy: CartService selectedItemCount should return count of only selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
app/features/cart/cart.service.ts:25:17
       .reduce((sum, item) => sum + item.quantity, 0)
   );
 
-  constructor() {
-    this.restoreFromStorage();
-  }
+  constructor() {}
 
   private persist(): void {
killedBy: CartService persistence should restore cart from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/cart/cart.service.ts:29:27
     this.restoreFromStorage();
   }
 
-  private persist(): void {
-    try {
-      localStorage.setItem(CART_STORAGE_KEY, JSON.stringify(this.cartItems()));
-    } catch {
-      // Silently fail if localStorage is unavailable (e.g., private browsing)
-    }
-  }
+  private persist(): void {}
 
   restoreFromStorage(): void {
killedBy: CartService persistence should save cart to localStorage when adding items
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BlockStatement
app/features/cart/cart.service.ts:30:9
   }
 
   private persist(): void {
-    try {
-      localStorage.setItem(CART_STORAGE_KEY, JSON.stringify(this.cartItems()));
-    } catch {
+    try {} catch {
       // Silently fail if localStorage is unavailable (e.g., private browsing)
     }
killedBy: CartService persistence should save cart to localStorage when adding items
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BlockStatement
app/features/cart/cart.service.ts:37:30
     }
   }
 
-  restoreFromStorage(): void {
-    try {
-      const stored = localStorage.getItem(CART_STORAGE_KEY);
-      if (stored) {
-        this.cartItems.set(JSON.parse(stored));
-      }
-    } catch {
-      // Silently fail if localStorage is unavailable or data is corrupted
-    }
-  }
+  restoreFromStorage(): void {}
 
   addToCart(product: Product, quantity = 1) {
killedBy: CartService persistence should restore cart from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/cart/cart.service.ts:38:9
   }
 
   restoreFromStorage(): void {
-    try {
-      const stored = localStorage.getItem(CART_STORAGE_KEY);
-      if (stored) {
-        this.cartItems.set(JSON.parse(stored));
-      }
-    } catch {
+    try {} catch {
       // Silently fail if localStorage is unavailable or data is corrupted
     }
killedBy: CartService persistence should restore cart from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/cart/cart.service.ts:40:19
   restoreFromStorage(): void {
     try {
       const stored = localStorage.getItem(CART_STORAGE_KEY);
-      if (stored) {
-        this.cartItems.set(JSON.parse(stored));
-      }
+      if (stored) {}
     } catch {
       // Silently fail if localStorage is unavailable or data is corrupted
killedBy: CartService persistence should restore cart from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:40:11
   restoreFromStorage(): void {
     try {
       const stored = localStorage.getItem(CART_STORAGE_KEY);
-      if (stored) {
+      if (false) {
         this.cartItems.set(JSON.parse(stored));
       }
killedBy: CartService persistence should restore cart from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/cart/cart.service.ts:48:45
     }
   }
 
-  addToCart(product: Product, quantity = 1) {
-    const current = this.cartItems();
-    const existingItem = current.find(item => item.product.id === product.id);
-
-    if (existingItem) {
-      this.cartItems.update(items =>
-        items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
-        )
-      );
-    } else {
-      this.cartItems.update(items => [...items, { product, quantity, selected: true }]);
-    }
-
-    this.persist();
-  }
+  addToCart(product: Product, quantity = 1) {}
 
   removeFromCart(productId: number) {
killedBy: CartService addToCart should add a new product to the cart with selected=true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:52:9
     const current = this.cartItems();
     const existingItem = current.find(item => item.product.id === product.id);
 
-    if (existingItem) {
+    if (true) {
       this.cartItems.update(items =>
         items.map(item =>
killedBy: CartService addToCart should add a new product to the cart with selected=true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
app/features/cart/cart.service.ts:55:65
     if (existingItem) {
       this.cartItems.update(items =>
         items.map(item =>
-          item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
+          item.product.id === product.id ? { ...item, quantity: item.quantity - quantity } : item
         )
       );
killedBy: CartService addToCart should increase quantity when adding an existing product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Killed] BlockStatement
app/features/cart/cart.service.ts:58:12
           item.product.id === product.id ? { ...item, quantity: item.quantity + quantity } : item
         )
       );
-    } else {
-      this.cartItems.update(items => [...items, { product, quantity, selected: true }]);
-    }
+    } else {}
 
     this.persist();
killedBy: CartService addToCart should add a new product to the cart with selected=true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
app/features/cart/cart.service.ts:59:80
         )
       );
     } else {
-      this.cartItems.update(items => [...items, { product, quantity, selected: true }]);
+      this.cartItems.update(items => [...items, { product, quantity, selected: false }]);
     }
 
killedBy: CartService addToCart should add a new product to the cart with selected=true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
app/features/cart/cart.service.ts:59:29
         )
       );
     } else {
-      this.cartItems.update(items => [...items, { product, quantity, selected: true }]);
+      this.cartItems.update(() => undefined);
     }
 
killedBy: CartService addToCart should add a new product to the cart with selected=true
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/features/cart/cart.service.ts:65:37
     this.persist();
   }
 
-  removeFromCart(productId: number) {
-    this.cartItems.update(items => items.filter(item => item.product.id !== productId));
-    this.persist();
-  }
+  removeFromCart(productId: number) {}
 
   updateQuantity(productId: number, quantity: number) {
killedBy: CartService removeFromCart should remove a product from the cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
app/features/cart/cart.service.ts:70:55
     this.persist();
   }
 
-  updateQuantity(productId: number, quantity: number) {
-    if (quantity <= 0) {
-      this.removeFromCart(productId);
-      return;
-    }
-
-    this.cartItems.update(items =>
-      items.map(item => (item.product.id === productId ? { ...item, quantity } : item))
-    );
-    this.persist();
-  }
+  updateQuantity(productId: number, quantity: number) {}
 
   toggleItemSelection(productId: number) {
killedBy: CartService updateQuantity should update the quantity of a product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] BlockStatement
app/features/cart/cart.service.ts:71:24
   }
 
   updateQuantity(productId: number, quantity: number) {
-    if (quantity <= 0) {
-      this.removeFromCart(productId);
-      return;
-    }
+    if (quantity <= 0) {}
 
     this.cartItems.update(items =>
killedBy: CartService updateQuantity should remove the product when quantity is set to 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:71:9
   }
 
   updateQuantity(productId: number, quantity: number) {
-    if (quantity <= 0) {
+    if (false) {
       this.removeFromCart(productId);
       return;
killedBy: CartService updateQuantity should remove the product when quantity is set to 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
app/features/cart/cart.service.ts:77:26
     }
 
     this.cartItems.update(items =>
-      items.map(item => (item.product.id === productId ? { ...item, quantity } : item))
+      items.map(item => (item.product.id !== productId ? { ...item, quantity } : item))
     );
     this.persist();
killedBy: CartService updateQuantity should update the quantity of a product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] BlockStatement
app/features/cart/cart.service.ts:82:42
     this.persist();
   }
 
-  toggleItemSelection(productId: number) {
-    this.cartItems.update(items =>
-      items.map(item =>
-        item.product.id === productId ? { ...item, selected: !item.selected } : item
-      )
-    );
-    this.persist();
-  }
+  toggleItemSelection(productId: number) {}
 
   selectAllItems(selected: boolean) {
killedBy: CartService toggleItemSelection should toggle selected state of an item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
app/features/cart/cart.service.ts:83:27
   }
 
   toggleItemSelection(productId: number) {
-    this.cartItems.update(items =>
-      items.map(item =>
-        item.product.id === productId ? { ...item, selected: !item.selected } : item
-      )
+    this.cartItems.update(() => undefined
     );
     this.persist();
killedBy: CartService toggleItemSelection should toggle selected state of an item
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
app/features/cart/cart.service.ts:84:17
 
   toggleItemSelection(productId: number) {
     this.cartItems.update(items =>
-      items.map(item =>
-        item.product.id === productId ? { ...item, selected: !item.selected } : item
+      items.map(() => undefined
       )
     );
killedBy: CartService toggleItemSelection should toggle selected state of an item
statusReason: TypeError: Cannot read properties of undefined (reading 'selected')

[Killed] ConditionalExpression
app/features/cart/cart.service.ts:85:9
   toggleItemSelection(productId: number) {
     this.cartItems.update(items =>
       items.map(item =>
-        item.product.id === productId ? { ...item, selected: !item.selected } : item
+        false ? { ...item, selected: !item.selected } : item
       )
     );
killedBy: CartService toggleItemSelection should toggle selected state of an item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
app/features/cart/cart.service.ts:85:9
   toggleItemSelection(productId: number) {
     this.cartItems.update(items =>
       items.map(item =>
-        item.product.id === productId ? { ...item, selected: !item.selected } : item
+        item.product.id !== productId ? { ...item, selected: !item.selected } : item
       )
     );
killedBy: CartService toggleItemSelection should toggle selected state of an item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/features/cart/cart.service.ts:91:37
     this.persist();
   }
 
-  selectAllItems(selected: boolean) {
-    this.cartItems.update(items => items.map(item => ({ ...item, selected })));
-    this.persist();
-  }
+  selectAllItems(selected: boolean) {}
 
   clearCart() {
killedBy: CartService selectAllItems should select all items when passed true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
app/features/cart/cart.service.ts:92:27
   }
 
   selectAllItems(selected: boolean) {
-    this.cartItems.update(items => items.map(item => ({ ...item, selected })));
+    this.cartItems.update(() => undefined);
     this.persist();
   }
killedBy: CartService selectAllItems should select all items when passed true
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
app/features/cart/cart.service.ts:92:46
   }
 
   selectAllItems(selected: boolean) {
-    this.cartItems.update(items => items.map(item => ({ ...item, selected })));
+    this.cartItems.update(items => items.map(() => undefined));
     this.persist();
   }
killedBy: CartService selectAllItems should select all items when passed true
statusReason: TypeError: Cannot read properties of undefined (reading 'selected')

[Killed] BlockStatement
app/features/cart/cart.service.ts:96:15
     this.persist();
   }
 
-  clearCart() {
-    this.cartItems.set([]);
-    this.persist();
-  }
+  clearCart() {}
 
   getSubtotal(): number {
killedBy: CartService clearCart should remove all items from the cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ArrayDeclaration
app/features/cart/cart.service.ts:97:24
   }
 
   clearCart() {
-    this.cartItems.set([]);
+    this.cartItems.set(["Stryker was here"]);
     this.persist();
   }
killedBy: CartService addToCart should add a new product to the cart with selected=true
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
app/features/cart/cart.service.ts:101:25
     this.persist();
   }
 
-  getSubtotal(): number {
-    return this.cartItems()
-      .filter(item => item.selected)
-      .reduce((sum, item) => sum + item.product.price * item.quantity, 0);
-  }
+  getSubtotal(): number {}
 
   getSelectedItems(): CartItem[] {
killedBy: CartService getSubtotal should return 0 for an empty cart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] MethodExpression
app/features/cart/cart.service.ts:102:12
   }
 
   getSubtotal(): number {
-    return this.cartItems()
-      .filter(item => item.selected)
+    return this.cartItems()
       .reduce((sum, item) => sum + item.product.price * item.quantity, 0);
   }
killedBy: CartService getSubtotal should calculate subtotal only for selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 40

[Killed] ArrowFunction
app/features/cart/cart.service.ts:103:15
 
   getSubtotal(): number {
     return this.cartItems()
-      .filter(item => item.selected)
+      .filter(() => undefined)
       .reduce((sum, item) => sum + item.product.price * item.quantity, 0);
   }
killedBy: CartService getSubtotal should calculate subtotal only for selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
app/features/cart/cart.service.ts:104:36
   getSubtotal(): number {
     return this.cartItems()
       .filter(item => item.selected)
-      .reduce((sum, item) => sum + item.product.price * item.quantity, 0);
+      .reduce((sum, item) => sum + item.product.price / item.quantity, 0);
   }
 
killedBy: CartService getSubtotal should calculate subtotal only for selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 25

[Killed] ArrowFunction
app/features/cart/cart.service.ts:104:15
   getSubtotal(): number {
     return this.cartItems()
       .filter(item => item.selected)
-      .reduce((sum, item) => sum + item.product.price * item.quantity, 0);
+      .reduce(() => undefined, 0);
   }
 
killedBy: CartService getSubtotal should calculate subtotal only for selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: undefined

[Killed] BlockStatement
app/features/cart/cart.service.ts:107:34
       .reduce((sum, item) => sum + item.product.price * item.quantity, 0);
   }
 
-  getSelectedItems(): CartItem[] {
-    return this.cartItems().filter(item => item.selected);
-  }
+  getSelectedItems(): CartItem[] {}
 
   getAllItems(): CartItem[] {
killedBy: CartService getSelectedItems should return only selected items
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
app/features/cart/cart.service.ts:108:36
   }
 
   getSelectedItems(): CartItem[] {
-    return this.cartItems().filter(item => item.selected);
+    return this.cartItems().filter(() => undefined);
   }
 
killedBy: CartService getSelectedItems should return only selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
app/features/cart/cart.service.ts:108:12
   }
 
   getSelectedItems(): CartItem[] {
-    return this.cartItems().filter(item => item.selected);
+    return this.cartItems();
   }
 
killedBy: CartService getSelectedItems should return only selected items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
app/features/cart/cart.service.ts:111:29
     return this.cartItems().filter(item => item.selected);
   }
 
-  getAllItems(): CartItem[] {
-    return this.cartItems();
-  }
+  getAllItems(): CartItem[] {}
 
   placeOrder(shipping: number): Observable<OrderResponse> {
killedBy: CartService getAllItems should return all items regardless of selection
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
app/features/cart/cart.service.ts:115:59
     return this.cartItems();
   }
 
-  placeOrder(shipping: number): Observable<OrderResponse> {
-    const selected = this.getSelectedItems();
-    const request: OrderRequest = {
-      items: selected.map(item => ({
-        productId: item.product.id,
-        productName: item.product.title,
-        price: item.product.price,
-        quantity: item.quantity,
-      })),
-      shipping,
-    };
-
-    return this.orderService.createOrder(request);
-  }
+  placeOrder(shipping: number): Observable<OrderResponse> {}
 }
 

[NoCoverage] ArrowFunction
app/features/cart/cart.service.ts:118:27
   placeOrder(shipping: number): Observable<OrderResponse> {
     const selected = this.getSelectedItems();
     const request: OrderRequest = {
-      items: selected.map(item => ({
-        productId: item.product.id,
-        productName: item.product.title,
-        price: item.product.price,
-        quantity: item.quantity,
-      })),
+      items: selected.map(() => undefined),
       shipping,
     };
