[Survived] BooleanLiteral
cart/components/cart-page/cart-page.ts:41:30
   private snackBar = inject(MatSnackBar);
 
   shipping = 5.99;
-  isCheckoutLoading = signal(false);
+  isCheckoutLoading = signal(true);
 
   cartItems = this.cartService.cartItems$;

[Survived] BooleanLiteral
cart/components/cart-page/cart-page.ts:45:24
 
   cartItems = this.cartService.cartItems$;
 
-  allSelected = signal(true);
+  allSelected = signal(false);
 
   constructor() {

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:47:17
 
   allSelected = signal(true);
 
-  constructor() {
-    effect(() => {
-      const items = this.cartItems();
-      this.allSelected.set(items.length > 0 && items.every(i => i.selected));
-    });
-  }
+  constructor() {}
 
   get subtotal(): number {
killedBy: CartPage should toggle all items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true
Received: false

Number of calls: 1

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:48:18
   allSelected = signal(true);
 
   constructor() {
-    effect(() => {
-      const items = this.cartItems();
-      this.allSelected.set(items.length > 0 && items.every(i => i.selected));
-    });
+    effect(() => {});
   }
 
killedBy: CartPage should toggle all items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true
Received: false

Number of calls: 1

[Killed] ConditionalExpression
cart/components/cart-page/cart-page.ts:50:28
   constructor() {
     effect(() => {
       const items = this.cartItems();
-      this.allSelected.set(items.length > 0 && items.every(i => i.selected));
+      this.allSelected.set(false);
     });
   }
killedBy: CartPage should set allSelected to true when effect runs with all items selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
cart/components/cart-page/cart-page.ts:50:28
   constructor() {
     effect(() => {
       const items = this.cartItems();
-      this.allSelected.set(items.length > 0 && items.every(i => i.selected));
+      this.allSelected.set(true);
     });
   }
killedBy: CartPage should toggle all items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true
Received: false

Number of calls: 1

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:54:26
     });
   }
 
-  get subtotal(): number {
-    return this.cartService.getSubtotal();
-  }
+  get subtotal(): number {}
 
   get total(): number {
killedBy: CartPage should get subtotal from CartService
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:58:23
     return this.cartService.getSubtotal();
   }
 
-  get total(): number {
-    return this.subtotal + this.shipping;
-  }
+  get total(): number {}
 
   get selectedItems(): CartItem[] {
killedBy: CartPage should calculate total as subtotal + shipping
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5.99
Received: undefined

[Killed] ArithmeticOperator
cart/components/cart-page/cart-page.ts:59:12
   }
 
   get total(): number {
-    return this.subtotal + this.shipping;
+    return this.subtotal - this.shipping;
   }
 
killedBy: CartPage should calculate total as subtotal + shipping
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5.99
Received: -5.99

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:62:35
     return this.subtotal + this.shipping;
   }
 
-  get selectedItems(): CartItem[] {
-    return this.cartService.getSelectedItems();
-  }
+  get selectedItems(): CartItem[] {}
 
   toggleItemSelection(item: CartItem): void {
killedBy: CartPage should checkout when cart has selected items
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:66:45
     return this.cartService.getSelectedItems();
   }
 
-  toggleItemSelection(item: CartItem): void {
-    this.cartService.toggleItemSelection(item.product.id);
-  }
+  toggleItemSelection(item: CartItem): void {}
 
   toggleAll(): void {
killedBy: CartPage should toggle item selection via CartService
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:70:21
     this.cartService.toggleItemSelection(item.product.id);
   }
 
-  toggleAll(): void {
-    const newVal = !this.allSelected();
-    this.cartService.selectAllItems(newVal);
-    this.allSelected.set(newVal);
-  }
+  toggleAll(): void {}
 
   updateQuantity(item: CartItem, newQuantity: number): void {
killedBy: CartPage should toggle all items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true

Number of calls: 0

[Killed] BooleanLiteral
cart/components/cart-page/cart-page.ts:71:20
   }
 
   toggleAll(): void {
-    const newVal = !this.allSelected();
+    const newVal = this.allSelected();
     this.cartService.selectAllItems(newVal);
     this.allSelected.set(newVal);
killedBy: CartPage should toggle all items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true
Received: false

Number of calls: 1

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:76:61
     this.allSelected.set(newVal);
   }
 
-  updateQuantity(item: CartItem, newQuantity: number): void {
-    if (newQuantity <= 0) {
-      this.removeItem(item);
-      return;
-    }
-
-    this.cartService.updateQuantity(item.product.id, newQuantity);
-  }
+  updateQuantity(item: CartItem, newQuantity: number): void {}
 
   removeItem(item: CartItem): void {
killedBy: CartPage should update quantity via CartService
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, 3

Number of calls: 0

[Killed] EqualityOperator
cart/components/cart-page/cart-page.ts:77:9
   }
 
   updateQuantity(item: CartItem, newQuantity: number): void {
-    if (newQuantity <= 0) {
+    if (newQuantity < 0) {
       this.removeItem(item);
       return;
killedBy: CartPage should remove item when quantity is 0 or less
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:85:36
     this.cartService.updateQuantity(item.product.id, newQuantity);
   }
 
-  removeItem(item: CartItem): void {
-    this.cartService.removeFromCart(item.product.id);
-    this.snackBar.open(`Removed ${item.product.title} from cart`, 'Close', { duration: 2000 });
-  }
+  removeItem(item: CartItem): void {}
 
   checkout(): void {
killedBy: CartPage should remove item when quantity is 0 or less
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:92:32
 
   checkout(): void {
     const selected = this.selectedItems;
-    if (selected.length === 0) {
-      this.snackBar.open('Select at least one item to checkout', 'Close', {
-        duration: 3000,
-      });
-      return;
-    }
+    if (selected.length === 0) {}
 
     this.isCheckoutLoading.set(true);
killedBy: CartPage should not checkout when no items are selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] EqualityOperator
cart/components/cart-page/cart-page.ts:92:9
 
   checkout(): void {
     const selected = this.selectedItems;
-    if (selected.length === 0) {
+    if (selected.length !== 0) {
       this.snackBar.open('Select at least one item to checkout', 'Close', {
         duration: 3000,
killedBy: CartPage should checkout when cart has selected items
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
cart/components/cart-page/cart-page.ts:93:26
   checkout(): void {
     const selected = this.selectedItems;
     if (selected.length === 0) {
-      this.snackBar.open('Select at least one item to checkout', 'Close', {
+      this.snackBar.open("", 'Close', {
         duration: 3000,
       });
killedBy: CartPage should show snackbar when no items selected for checkout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "Select at least one item to checkout",
+ "",
  "Close",

[Survived] BooleanLiteral
cart/components/cart-page/cart-page.ts:99:32
       return;
     }
 
-    this.isCheckoutLoading.set(true);
+    this.isCheckoutLoading.set(false);
 
     this.cartService.placeOrder(this.shipping).subscribe({

[Killed] BlockStatement
cart/components/cart-page/cart-page.ts:102:22
     this.isCheckoutLoading.set(true);
 
     this.cartService.placeOrder(this.shipping).subscribe({
-      next: order => {
-        this.cartService.clearCart();
-        this.isCheckoutLoading.set(false);
-        this.snackBar.open(`Order #${order.id} placed successfully!`, 'Close', {
-          duration: 4000,
-        });
-        this.router.navigate(['/shop/products']);
-      },
+      next: order => {},
       error: () => {
         this.isCheckoutLoading.set(false);
killedBy: CartPage should checkout when cart has selected items
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BooleanLiteral
cart/components/cart-page/cart-page.ts:104:36
     this.cartService.placeOrder(this.shipping).subscribe({
       next: order => {
         this.cartService.clearCart();
-        this.isCheckoutLoading.set(false);
+        this.isCheckoutLoading.set(true);
         this.snackBar.open(`Order #${order.id} placed successfully!`, 'Close', {
           duration: 4000,

[Killed] StringLiteral
cart/components/cart-page/cart-page.ts:105:28
       next: order => {
         this.cartService.clearCart();
         this.isCheckoutLoading.set(false);
-        this.snackBar.open(`Order #${order.id} placed successfully!`, 'Close', {
+        this.snackBar.open(``, 'Close', {
           duration: 4000,
         });
killedBy: CartPage should show success snackbar on checkout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "Order #1 placed successfully!",
+ "",
  "Close",

[Killed] StringLiteral
cart/components/cart-page/cart-page.ts:108:31
         this.snackBar.open(`Order #${order.id} placed successfully!`, 'Close', {
           duration: 4000,
         });
-        this.router.navigate(['/shop/products']);
+        this.router.navigate([""]);
       },
       error: () => {
killedBy: CartPage should checkout when cart has selected items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/shop/products",
+   "",

[Killed] ArrayDeclaration
cart/components/cart-page/cart-page.ts:108:30
         this.snackBar.open(`Order #${order.id} placed successfully!`, 'Close', {
           duration: 4000,
         });
-        this.router.navigate(['/shop/products']);
+        this.router.navigate([]);
       },
       error: () => {
killedBy: CartPage should checkout when cart has selected items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/shop/products",
- ]

[NoCoverage] BlockStatement
cart/components/cart-page/cart-page.ts:110:20
         });
         this.router.navigate(['/shop/products']);
       },
-      error: () => {
-        this.isCheckoutLoading.set(false);
-        this.snackBar.open('Failed to place order. Please try again.', 'Close', {
-          duration: 4000,
-        });
-      },
+      error: () => {},
     });
   }

[NoCoverage] BooleanLiteral
cart/components/cart-page/cart-page.ts:111:36
         this.router.navigate(['/shop/products']);
       },
       error: () => {
-        this.isCheckoutLoading.set(false);
+        this.isCheckoutLoading.set(true);
         this.snackBar.open('Failed to place order. Please try again.', 'Close', {
           duration: 4000,

[NoCoverage] StringLiteral
cart/components/cart-page/cart-page.ts:112:28
       },
       error: () => {
         this.isCheckoutLoading.set(false);
-        this.snackBar.open('Failed to place order. Please try again.', 'Close', {
+        this.snackBar.open("", 'Close', {
           duration: 4000,
         });

[NoCoverage] ObjectLiteral
cart/components/cart-page/cart-page.ts:112:81
       },
       error: () => {
         this.isCheckoutLoading.set(false);
-        this.snackBar.open('Failed to place order. Please try again.', 'Close', {
-          duration: 4000,
-        });
+        this.snackBar.open('Failed to place order. Please try again.', 'Close', {});
       },
     });
