[Survived] BooleanLiteral
orders/components/orders-page/orders-page.ts:34:20
   private snackBar = inject(MatSnackBar);
 
   orders = signal<OrderResponse[]>([]);
-  loading = signal(false);
+  loading = signal(true);
   error = signal<string | null>(null);
 

[Killed] BlockStatement
orders/components/orders-page/orders-page.ts:37:14
   loading = signal(false);
   error = signal<string | null>(null);
 
-  ngOnInit() {
-    this.loadOrders();
-  }
+  ngOnInit() {}
 
   loadOrders() {
killedBy: OrdersPage should load orders on init
statusReason: Error: Expected one matching request for criteria "Match URL: api/orders", found none.

[Killed] BlockStatement
orders/components/orders-page/orders-page.ts:41:16
     this.loadOrders();
   }
 
-  loadOrders() {
-    this.loading.set(true);
-    this.error.set(null);
-
-    this.orderService.getOrders().subscribe({
-      next: orders => {
-        this.orders.set(orders);
-        this.loading.set(false);
-      },
-      error: () => {
-        this.error.set('Failed to load orders');
-        this.loading.set(false);
-      },
-    });
-  }
+  loadOrders() {}
 
   formatCurrency(value: number): string {
killedBy: OrdersPage should load orders on init
statusReason: Error: Expected one matching request for criteria "Match URL: api/orders", found none.

[Killed] BooleanLiteral
orders/components/orders-page/orders-page.ts:42:22
   }
 
   loadOrders() {
-    this.loading.set(true);
+    this.loading.set(false);
     this.error.set(null);
 
killedBy: OrdersPage should retry loading orders after error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
orders/components/orders-page/orders-page.ts:45:45
     this.loading.set(true);
     this.error.set(null);
 
-    this.orderService.getOrders().subscribe({
-      next: orders => {
-        this.orders.set(orders);
-        this.loading.set(false);
-      },
-      error: () => {
-        this.error.set('Failed to load orders');
-        this.loading.set(false);
-      },
-    });
+    this.orderService.getOrders().subscribe({});
   }
 
killedBy: OrdersPage should load orders on init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
orders/components/orders-page/orders-page.ts:46:23
     this.error.set(null);
 
     this.orderService.getOrders().subscribe({
-      next: orders => {
-        this.orders.set(orders);
-        this.loading.set(false);
-      },
+      next: orders => {},
       error: () => {
         this.error.set('Failed to load orders');
killedBy: OrdersPage should load orders on init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BooleanLiteral
orders/components/orders-page/orders-page.ts:48:26
     this.orderService.getOrders().subscribe({
       next: orders => {
         this.orders.set(orders);
-        this.loading.set(false);
+        this.loading.set(true);
       },
       error: () => {
killedBy: OrdersPage should load orders on init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
orders/components/orders-page/orders-page.ts:50:20
         this.orders.set(orders);
         this.loading.set(false);
       },
-      error: () => {
-        this.error.set('Failed to load orders');
-        this.loading.set(false);
-      },
+      error: () => {},
     });
   }
killedBy: OrdersPage should set error state on load failure
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BooleanLiteral
orders/components/orders-page/orders-page.ts:52:26
       },
       error: () => {
         this.error.set('Failed to load orders');
-        this.loading.set(false);
+        this.loading.set(true);
       },
     });
killedBy: OrdersPage should set error state on load failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
orders/components/orders-page/orders-page.ts:57:41
     });
   }
 
-  formatCurrency(value: number): string {
-    return `$${Number(value).toFixed(2)}`;
-  }
+  formatCurrency(value: number): string {}
 
   formatDate(dateStr: string): string {
killedBy: OrdersPage should format currency correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$10.00"
Received: undefined

[Killed] BlockStatement
orders/components/orders-page/orders-page.ts:61:39
     return `$${Number(value).toFixed(2)}`;
   }
 
-  formatDate(dateStr: string): string {
-    return new Date(dateStr).toLocaleDateString('en-GB', {
-      year: 'numeric',
-      month: 'short',
-      day: 'numeric',
-      hour: '2-digit',
-      minute: '2-digit',
-    });
-  }
+  formatDate(dateStr: string): string {}
 
   getStatusColor(status: string): string {
killedBy: OrdersPage should format date correctly
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
orders/components/orders-page/orders-page.ts:71:42
     });
   }
 
-  getStatusColor(status: string): string {
-    switch (status.toLowerCase()) {
-      case 'pending':
-        return '#ff9800';
-      case 'processing':
-        return '#2196f3';
-      case 'completed':
-        return '#4caf50';
-      case 'cancelled':
-        return '#f44336';
-      default:
-        return '#9e9e9e';
-    }
-  }
+  getStatusColor(status: string): string {}
 }
 
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#ff9800"
Received: undefined

[Killed] MethodExpression
orders/components/orders-page/orders-page.ts:72:13
   }
 
   getStatusColor(status: string): string {
-    switch (status.toLowerCase()) {
+    switch (status.toUpperCase()) {
       case 'pending':
         return '#ff9800';
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#ff9800"
Received: "#9e9e9e"

[Killed] ConditionalExpression
orders/components/orders-page/orders-page.ts:73:7
 
   getStatusColor(status: string): string {
     switch (status.toLowerCase()) {
-      case 'pending':
-        return '#ff9800';
+      case 'pending':
       case 'processing':
         return '#2196f3';
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#ff9800"
Received: "#2196f3"

[Killed] ConditionalExpression
orders/components/orders-page/orders-page.ts:75:7
     switch (status.toLowerCase()) {
       case 'pending':
         return '#ff9800';
-      case 'processing':
-        return '#2196f3';
+      case 'processing':
       case 'completed':
         return '#4caf50';
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#2196f3"
Received: "#4caf50"

[Killed] ConditionalExpression
orders/components/orders-page/orders-page.ts:77:7
         return '#ff9800';
       case 'processing':
         return '#2196f3';
-      case 'completed':
-        return '#4caf50';
+      case 'completed':
       case 'cancelled':
         return '#f44336';
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#4caf50"
Received: "#f44336"

[Killed] StringLiteral
orders/components/orders-page/orders-page.ts:77:12
         return '#ff9800';
       case 'processing':
         return '#2196f3';
-      case 'completed':
+      case "":
         return '#4caf50';
       case 'cancelled':
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#4caf50"
Received: "#9e9e9e"

[Killed] ConditionalExpression
orders/components/orders-page/orders-page.ts:79:7
         return '#2196f3';
       case 'completed':
         return '#4caf50';
-      case 'cancelled':
-        return '#f44336';
+      case 'cancelled':
       default:
         return '#9e9e9e';
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#f44336"
Received: "#9e9e9e"

[Killed] ConditionalExpression
orders/components/orders-page/orders-page.ts:81:7
         return '#4caf50';
       case 'cancelled':
         return '#f44336';
-      default:
-        return '#9e9e9e';
+      default:
     }
   }
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#9e9e9e"
Received: undefined

[Killed] StringLiteral
orders/components/orders-page/orders-page.ts:82:16
       case 'cancelled':
         return '#f44336';
       default:
-        return '#9e9e9e';
+        return "";
     }
   }
killedBy: OrdersPage should return correct status colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#9e9e9e"
Received: ""
