[Killed] StringLiteral
app/features/orders/order.service.ts:31:32
 })
 export class OrderService {
   private readonly http = inject(HttpClient);
-  private readonly ordersUrl = 'api/orders';
+  private readonly ordersUrl = "";
 
   getOrders(): Observable<OrderResponse[]> {
killedBy: OrdersPage should load orders on init
statusReason: Error: Expected one matching request for criteria "Match URL: api/orders", found none. Requests received are: GET .

[Killed] BlockStatement
app/features/orders/order.service.ts:33:44
   private readonly http = inject(HttpClient);
   private readonly ordersUrl = 'api/orders';
 
-  getOrders(): Observable<OrderResponse[]> {
-    return this.http.get<OrderResponse[]>(this.ordersUrl);
-  }
+  getOrders(): Observable<OrderResponse[]> {}
 
   getOrder(id: number): Observable<OrderResponse> {
killedBy: OrdersPage should load orders on init
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
app/features/orders/order.service.ts:37:51
     return this.http.get<OrderResponse[]>(this.ordersUrl);
   }
 
-  getOrder(id: number): Observable<OrderResponse> {
-    return this.http.get<OrderResponse>(`${this.ordersUrl}/${id}`);
-  }
+  getOrder(id: number): Observable<OrderResponse> {}
 
   createOrder(request: OrderRequest): Observable<OrderResponse> {
killedBy: OrderService getOrder should GET from api/orders/{id} and return a single order
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
app/features/orders/order.service.ts:38:41
   }
 
   getOrder(id: number): Observable<OrderResponse> {
-    return this.http.get<OrderResponse>(`${this.ordersUrl}/${id}`);
+    return this.http.get<OrderResponse>(``);
   }
 
killedBy: OrderService getOrder should GET from api/orders/{id} and return a single order
statusReason: Error: Expected one matching request for criteria "Match URL: api/orders/1", found none. Requests received are: GET .

[Killed] BlockStatement
app/features/orders/order.service.ts:41:65
     return this.http.get<OrderResponse>(`${this.ordersUrl}/${id}`);
   }
 
-  createOrder(request: OrderRequest): Observable<OrderResponse> {
-    return this.http.post<OrderResponse>(this.ordersUrl, request);
-  }
+  createOrder(request: OrderRequest): Observable<OrderResponse> {}
 }
 
killedBy: OrderService createOrder should POST to api/orders and return the created order
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
