[Survived] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:52:20
   private snackBar = inject(MatSnackBar);
 
   product = signal<Product | null>(null);
-  loading = signal(true);
+  loading = signal(false);
   error = signal<string | null>(null);
   reviews = signal<Review[]>([]);

[Survived] StringLiteral
products/components/product-detail-page/product-detail-page.ts:59:37
 
   // Review form
   newRating = signal(0);
-  newTitleControl = new FormControl('', [Validators.required, Validators.maxLength(100)]);
+  newTitleControl = new FormControl("Stryker was here!", [Validators.required, Validators.maxLength(100)]);
   newCommentControl = new FormControl('', [Validators.required, Validators.maxLength(500)]);
   submittingReview = signal(false);

[Survived] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:61:29
   newRating = signal(0);
   newTitleControl = new FormControl('', [Validators.required, Validators.maxLength(100)]);
   newCommentControl = new FormControl('', [Validators.required, Validators.maxLength(500)]);
-  submittingReview = signal(false);
+  submittingReview = signal(true);
 
   ngOnInit() {

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:63:14
   newCommentControl = new FormControl('', [Validators.required, Validators.maxLength(500)]);
   submittingReview = signal(false);
 
-  ngOnInit() {
-    const id = Number(this.route.snapshot.paramMap.get('id'));
-    if (!id) {
-      this.error.set('Invalid product ID');
-      this.loading.set(false);
-      return;
-    }
-    this.loadProduct(id);
-  }
+  ngOnInit() {}
 
   loadProduct(id: number) {
killedBy: ProductDetailPage should load product on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] StringLiteral
products/components/product-detail-page/product-detail-page.ts:64:56
   submittingReview = signal(false);
 
   ngOnInit() {
-    const id = Number(this.route.snapshot.paramMap.get('id'));
+    const id = Number(this.route.snapshot.paramMap.get(""));
     if (!id) {
       this.error.set('Invalid product ID');
killedBy: ProductDetailPage should load product on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:65:14
 
   ngOnInit() {
     const id = Number(this.route.snapshot.paramMap.get('id'));
-    if (!id) {
-      this.error.set('Invalid product ID');
-      this.loading.set(false);
-      return;
-    }
+    if (!id) {}
     this.loadProduct(id);
   }
killedBy: ProductDetailPage should set error on invalid product ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid product ID"
Received: null

[Killed] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:65:9
 
   ngOnInit() {
     const id = Number(this.route.snapshot.paramMap.get('id'));
-    if (!id) {
+    if (id) {
       this.error.set('Invalid product ID');
       this.loading.set(false);
killedBy: ProductDetailPage should load product on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:67:24
     const id = Number(this.route.snapshot.paramMap.get('id'));
     if (!id) {
       this.error.set('Invalid product ID');
-      this.loading.set(false);
+      this.loading.set(true);
       return;
     }
killedBy: ProductDetailPage should set error on invalid product ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:73:27
     this.loadProduct(id);
   }
 
-  loadProduct(id: number) {
-    this.loading.set(true);
-    this.error.set(null);
-
-    this.productService.loadProductById(id).subscribe({
-      next: product => {
-        this.product.set(product);
-        this.reviews.set(this.reviewsService.getProductReviews(id));
-        this.loading.set(false);
-      },
-      error: () => {
-        this.error.set('Failed to load product details');
-        this.loading.set(false);
-      },
-    });
-  }
+  loadProduct(id: number) {}
 
   selectImage(index: number) {
killedBy: ProductDetailPage should load product on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Survived] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:74:22
   }
 
   loadProduct(id: number) {
-    this.loading.set(true);
+    this.loading.set(false);
     this.error.set(null);
 

[Killed] ObjectLiteral
products/components/product-detail-page/product-detail-page.ts:77:55
     this.loading.set(true);
     this.error.set(null);
 
-    this.productService.loadProductById(id).subscribe({
-      next: product => {
-        this.product.set(product);
-        this.reviews.set(this.reviewsService.getProductReviews(id));
-        this.loading.set(false);
-      },
-      error: () => {
-        this.error.set('Failed to load product details');
-        this.loading.set(false);
-      },
-    });
+    this.productService.loadProductById(id).subscribe({});
   }
 
killedBy: ProductDetailPage should load product on init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:78:24
     this.error.set(null);
 
     this.productService.loadProductById(id).subscribe({
-      next: product => {
-        this.product.set(product);
-        this.reviews.set(this.reviewsService.getProductReviews(id));
-        this.loading.set(false);
-      },
+      next: product => {},
       error: () => {
         this.error.set('Failed to load product details');
killedBy: ProductDetailPage should load product on init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:81:26
       next: product => {
         this.product.set(product);
         this.reviews.set(this.reviewsService.getProductReviews(id));
-        this.loading.set(false);
+        this.loading.set(true);
       },
       error: () => {
killedBy: ProductDetailPage should load product on init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:83:20
         this.reviews.set(this.reviewsService.getProductReviews(id));
         this.loading.set(false);
       },
-      error: () => {
-        this.error.set('Failed to load product details');
-        this.loading.set(false);
-      },
+      error: () => {},
     });
   }
killedBy: ProductDetailPage should handle product loading error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to load product details"
Received: null

[Killed] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:85:26
       },
       error: () => {
         this.error.set('Failed to load product details');
-        this.loading.set(false);
+        this.loading.set(true);
       },
     });
killedBy: ProductDetailPage should handle product loading error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:90:30
     });
   }
 
-  selectImage(index: number) {
-    this.selectedImageIndex.set(index);
-  }
+  selectImage(index: number) {}
 
   getImages(): string[] {
killedBy: ProductDetailPage should select image
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:94:25
     this.selectedImageIndex.set(index);
   }
 
-  getImages(): string[] {
-    const p = this.product();
-    if (!p || !p.image) return [];
-
-    const base = p.image;
-    return [
-      base,
-      this.variantUrl(base, 'angle'),
-      this.variantUrl(base, 'detail'),
-      this.variantUrl(base, 'packaging'),
-    ];
-  }
+  getImages(): string[] {}
 
   private variantUrl(base: string, variant: string): string {
killedBy: ProductDetailPage should create
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
products/components/product-detail-page/product-detail-page.ts:96:9
 
   getImages(): string[] {
     const p = this.product();
-    if (!p || !p.image) return [];
+    if (false) return [];
 
     const base = p.image;
killedBy: ProductDetailPage should return empty images array when no product
statusReason: TypeError: Cannot read properties of null (reading 'image')

[Killed] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:96:15
 
   getImages(): string[] {
     const p = this.product();
-    if (!p || !p.image) return [];
+    if (!p || p.image) return [];
 
     const base = p.image;
killedBy: ProductDetailPage should return multiple image URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Survived] StringLiteral
products/components/product-detail-page/product-detail-page.ts:103:29
       base,
       this.variantUrl(base, 'angle'),
       this.variantUrl(base, 'detail'),
-      this.variantUrl(base, 'packaging'),
+      this.variantUrl(base, ""),
     ];
   }

[Survived] BlockStatement
products/components/product-detail-page/product-detail-page.ts:107:61
     ];
   }
 
-  private variantUrl(base: string, variant: string): string {
-    const url = new URL(base);
-    url.searchParams.set('variant', variant);
-    return url.toString();
-  }
+  private variantUrl(base: string, variant: string): string {}
 
   addToCart(): void {

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:113:21
     return url.toString();
   }
 
-  addToCart(): void {
-    const p = this.product();
-    if (!p) return;
-    this.cartService.addToCart(p, 1);
-    this.snackBar.open(`Added ${p.title} to cart!`, 'Close', { duration: 3000 });
-  }
+  addToCart(): void {}
 
   submitReview(): void {
killedBy: ProductDetailPage should add product to cart
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"category": "Electronics", "description": "High-performance laptop", "id": 1, "image": "https://placehold.co/400x300", "price": 999.99, "rating": {"count": 120, "rate": 4.5}, "title": "Laptop"}, 1

Number of calls: 0

[Killed] ConditionalExpression
products/components/product-detail-page/product-detail-page.ts:115:9
 
   addToCart(): void {
     const p = this.product();
-    if (!p) return;
+    if (false) return;
     this.cartService.addToCart(p, 1);
     this.snackBar.open(`Added ${p.title} to cart!`, 'Close', { duration: 3000 });
killedBy: ProductDetailPage should not add to cart if no product
statusReason: TypeError: Cannot read properties of null (reading 'title')

[Killed] ConditionalExpression
products/components/product-detail-page/product-detail-page.ts:115:9
 
   addToCart(): void {
     const p = this.product();
-    if (!p) return;
+    if (true) return;
     this.cartService.addToCart(p, 1);
     this.snackBar.open(`Added ${p.title} to cart!`, 'Close', { duration: 3000 });
killedBy: ProductDetailPage should add product to cart
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"category": "Electronics", "description": "High-performance laptop", "id": 1, "image": "https://placehold.co/400x300", "price": 999.99, "rating": {"count": 120, "rate": 4.5}, "title": "Laptop"}, 1

Number of calls: 0

[Survived] StringLiteral
products/components/product-detail-page/product-detail-page.ts:117:24
     const p = this.product();
     if (!p) return;
     this.cartService.addToCart(p, 1);
-    this.snackBar.open(`Added ${p.title} to cart!`, 'Close', { duration: 3000 });
+    this.snackBar.open(``, 'Close', { duration: 3000 });
   }
 

[Survived] ObjectLiteral
products/components/product-detail-page/product-detail-page.ts:117:62
     const p = this.product();
     if (!p) return;
     this.cartService.addToCart(p, 1);
-    this.snackBar.open(`Added ${p.title} to cart!`, 'Close', { duration: 3000 });
+    this.snackBar.open(`Added ${p.title} to cart!`, 'Close', {});
   }
 

[Killed] ConditionalExpression
products/components/product-detail-page/product-detail-page.ts:123:7
   submitReview(): void {
     const p = this.product();
     if (
-      !p ||
-      !this.newTitleControl.value ||
-      !this.newCommentControl.value ||
-      this.newRating() === 0
+      true
     ) {
       this.snackBar.open('Please fill in all review fields', 'Close', { duration: 3000 });
killedBy: ProductDetailPage should submit a review
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"author": "Customer", "comment": "Really good", "productId": 1, "rating": 5, "title": "Great product"}

Number of calls: 0

[Killed] ConditionalExpression
products/components/product-detail-page/product-detail-page.ts:123:7
   submitReview(): void {
     const p = this.product();
     if (
-      !p ||
-      !this.newTitleControl.value ||
-      !this.newCommentControl.value ||
-      this.newRating() === 0
+      false
     ) {
       this.snackBar.open('Please fill in all review fields', 'Close', { duration: 3000 });
killedBy: ProductDetailPage should not submit review if fields missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"author": "Customer", "comment": "", "productId": 1, "rating": 0, "title": ""}

[Killed] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:124:7
     const p = this.product();
     if (
       !p ||
-      !this.newTitleControl.value ||
+      this.newTitleControl.value ||
       !this.newCommentControl.value ||
       this.newRating() === 0
killedBy: ProductDetailPage should submit a review
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"author": "Customer", "comment": "Really good", "productId": 1, "rating": 5, "title": "Great product"}

Number of calls: 0

[Killed] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:125:7
     if (
       !p ||
       !this.newTitleControl.value ||
-      !this.newCommentControl.value ||
+      this.newCommentControl.value ||
       this.newRating() === 0
     ) {
killedBy: ProductDetailPage should submit a review
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"author": "Customer", "comment": "Really good", "productId": 1, "rating": 5, "title": "Great product"}

Number of calls: 0

[Killed] EqualityOperator
products/components/product-detail-page/product-detail-page.ts:126:7
       !p ||
       !this.newTitleControl.value ||
       !this.newCommentControl.value ||
-      this.newRating() === 0
+      this.newRating() !== 0
     ) {
       this.snackBar.open('Please fill in all review fields', 'Close', { duration: 3000 });
killedBy: ProductDetailPage should submit a review
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"author": "Customer", "comment": "Really good", "productId": 1, "rating": 5, "title": "Great product"}

Number of calls: 0

[Survived] ConditionalExpression
products/components/product-detail-page/product-detail-page.ts:126:7
       !p ||
       !this.newTitleControl.value ||
       !this.newCommentControl.value ||
-      this.newRating() === 0
+      false
     ) {
       this.snackBar.open('Please fill in all review fields', 'Close', { duration: 3000 });

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:127:7
       !this.newTitleControl.value ||
       !this.newCommentControl.value ||
       this.newRating() === 0
-    ) {
-      this.snackBar.open('Please fill in all review fields', 'Close', { duration: 3000 });
-      return;
-    }
+    ) {}
 
     this.submittingReview.set(true);
killedBy: ProductDetailPage should not submit review if fields missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"author": "Customer", "comment": "", "productId": 1, "rating": 0, "title": ""}

[Killed] StringLiteral
products/components/product-detail-page/product-detail-page.ts:128:62
       !this.newCommentControl.value ||
       this.newRating() === 0
     ) {
-      this.snackBar.open('Please fill in all review fields', 'Close', { duration: 3000 });
+      this.snackBar.open('Please fill in all review fields', "", { duration: 3000 });
       return;
     }
killedBy: ProductDetailPage should not submit review if fields missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Please fill in all review fields",
- "Close",
+ "",

[Survived] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:132:31
       return;
     }
 
-    this.submittingReview.set(true);
+    this.submittingReview.set(false);
     this.reviewsService.addReview({
       productId: p.id,

[Survived] BooleanLiteral
products/components/product-detail-page/product-detail-page.ts:144:31
     this.newRating.set(0);
     this.newTitleControl.setValue('');
     this.newCommentControl.setValue('');
-    this.submittingReview.set(false);
+    this.submittingReview.set(true);
     this.snackBar.open('Review submitted!', 'Close', { duration: 3000 });
   }

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:148:18
     this.snackBar.open('Review submitted!', 'Close', { duration: 3000 });
   }
 
-  goBack(): void {
-    this.router.navigate(['/shop/products']);
-  }
+  goBack(): void {}
 
   formatReviewDate(iso: string): string {
killedBy: ProductDetailPage should navigate back when goBack is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/shop/products"]

Number of calls: 0

[Killed] ArrayDeclaration
products/components/product-detail-page/product-detail-page.ts:149:26
   }
 
   goBack(): void {
-    this.router.navigate(['/shop/products']);
+    this.router.navigate([]);
   }
 
killedBy: ProductDetailPage should navigate back when goBack is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/shop/products",
- ]

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:152:41
     this.router.navigate(['/shop/products']);
   }
 
-  formatReviewDate(iso: string): string {
-    return new Date(iso).toLocaleDateString('en-GB', {
-      year: 'numeric',
-      month: 'short',
-      day: 'numeric',
-    });
-  }
+  formatReviewDate(iso: string): string {}
 
   getStars(rating: number): number[] {
killedBy: ProductDetailPage should format review date
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
products/components/product-detail-page/product-detail-page.ts:153:54
   }
 
   formatReviewDate(iso: string): string {
-    return new Date(iso).toLocaleDateString('en-GB', {
-      year: 'numeric',
-      month: 'short',
-      day: 'numeric',
-    });
+    return new Date(iso).toLocaleDateString('en-GB', {});
   }
 
killedBy: ProductDetailPage should format review date
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Jun"
Received string:    "23/06/2026"

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:160:38
     });
   }
 
-  getStars(rating: number): number[] {
-    const rounded = Math.round(rating);
-    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n <= rounded);
-  }
+  getStars(rating: number): number[] {}
 
   getEmptyStars(rating: number): number[] {
killedBy: ProductDetailPage should get stars for a rating
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
products/components/product-detail-page/product-detail-page.ts:162:67
 
   getStars(rating: number): number[] {
     const rounded = Math.round(rating);
-    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n <= rounded);
+    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n < rounded);
   }
 
killedBy: ProductDetailPage should get stars for a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] ConditionalExpression
products/components/product-detail-page/product-detail-page.ts:162:67
 
   getStars(rating: number): number[] {
     const rounded = Math.round(rating);
-    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n <= rounded);
+    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => false);
   }
 
killedBy: ProductDetailPage should get stars for a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
products/components/product-detail-page/product-detail-page.ts:165:43
     return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n <= rounded);
   }
 
-  getEmptyStars(rating: number): number[] {
-    const rounded = Math.round(rating);
-    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n > rounded);
-  }
+  getEmptyStars(rating: number): number[] {}
 
   getRatingStars(rating: number): number[] {
killedBy: ProductDetailPage should get empty stars for a rating
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
products/components/product-detail-page/product-detail-page.ts:167:62
 
   getEmptyStars(rating: number): number[] {
     const rounded = Math.round(rating);
-    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n > rounded);
+    return Array.from({ length: 5 }, (_, i) => i + 1).filter(() => undefined);
   }
 
killedBy: ProductDetailPage should get empty stars for a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArrowFunction
products/components/product-detail-page/product-detail-page.ts:167:38
 
   getEmptyStars(rating: number): number[] {
     const rounded = Math.round(rating);
-    return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n > rounded);
+    return Array.from({ length: 5 }, () => undefined).filter(n => n > rounded);
   }
 
killedBy: ProductDetailPage should get empty stars for a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Survived] BlockStatement
products/components/product-detail-page/product-detail-page.ts:170:44
     return Array.from({ length: 5 }, (_, i) => i + 1).filter(n => n > rounded);
   }
 
-  getRatingStars(rating: number): number[] {
-    return this.getStars(rating);
-  }
+  getRatingStars(rating: number): number[] {}
 
   getRatingEmptyStars(rating: number): number[] {

[Survived] BlockStatement
products/components/product-detail-page/product-detail-page.ts:174:49
     return this.getStars(rating);
   }
 
-  getRatingEmptyStars(rating: number): number[] {
-    return this.getEmptyStars(rating);
-  }
+  getRatingEmptyStars(rating: number): number[] {}
 }
 
