[Killed] BlockStatement
products/components/products-page/products-page.ts:60:37
     return product.id;
   }
 
-  addToCart(product: Product): void {
-    this.cartService.addToCart(product, 1);
-    this.snackBar.open(`Added ${product.title} to cart!`, 'Close', { duration: 3000 });
-  }
+  addToCart(product: Product): void {}
 }
 
killedBy: ProductsPage should add product to cart via CartService
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"category": "Test Category", "description": "Test Description", "id": 1, "image": "https://example.com/image.jpg", "price": 10.99, "rating": {"count": 10, "rate": 4.5}, "title": "Test Product"}, 1

Number of calls: 0
