[Killed] BlockStatement
app/features/products/product.service.ts:17:52
     return this.http.get<Product[]>(this.productsUrl);
   }
 
-  loadProductById(id: number): Observable<Product> {
-    return this.http.get<Product>(`${this.productsUrl}/${id}`);
-  }
+  loadProductById(id: number): Observable<Product> {}
 }
 
killedBy: ProductService should load a single product by id
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
app/features/products/product.service.ts:18:35
   }
 
   loadProductById(id: number): Observable<Product> {
-    return this.http.get<Product>(`${this.productsUrl}/${id}`);
+    return this.http.get<Product>(``);
   }
 }
killedBy: ProductService should load a single product by id
statusReason: Error: Expected one matching request for criteria "Match URL: api/products/1", found none. Requests received are: GET .
