[Killed] ArrayDeclaration
app/features/products/reviews.service.ts:10:38
   providedIn: 'root',
 })
 export class ReviewsService {
-  private reviews = signal<Review[]>([]);
+  private reviews = signal<Review[]>(["Stryker was here"]);
 
   reviews$ = this.reviews.asReadonly();
killedBy: ReviewsService should add a review with auto-generated id and createdAt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] BlockStatement
app/features/products/reviews.service.ts:18:27
     this.restoreFromStorage();
   }
 
-  private persist(): void {
-    try {
-      localStorage.setItem(REVIEWS_STORAGE_KEY, JSON.stringify(this.reviews()));
-    } catch {
-      // Silently fail
-    }
-  }
+  private persist(): void {}
 
   private restoreFromStorage(): void {
killedBy: ReviewsService should persist reviews to localStorage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
app/features/products/reviews.service.ts:19:9
   }
 
   private persist(): void {
-    try {
-      localStorage.setItem(REVIEWS_STORAGE_KEY, JSON.stringify(this.reviews()));
-    } catch {
+    try {} catch {
       // Silently fail
     }
killedBy: ReviewsService should persist reviews to localStorage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
app/features/products/reviews.service.ts:26:38
     }
   }
 
-  private restoreFromStorage(): void {
-    try {
-      const stored = localStorage.getItem(REVIEWS_STORAGE_KEY);
-      if (stored) {
-        this.reviews.set(JSON.parse(stored));
-      }
-    } catch {
-      // Silently fail
-    }
-  }
+  private restoreFromStorage(): void {}
 
   getProductReviews(productId: number): Review[] {
killedBy: ReviewsService should restore reviews from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/products/reviews.service.ts:27:9
   }
 
   private restoreFromStorage(): void {
-    try {
-      const stored = localStorage.getItem(REVIEWS_STORAGE_KEY);
-      if (stored) {
-        this.reviews.set(JSON.parse(stored));
-      }
-    } catch {
+    try {} catch {
       // Silently fail
     }
killedBy: ReviewsService should restore reviews from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/products/reviews.service.ts:29:19
   private restoreFromStorage(): void {
     try {
       const stored = localStorage.getItem(REVIEWS_STORAGE_KEY);
-      if (stored) {
-        this.reviews.set(JSON.parse(stored));
-      }
+      if (stored) {}
     } catch {
       // Silently fail
killedBy: ReviewsService should restore reviews from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
app/features/products/reviews.service.ts:29:11
   private restoreFromStorage(): void {
     try {
       const stored = localStorage.getItem(REVIEWS_STORAGE_KEY);
-      if (stored) {
+      if (false) {
         this.reviews.set(JSON.parse(stored));
       }
killedBy: ReviewsService should restore reviews from localStorage on construction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/products/reviews.service.ts:37:50
     }
   }
 
-  getProductReviews(productId: number): Review[] {
-    return this.reviews().filter(r => r.productId === productId);
-  }
+  getProductReviews(productId: number): Review[] {}
 
   addReview(review: Omit<Review, 'id' | 'createdAt'>): void {
killedBy: ReviewsService should return empty reviews for unknown product
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrowFunction
app/features/products/reviews.service.ts:38:34
   }
 
   getProductReviews(productId: number): Review[] {
-    return this.reviews().filter(r => r.productId === productId);
+    return this.reviews().filter(() => undefined);
   }
 
killedBy: ReviewsService should add a review with auto-generated id and createdAt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
app/features/products/reviews.service.ts:38:39
   }
 
   getProductReviews(productId: number): Review[] {
-    return this.reviews().filter(r => r.productId === productId);
+    return this.reviews().filter(r => false);
   }
 
killedBy: ReviewsService should add a review with auto-generated id and createdAt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/features/products/reviews.service.ts:41:61
     return this.reviews().filter(r => r.productId === productId);
   }
 
-  addReview(review: Omit<Review, 'id' | 'createdAt'>): void {
-    const maxId = this.reviews().reduce((max, r) => Math.max(max, r.id), 0);
-    const newReview: Review = {
-      ...review,
-      id: maxId + 1,
-      createdAt: new Date().toISOString(),
-    };
-    this.reviews.update(reviews => [...reviews, newReview]);
-    this.persist();
-  }
+  addReview(review: Omit<Review, 'id' | 'createdAt'>): void {}
 }
 
killedBy: ReviewsService should add a review with auto-generated id and createdAt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
app/features/products/reviews.service.ts:42:53
   }
 
   addReview(review: Omit<Review, 'id' | 'createdAt'>): void {
-    const maxId = this.reviews().reduce((max, r) => Math.max(max, r.id), 0);
+    const maxId = this.reviews().reduce((max, r) => Math.min(max, r.id), 0);
     const newReview: Review = {
       ...review,
killedBy: ReviewsService should increment id for each new review
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArrowFunction
app/features/products/reviews.service.ts:42:41
   }
 
   addReview(review: Omit<Review, 'id' | 'createdAt'>): void {
-    const maxId = this.reviews().reduce((max, r) => Math.max(max, r.id), 0);
+    const maxId = this.reviews().reduce(() => undefined, 0);
     const newReview: Review = {
       ...review,
killedBy: ReviewsService should increment id for each new review
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] ArithmeticOperator
app/features/products/reviews.service.ts:45:11
     const maxId = this.reviews().reduce((max, r) => Math.max(max, r.id), 0);
     const newReview: Review = {
       ...review,
-      id: maxId + 1,
+      id: maxId - 1,
       createdAt: new Date().toISOString(),
     };
killedBy: ReviewsService should add a review with auto-generated id and createdAt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ArrowFunction
app/features/products/reviews.service.ts:48:25
       id: maxId + 1,
       createdAt: new Date().toISOString(),
     };
-    this.reviews.update(reviews => [...reviews, newReview]);
+    this.reviews.update(() => undefined);
     this.persist();
   }
killedBy: ReviewsService should add a review with auto-generated id and createdAt
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ArrayDeclaration
app/features/products/reviews.service.ts:48:36
       id: maxId + 1,
       createdAt: new Date().toISOString(),
     };
-    this.reviews.update(reviews => [...reviews, newReview]);
+    this.reviews.update(reviews => []);
     this.persist();
   }
killedBy: ReviewsService should add a review with auto-generated id and createdAt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
