[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:34:31
   private _subs: { unsubscribe(): void }[] = [];
   private pendingService = inject(PendingChangesService);
 
-  firstName = new FormControl(this.data.user?.firstName ?? '', {
+  firstName = new FormControl(this.data.user?.firstName && '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: UserDialog should initialize firstName with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Killed] OptionalChaining
users/components/user-dialog/user-dialog.ts:34:31
   private _subs: { unsubscribe(): void }[] = [];
   private pendingService = inject(PendingChangesService);
 
-  firstName = new FormControl(this.data.user?.firstName ?? '', {
+  firstName = new FormControl(this.data.user.firstName ?? '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: UserDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'firstName')

[Survived] BooleanLiteral
users/components/user-dialog/user-dialog.ts:35:18
   private pendingService = inject(PendingChangesService);
 
   firstName = new FormControl(this.data.user?.firstName ?? '', {
-    nonNullable: true,
+    nonNullable: false,
     validators: Validators.required,
   });

[Killed] OptionalChaining
users/components/user-dialog/user-dialog.ts:39:30
     validators: Validators.required,
   });
 
-  lastName = new FormControl(this.data.user?.lastName ?? '', {
+  lastName = new FormControl(this.data.user.lastName ?? '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: UserDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'lastName')

[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:39:30
     validators: Validators.required,
   });
 
-  lastName = new FormControl(this.data.user?.lastName ?? '', {
+  lastName = new FormControl(this.data.user?.lastName && '', {
     nonNullable: true,
     validators: Validators.required,
killedBy: UserDialog should initialize lastName with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Survived] BooleanLiteral
users/components/user-dialog/user-dialog.ts:40:18
   });
 
   lastName = new FormControl(this.data.user?.lastName ?? '', {
-    nonNullable: true,
+    nonNullable: false,
     validators: Validators.required,
   });

[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:44:27
     validators: Validators.required,
   });
 
-  email = new FormControl(this.data.user?.email ?? '', {
+  email = new FormControl(this.data.user?.email && '', {
     nonNullable: true,
     validators: [Validators.required, Validators.email],
killedBy: UserDialog should initialize email with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Killed] OptionalChaining
users/components/user-dialog/user-dialog.ts:44:27
     validators: Validators.required,
   });
 
-  email = new FormControl(this.data.user?.email ?? '', {
+  email = new FormControl(this.data.user.email ?? '', {
     nonNullable: true,
     validators: [Validators.required, Validators.email],
killedBy: UserDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Survived] BooleanLiteral
users/components/user-dialog/user-dialog.ts:45:18
   });
 
   email = new FormControl(this.data.user?.email ?? '', {
-    nonNullable: true,
+    nonNullable: false,
     validators: [Validators.required, Validators.email],
   });

[Killed] ArrayDeclaration
users/components/user-dialog/user-dialog.ts:46:17
 
   email = new FormControl(this.data.user?.email ?? '', {
     nonNullable: true,
-    validators: [Validators.required, Validators.email],
+    validators: [],
   });
 
killedBy: UserDialog should be invalid when email is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] OptionalChaining
users/components/user-dialog/user-dialog.ts:49:33
     validators: [Validators.required, Validators.email],
   });
 
-  phoneNumber = new FormControl(this.data.user?.phoneNumber ?? '', {
+  phoneNumber = new FormControl(this.data.user.phoneNumber ?? '', {
     nonNullable: true,
   });
killedBy: UserDialog should create
statusReason: TypeError: Cannot read properties of undefined (reading 'phoneNumber')

[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:49:33
     validators: [Validators.required, Validators.email],
   });
 
-  phoneNumber = new FormControl(this.data.user?.phoneNumber ?? '', {
+  phoneNumber = new FormControl(this.data.user?.phoneNumber && '', {
     nonNullable: true,
   });
killedBy: UserDialog should initialize phoneNumber with empty value in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Survived] BooleanLiteral
users/components/user-dialog/user-dialog.ts:50:18
   });
 
   phoneNumber = new FormControl(this.data.user?.phoneNumber ?? '', {
-    nonNullable: true,
+    nonNullable: false,
   });
 

[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:54:14
   });
 
   isActive = new FormControl(
-    { value: this.data.user?.isActive ?? true, disabled: this.data.mode === DialogMode.View },
+    { value: this.data.user?.isActive && true, disabled: this.data.mode === DialogMode.View },
     {
       nonNullable: true,
killedBy: UserDialog should initialize isActive with true in Add mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
users/components/user-dialog/user-dialog.ts:54:58
   });
 
   isActive = new FormControl(
-    { value: this.data.user?.isActive ?? true, disabled: this.data.mode === DialogMode.View },
+    { value: this.data.user?.isActive ?? true, disabled: this.data.mode !== DialogMode.View },
     {
       nonNullable: true,
killedBy: UserDialog Edit Mode should not disable controls in Edit mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
users/components/user-dialog/user-dialog.ts:60:14
     }
   );
 
-  ngOnInit() {
-    if (this.data.mode === DialogMode.View) {
-      this.firstName.disable();
-      this.lastName.disable();
-      this.email.disable();
-      this.isActive.disable();
-      this.phoneNumber.disable();
-    }
-    // Initially allow close; prevent when dirty
-    this.dialogRef.disableClose = false;
-
-    const markDisable = () => {
-      const anyDirty =
-        this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
-      this.dialogRef.disableClose = anyDirty;
-      this.pendingService.setPending(anyDirty);
-    };
-
-    // subscribe to value changes to update disableClose and pending state
-    this._subs.push(this.firstName.valueChanges.subscribe(markDisable));
-    this._subs.push(this.lastName.valueChanges.subscribe(markDisable));
-    this._subs.push(this.email.valueChanges.subscribe(markDisable));
-    this._subs.push(this.isActive.valueChanges.subscribe(markDisable));
-  }
+  ngOnInit() {}
 
   isValid(): boolean {
killedBy: UserDialog should set disableClose on field changes via valueChanges
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
users/components/user-dialog/user-dialog.ts:61:45
   );
 
   ngOnInit() {
-    if (this.data.mode === DialogMode.View) {
-      this.firstName.disable();
-      this.lastName.disable();
-      this.email.disable();
-      this.isActive.disable();
-      this.phoneNumber.disable();
-    }
+    if (this.data.mode === DialogMode.View) {}
     // Initially allow close; prevent when dirty
     this.dialogRef.disableClose = false;
killedBy: UserDialog View Mode should disable all controls in View mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
users/components/user-dialog/user-dialog.ts:69:35
       this.phoneNumber.disable();
     }
     // Initially allow close; prevent when dirty
-    this.dialogRef.disableClose = false;
+    this.dialogRef.disableClose = true;
 
     const markDisable = () => {

[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:73:9
 
     const markDisable = () => {
       const anyDirty =
-        this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
+        this.firstName.dirty && this.lastName.dirty || this.email.dirty || this.isActive.dirty;
       this.dialogRef.disableClose = anyDirty;
       this.pendingService.setPending(anyDirty);
killedBy: UserDialog should set disableClose on field changes via valueChanges
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
users/components/user-dialog/user-dialog.ts:86:12
   }
 
   isValid(): boolean {
-    return this.firstName.valid && this.lastName.valid && this.email.valid;
+    return true && this.email.valid;
   }
 
killedBy: UserDialog should be invalid when firstName is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
users/components/user-dialog/user-dialog.ts:89:10
     return this.firstName.valid && this.lastName.valid && this.email.valid;
   }
 
-  save() {
-    if (!this.isValid()) {
-      return;
-    }
-
-    this.pendingService.clear();
-    this.dialogRef.close({
-      id: this.data.user?.id ?? 0,
-      firstName: this.firstName.value,
-      lastName: this.lastName.value,
-      email: this.email.value,
-      isActive: this.isActive.value,
-      phoneNumber: this.phoneNumber.value,
-    });
-  }
+  save() {}
 
   cancel() {
killedBy: UserDialog should close dialog with user data on save
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
users/components/user-dialog/user-dialog.ts:90:9
   }
 
   save() {
-    if (!this.isValid()) {
+    if (this.isValid()) {
       return;
     }
killedBy: UserDialog should close dialog with user data on save
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
users/components/user-dialog/user-dialog.ts:95:26
     }
 
     this.pendingService.clear();
-    this.dialogRef.close({
-      id: this.data.user?.id ?? 0,
-      firstName: this.firstName.value,
-      lastName: this.lastName.value,
-      email: this.email.value,
-      isActive: this.isActive.value,
-      phoneNumber: this.phoneNumber.value,
-    });
+    this.dialogRef.close({});
   }
 
killedBy: UserDialog should save user with correct data structure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "jane@test.com",
-   "firstName": "Jane",

[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:96:11
 
     this.pendingService.clear();
     this.dialogRef.close({
-      id: this.data.user?.id ?? 0,
+      id: this.data.user?.id && 0,
       firstName: this.firstName.value,
       lastName: this.lastName.value,
killedBy: UserDialog should save user with correct data structure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "email": "jane@test.com",
    "firstName": "Jane",

[Killed] OptionalChaining
users/components/user-dialog/user-dialog.ts:96:11
 
     this.pendingService.clear();
     this.dialogRef.close({
-      id: this.data.user?.id ?? 0,
+      id: this.data.user.id ?? 0,
       firstName: this.firstName.value,
       lastName: this.lastName.value,
killedBy: UserDialog should close dialog with user data on save
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
users/components/user-dialog/user-dialog.ts:116:12
 
   // Expose unsaved state for navigation guards
   hasUnsavedChanges(): boolean {
-    return this.firstName.dirty || this.lastName.dirty || this.email.dirty || this.isActive.dirty;
+    return (this.firstName.dirty || this.lastName.dirty || this.email.dirty) && this.isActive.dirty;
   }
 }
killedBy: UserDialog should check for unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
