[Killed] ObjectLiteral
users/components/users-table/users-table.ts:47:5
   private pendingService = inject(PendingChangesService);
 
   columns: ColumnDef[] = [
-    { key: 'id', label: 'Id' },
+    {},
     { key: 'firstName', label: 'First Name' },
     { key: 'lastName', label: 'Last Name' },
killedBy: UsersTable should create
statusReason: TypeError: columnDef._columnCssClassName is not iterable (cannot read property undefined)

[Killed] StringLiteral
users/components/users-table/users-table.ts:47:25
   private pendingService = inject(PendingChangesService);
 
   columns: ColumnDef[] = [
-    { key: 'id', label: 'Id' },
+    { key: 'id', label: "" },
     { key: 'firstName', label: 'First Name' },
     { key: 'lastName', label: 'Last Name' },
killedBy: UsersTable should have columns defined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Id"
Received: ""

[Killed] ObjectLiteral
users/components/users-table/users-table.ts:50:5
     { key: 'id', label: 'Id' },
     { key: 'firstName', label: 'First Name' },
     { key: 'lastName', label: 'Last Name' },
-    { key: 'email', label: 'Email' },
+    {},
     { key: 'phoneNumber', label: 'Phone Number' },
     { key: 'isActive', label: 'Active' },
killedBy: UsersTable should create
statusReason: TypeError: columnDef._columnCssClassName is not iterable (cannot read property undefined)

[Survived] StringLiteral
users/components/users-table/users-table.ts:52:31
     { key: 'lastName', label: 'Last Name' },
     { key: 'email', label: 'Email' },
     { key: 'phoneNumber', label: 'Phone Number' },
-    { key: 'isActive', label: 'Active' },
+    { key: 'isActive', label: "" },
   ];
 

[Killed] BooleanLiteral
users/components/users-table/users-table.ts:55:40
     { key: 'isActive', label: 'Active' },
   ];
 
-  selection = new SelectionModel<User>(true, []);
+  selection = new SelectionModel<User>(false, []);
   dataSource = new MatTableDataSource<User>();
   filterValue = '';
killedBy: UsersTable should not edit when multiple users selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [2, "edit"], {"relativeTo": {"snapshot": {"firstChild": null, "paramMap": {"get": [Function get]}, "url": []}}}

[Killed] BlockStatement
users/components/users-table/users-table.ts:72:39
     }
   });
 
-  readonly tableEffect = effect(() => {
-    this.dataSource.data = this.users();
-    this.changeDetectorRef.markForCheck();
-  });
+  readonly tableEffect = effect(() => {});
 
   readonly routeEffect = effect(() => {
killedBy: UsersTable should update dataSource.data when users signal changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "email": "john@example.com",

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:81:9
     const rs = this.routeState();
     const users = this.users();
 
-    if (untracked(() => this.dialogOpen())) return;
+    if (true) return;
 
     const { id, isNew, isEdit } = rs;
killedBy: UsersTable should trigger routeEffect isNew branch on NavigationEnd with /new url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "add"}}

Number of calls: 0

[Survived] ConditionalExpression
users/components/users-table/users-table.ts:81:9
     const rs = this.routeState();
     const users = this.users();
 
-    if (untracked(() => this.dialogOpen())) return;
+    if (false) return;
 
     const { id, isNew, isEdit } = rs;

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:85:9
 
     const { id, isNew, isEdit } = rs;
 
-    if (!users.length) return;
+    if (true) return;
 
     if (isNew) {
killedBy: UsersTable should trigger routeEffect isNew branch on NavigationEnd with /new url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "add"}}

Number of calls: 0

[Killed] BooleanLiteral
users/components/users-table/users-table.ts:85:9
 
     const { id, isNew, isEdit } = rs;
 
-    if (!users.length) return;
+    if (users.length) return;
 
     if (isNew) {
killedBy: UsersTable should trigger routeEffect isNew branch on NavigationEnd with /new url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "add"}}

Number of calls: 0

[Killed] BlockStatement
users/components/users-table/users-table.ts:90:45
     if (isNew) {
       this.dialogOpen.set(true);
       const ref = this.openAddDialog();
-      ref.afterClosed().subscribe(result => {
-        this.pendingService.clear();
-        this.pendingService.clearActiveDialog();
-        this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
-          this.dialogOpen.set(false);
-          if (result) this.userService.addUser(result);
-        });
-      });
+      ref.afterClosed().subscribe(result => {});
       return;
     }
killedBy: UsersTable should call addUser after dialog closes with result
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "new@test.com", "firstName": "New", "id": 2, "isActive": true, "lastName": "User", "phoneNumber": ""}

Number of calls: 0

[Killed] BlockStatement
users/components/users-table/users-table.ts:93:78
       ref.afterClosed().subscribe(result => {
         this.pendingService.clear();
         this.pendingService.clearActiveDialog();
-        this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
-          this.dialogOpen.set(false);
-          if (result) this.userService.addUser(result);
-        });
+        this.router.navigate(['../'], { relativeTo: this.route }).then(() => {});
       });
       return;
killedBy: UsersTable should call addUser after dialog closes with result
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "new@test.com", "firstName": "New", "id": 2, "isActive": true, "lastName": "User", "phoneNumber": ""}

Number of calls: 0

[Survived] ObjectLiteral
users/components/users-table/users-table.ts:93:39
       ref.afterClosed().subscribe(result => {
         this.pendingService.clear();
         this.pendingService.clearActiveDialog();
-        this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
+        this.router.navigate(['../'], {}).then(() => {
           this.dialogOpen.set(false);
           if (result) this.userService.addUser(result);

[Survived] BooleanLiteral
users/components/users-table/users-table.ts:94:31
         this.pendingService.clear();
         this.pendingService.clearActiveDialog();
         this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
-          this.dialogOpen.set(false);
+          this.dialogOpen.set(true);
           if (result) this.userService.addUser(result);
         });

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:95:15
         this.pendingService.clearActiveDialog();
         this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
           this.dialogOpen.set(false);
-          if (result) this.userService.addUser(result);
+          if (false) this.userService.addUser(result);
         });
       });
killedBy: UsersTable should call addUser after dialog closes with result
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "new@test.com", "firstName": "New", "id": 2, "isActive": true, "lastName": "User", "phoneNumber": ""}

Number of calls: 0

[Survived] ConditionalExpression
users/components/users-table/users-table.ts:95:15
         this.pendingService.clearActiveDialog();
         this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
           this.dialogOpen.set(false);
-          if (result) this.userService.addUser(result);
+          if (true) this.userService.addUser(result);
         });
       });

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:103:34
 
     if (!id) return;
 
-    const user = users.find(u => u.id === +id);
+    const user = users.find(u => true);
     if (!user) return;
 
killedBy: UsersTable should not open dialog when user not found in routeEffect edit branch
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [Function UserDialog], {"closeOnNavigation": false, "data": {"mode": "edit", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}, "panelClass": "user-dialog"}

[Killed] UnaryOperator
users/components/users-table/users-table.ts:103:43
 
     if (!id) return;
 
-    const user = users.find(u => u.id === +id);
+    const user = users.find(u => u.id === -id);
     if (!user) return;
 
killedBy: UsersTable should trigger routeEffect view branch on NavigationEnd with /:id url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "view", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}}

Number of calls: 0

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:104:9
     if (!id) return;
 
     const user = users.find(u => u.id === +id);
-    if (!user) return;
+    if (true) return;
 
     this.dialogOpen.set(true);
killedBy: UsersTable should trigger routeEffect view branch on NavigationEnd with /:id url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "view", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}}

Number of calls: 0

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:104:9
     if (!id) return;
 
     const user = users.find(u => u.id === +id);
-    if (!user) return;
+    if (false) return;
 
     this.dialogOpen.set(true);
killedBy: UsersTable should not open dialog when user not found in routeEffect edit branch
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [Function UserDialog], {"closeOnNavigation": false, "data": {"mode": "edit", "user": undefined}, "panelClass": "user-dialog"}

[Killed] BlockStatement
users/components/users-table/users-table.ts:108:43
 
     this.dialogOpen.set(true);
     const ref = isEdit ? this.openEditDialog(user) : this.openViewDialog(user);
-    ref.afterClosed().subscribe(result => {
-      this.pendingService.clear();
-      this.pendingService.clearActiveDialog();
-      this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
-        this.dialogOpen.set(false);
-        if (isEdit && result) this.userService.updateUser(result);
-      });
-    });
+    ref.afterClosed().subscribe(result => {});
   });
 
killedBy: UsersTable should call updateUser after edit dialog closes with result
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "john@example.com", "firstName": "Updated", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}

Number of calls: 0

[Killed] BlockStatement
users/components/users-table/users-table.ts:111:76
     ref.afterClosed().subscribe(result => {
       this.pendingService.clear();
       this.pendingService.clearActiveDialog();
-      this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
-        this.dialogOpen.set(false);
-        if (isEdit && result) this.userService.updateUser(result);
-      });
+      this.router.navigate(['../'], { relativeTo: this.route }).then(() => {});
     });
   });
killedBy: UsersTable should call updateUser after edit dialog closes with result
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "john@example.com", "firstName": "Updated", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}

Number of calls: 0

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:113:13
       this.pendingService.clearActiveDialog();
       this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
         this.dialogOpen.set(false);
-        if (isEdit && result) this.userService.updateUser(result);
+        if (false) this.userService.updateUser(result);
       });
     });
killedBy: UsersTable should call updateUser after edit dialog closes with result
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "john@example.com", "firstName": "Updated", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}

Number of calls: 0

[Survived] ConditionalExpression
users/components/users-table/users-table.ts:113:13
       this.pendingService.clearActiveDialog();
       this.router.navigate(['../'], { relativeTo: this.route }).then(() => {
         this.dialogOpen.set(false);
-        if (isEdit && result) this.userService.updateUser(result);
+        if (true) this.userService.updateUser(result);
       });
     });

[Killed] StringLiteral
users/components/users-table/users-table.ts:133:38
       snapshot = snapshot.firstChild;
     }
 
-    const id = snapshot.paramMap.get('id');
+    const id = snapshot.paramMap.get("");
     const isNew = snapshot.url.some(s => s.path === 'new');
     const isEdit = snapshot.url.some(s => s.path === 'edit');
killedBy: UsersTable should trigger routeEffect view branch on NavigationEnd with /:id url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "view", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}}

Number of calls: 0

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:134:42
     }
 
     const id = snapshot.paramMap.get('id');
-    const isNew = snapshot.url.some(s => s.path === 'new');
+    const isNew = snapshot.url.some(s => false);
     const isEdit = snapshot.url.some(s => s.path === 'edit');
     return { id, isNew, isEdit };
killedBy: UsersTable should trigger routeEffect isNew branch on NavigationEnd with /new url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "add"}}

Number of calls: 0

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:135:43
 
     const id = snapshot.paramMap.get('id');
     const isNew = snapshot.url.some(s => s.path === 'new');
-    const isEdit = snapshot.url.some(s => s.path === 'edit');
+    const isEdit = snapshot.url.some(s => true);
     return { id, isNew, isEdit };
   }
killedBy: UsersTable should trigger routeEffect view branch on NavigationEnd with /:id url
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"data": ObjectContaining {"mode": "view", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}}
Received: [Function UserDialog], {"closeOnNavigation": false, "data": {"mode": "edit", "user": {"email": "joh

[Killed] BlockStatement
users/components/users-table/users-table.ts:139:14
     return { id, isNew, isEdit };
   }
 
-  ngOnInit() {
-    this.userService.loadUsers();
-  }
+  ngOnInit() {}
 
   openViewDialog(user: User) {
killedBy: UsersTable should load users on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
users/components/users-table/users-table.ts:143:30
     this.userService.loadUsers();
   }
 
-  openViewDialog(user: User) {
-    const ref = this.dialog.open(UserDialog, {
-      panelClass: ['user-dialog', 'mode-view'],
-      data: { mode: DialogMode.View, user },
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<UserDialog>;
-    this.pendingService.setActiveDialog(this.activeDialogRef);
-    ref.afterClosed().subscribe(() => {
-      this.activeDialogRef = null;
-      this.pendingService.clearActiveDialog();
-      this.pendingService.clear();
-    });
-    return ref as MatDialogRef<UserDialog>;
-  }
+  openViewDialog(user: User) {}
 
   openEditDialog(user: User) {
killedBy: UsersTable should call openViewDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] StringLiteral
users/components/users-table/users-table.ts:145:35
 
   openViewDialog(user: User) {
     const ref = this.dialog.open(UserDialog, {
-      panelClass: ['user-dialog', 'mode-view'],
+      panelClass: ['user-dialog', ""],
       data: { mode: DialogMode.View, user },
       closeOnNavigation: false,
killedBy: UsersTable should call openViewDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Received: [Function UserDialog], {"closeOnNavigation": false, "data": {"mode": "view", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}, "panelClass": ["user-dialog", ""]}

Number of calls: 1

[Killed] BooleanLiteral
users/components/users-table/users-table.ts:147:26
     const ref = this.dialog.open(UserDialog, {
       panelClass: ['user-dialog', 'mode-view'],
       data: { mode: DialogMode.View, user },
-      closeOnNavigation: false,
+      closeOnNavigation: true,
     });
 
killedBy: UsersTable should call openViewDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Received: [Function UserDialog], {"closeOnNavigation": true, "data": {"mode": "view", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}, "panelClass": ["user-dialog", "mode-view"]}

Number of calls: 1

[Killed] BlockStatement
users/components/users-table/users-table.ts:160:30
     return ref as MatDialogRef<UserDialog>;
   }
 
-  openEditDialog(user: User) {
-    const ref = this.dialog.open(UserDialog, {
-      data: { mode: DialogMode.Edit, user },
-      panelClass: 'user-dialog',
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<UserDialog>;
-    this.pendingService.setActiveDialog(this.activeDialogRef);
-    ref.afterClosed().subscribe(() => {
-      this.activeDialogRef = null;
-      this.pendingService.clearActiveDialog();
-      this.pendingService.clear();
-    });
-    return ref as MatDialogRef<UserDialog>;
-  }
+  openEditDialog(user: User) {}
 
   openAddDialog() {
killedBy: UsersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "edit", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}, "panelClass": "user-dialog"}

Number of calls: 0

[Killed] ObjectLiteral
users/components/users-table/users-table.ts:161:46
   }
 
   openEditDialog(user: User) {
-    const ref = this.dialog.open(UserDialog, {
-      data: { mode: DialogMode.Edit, user },
-      panelClass: 'user-dialog',
-      closeOnNavigation: false,
-    });
+    const ref = this.dialog.open(UserDialog, {});
 
     this.activeDialogRef = ref as MatDialogRef<UserDialog>;
killedBy: UsersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "edit", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}, "panelClass": "user-dialog"}
Received: [Function UserDialog], {}

Number of calls

[Killed] ObjectLiteral
users/components/users-table/users-table.ts:162:13
 
   openEditDialog(user: User) {
     const ref = this.dialog.open(UserDialog, {
-      data: { mode: DialogMode.Edit, user },
+      data: {},
       panelClass: 'user-dialog',
       closeOnNavigation: false,
killedBy: UsersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "edit", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}, "panelClass": "user-dialog"}
Received: [Function UserDialog], {"closeOnNavigation

[Killed] BooleanLiteral
users/components/users-table/users-table.ts:164:26
     const ref = this.dialog.open(UserDialog, {
       data: { mode: DialogMode.Edit, user },
       panelClass: 'user-dialog',
-      closeOnNavigation: false,
+      closeOnNavigation: true,
     });
 
killedBy: UsersTable should call openEditDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "edit", "user": {"email": "john@example.com", "firstName": "John", "id": 1, "isActive": true, "lastName": "Doe", "phoneNumber": "123-456-7890"}}, "panelClass": "user-dialog"}
Received: [Function UserDialog], {"closeOnNavigation

[Killed] BlockStatement
users/components/users-table/users-table.ts:177:19
     return ref as MatDialogRef<UserDialog>;
   }
 
-  openAddDialog() {
-    const ref = this.dialog.open(UserDialog, {
-      data: { mode: DialogMode.Add },
-      panelClass: 'user-dialog',
-      closeOnNavigation: false,
-    });
-
-    this.activeDialogRef = ref as MatDialogRef<UserDialog>;
-    this.pendingService.setActiveDialog(this.activeDialogRef);
-    ref.afterClosed().subscribe(() => {
-      this.activeDialogRef = null;
-      this.pendingService.clearActiveDialog();
-      this.pendingService.clear();
-    });
-    return ref as MatDialogRef<UserDialog>;
-  }
+  openAddDialog() {}
 
   // Called by router CanDeactivate guard
killedBy: UsersTable should call openAddDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "add"}, "panelClass": "user-dialog"}

Number of calls: 0

[Killed] ObjectLiteral
users/components/users-table/users-table.ts:179:13
 
   openAddDialog() {
     const ref = this.dialog.open(UserDialog, {
-      data: { mode: DialogMode.Add },
+      data: {},
       panelClass: 'user-dialog',
       closeOnNavigation: false,
killedBy: UsersTable should call openAddDialog with correct config
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function UserDialog], ObjectContaining {"closeOnNavigation": false, "data": ObjectContaining {"mode": "add"}, "panelClass": "user-dialog"}
Received: [Function UserDialog], {"closeOnNavigation": false, "data": {}, "panelClass": "user-dialog"}

Number of calls: 1

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:196:9
 
   // Called by router CanDeactivate guard
   canDeactivate(): boolean {
-    if (!this.activeDialogRef) return true;
+    if (false) return true;
     const inst = this.activeDialogRef.componentInstance as {
       hasUnsavedChanges?: () => boolean;
killedBy: UsersTable should return true from canDeactivate when no active dialog
statusReason: TypeError: Cannot read properties of null (reading 'componentInstance')

[Killed] BooleanLiteral
users/components/users-table/users-table.ts:204:23
       email?: { dirty?: boolean };
       isActive?: { dirty?: boolean };
     };
-    if (!inst) return true;
+    if (!inst) return false;
     let unsaved = false;
     if (typeof inst.hasUnsavedChanges === 'function') {
killedBy: UsersTable should return true from canDeactivate when componentInstance is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:206:9
     };
     if (!inst) return true;
     let unsaved = false;
-    if (typeof inst.hasUnsavedChanges === 'function') {
+    if (true) {
       unsaved = inst.hasUnsavedChanges();
     } else {
killedBy: UsersTable should return true from canDeactivate when no unsaved changes
statusReason: TypeError: inst.hasUnsavedChanges is not a function

[Killed] LogicalOperator
users/components/users-table/users-table.ts:210:9
       unsaved = inst.hasUnsavedChanges();
     } else {
       unsaved = !!(
-        inst.firstName?.dirty ||
-        inst.lastName?.dirty ||
-        inst.email?.dirty ||
+        (inst.firstName?.dirty || inst.lastName?.dirty) && inst.email?.dirty ||
         inst.isActive?.dirty
       );
killedBy: UsersTable should fallback to checking individual field dirty state when hasUnsavedChanges not available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:210:9
       unsaved = inst.hasUnsavedChanges();
     } else {
       unsaved = !!(
-        inst.firstName?.dirty ||
-        inst.lastName?.dirty ||
-        inst.email?.dirty ||
-        inst.isActive?.dirty
+        true
       );
     }
killedBy: UsersTable should return true from canDeactivate when no unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:216:9
         inst.isActive?.dirty
       );
     }
-    if (!unsaved) return true;
+    if (true) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
     if (confirmLeave) {
killedBy: UsersTable should return false from canDeactivate when has unsaved changes and user cancels
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:216:9
         inst.isActive?.dirty
       );
     }
-    if (!unsaved) return true;
+    if (false) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
     if (confirmLeave) {
killedBy: UsersTable should return true from canDeactivate when no unsaved changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
users/components/users-table/users-table.ts:218:23
     }
     if (!unsaved) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
-    if (confirmLeave) {
-      try {
-        this.activeDialogRef.close();
-      } catch {
-        /* ignore */
-      }
-    }
+    if (confirmLeave) {}
     return confirmLeave;
   }
killedBy: UsersTable should close dialog when user confirms leave with unsaved changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
users/components/users-table/users-table.ts:219:11
     if (!unsaved) return true;
     const confirmLeave = window.confirm('You have unsaved changes. Leave without saving?');
     if (confirmLeave) {
-      try {
-        this.activeDialogRef.close();
-      } catch {
+      try {} catch {
         /* ignore */
       }
killedBy: UsersTable should close dialog when user confirms leave with unsaved changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
users/components/users-table/users-table.ts:228:24
     return confirmLeave;
   }
 
-  viewUser(user: User) {
-    this.router.navigate([user.id], { relativeTo: this.route });
-  }
+  viewUser(user: User) {}
 
   addUser() {
killedBy: UsersTable should open view dialog via router
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [1], {"relativeTo": {"snapshot": {"firstChild": null, "paramMap": {"get": [Function get]}, "url": []}}}

Number of calls: 0

[Killed] BlockStatement
users/components/users-table/users-table.ts:232:13
     this.router.navigate([user.id], { relativeTo: this.route });
   }
 
-  addUser() {
-    this.router.navigate(['new'], { relativeTo: this.route });
-  }
+  addUser() {}
 
   editUser() {
killedBy: UsersTable should navigate to add user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["new"], {"relativeTo": {"snapshot": {"firstChild": null, "paramMap": {"get": [Function get]}, "url": []}}}

Number of calls: 0
