[Killed] StringLiteral
users/components/users-table/users-table.ts:233:27
   }
 
   addUser() {
-    this.router.navigate(['new'], { relativeTo: this.route });
+    this.router.navigate([""], { relativeTo: this.route });
   }
 
killedBy: UsersTable should navigate to add user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "new",
+   "",

[Killed] ArrayDeclaration
users/components/users-table/users-table.ts:233:26
   }
 
   addUser() {
-    this.router.navigate(['new'], { relativeTo: this.route });
+    this.router.navigate([], { relativeTo: this.route });
   }
 
killedBy: UsersTable should navigate to add user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "new",
- ]

[Killed] BlockStatement
users/components/users-table/users-table.ts:236:14
     this.router.navigate(['new'], { relativeTo: this.route });
   }
 
-  editUser() {
-    if (this.selection.selected.length !== 1) return;
-    this.router.navigate([this.selection.selected[0].id, 'edit'], { relativeTo: this.route });
-  }
+  editUser() {}
 
   deleteUsers() {
killedBy: UsersTable should edit selected user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [1, "edit"], {"relativeTo": {"snapshot": {"firstChild": null, "paramMap": {"get": [Function get]}, "url": []}}}

Number of calls: 0

[Killed] EqualityOperator
users/components/users-table/users-table.ts:237:9
   }
 
   editUser() {
-    if (this.selection.selected.length !== 1) return;
+    if (this.selection.selected.length === 1) return;
     this.router.navigate([this.selection.selected[0].id, 'edit'], { relativeTo: this.route });
   }
killedBy: UsersTable should edit selected user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [1, "edit"], {"relativeTo": {"snapshot": {"firstChild": null, "paramMap": {"get": [Function get]}, "url": []}}}

Number of calls: 0

[Killed] ConditionalExpression
users/components/users-table/users-table.ts:237:9
   }
 
   editUser() {
-    if (this.selection.selected.length !== 1) return;
+    if (false) return;
     this.router.navigate([this.selection.selected[0].id, 'edit'], { relativeTo: this.route });
   }
killedBy: UsersTable should not edit when no user selected
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
users/components/users-table/users-table.ts:238:67
 
   editUser() {
     if (this.selection.selected.length !== 1) return;
-    this.router.navigate([this.selection.selected[0].id, 'edit'], { relativeTo: this.route });
+    this.router.navigate([this.selection.selected[0].id, 'edit'], {});
   }
 
killedBy: UsersTable should edit selected user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [1, "edit"],
- Object {
-   "relativeTo": Object {

[Killed] BlockStatement
users/components/users-table/users-table.ts:241:17
     this.router.navigate([this.selection.selected[0].id, 'edit'], { relativeTo: this.route });
   }
 
-  deleteUsers() {
-    const dialogData: ConfirmationDialogData = {
-      title: 'Delete users',
-      message: 'Do you really want to delete these users?',
-      confirmText: 'Delete',
-      cancelText: 'Cancel',
-    };
-
-    const dialogRef = this.dialog.open(ConfirmationDialog, {
-      data: dialogData,
-    });
-
-    dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
-
-      this.userService.deleteUsers(this.selection.selected.map(r => r.id));
-
-      this.selection.clear();
-      this.changeDetectorRef.markForCheck();
-    });
-  }
+  deleteUsers() {}
 }
 
killedBy: UsersTable should call deleteUsers and show confirmation dialog
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
users/components/users-table/users-table.ts:242:48
   }
 
   deleteUsers() {
-    const dialogData: ConfirmationDialogData = {
-      title: 'Delete users',
-      message: 'Do you really want to delete these users?',
-      confirmText: 'Delete',
-      cancelText: 'Cancel',
-    };
+    const dialogData: ConfirmationDialogData = {};
 
     const dialogRef = this.dialog.open(ConfirmationDialog, {
killedBy: UsersTable should open delete confirmation with correct dialog data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"data": {"cancelText": "Cancel", "confirmText": "Delete", "message": "Do you really want to delete these users?", "title": "Delete users"}}
Received: [Function ConfirmationDialog], {"data": {}}

Number of calls: 1

[Killed] ObjectLiteral
users/components/users-table/users-table.ts:249:60
       cancelText: 'Cancel',
     };
 
-    const dialogRef = this.dialog.open(ConfirmationDialog, {
-      data: dialogData,
-    });
+    const dialogRef = this.dialog.open(ConfirmationDialog, {});
 
     dialogRef.afterClosed().subscribe((confirmed: boolean) => {
killedBy: UsersTable should open delete confirmation with correct dialog data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, ObjectContaining {"data": {"cancelText": "Cancel", "confirmText": "Delete", "message": "Do you really want to delete these users?", "title": "Delete users"}}
Received: [Function ConfirmationDialog], {}

Number of calls: 1

[Killed] BlockStatement
users/components/users-table/users-table.ts:253:63
       data: dialogData,
     });
 
-    dialogRef.afterClosed().subscribe((confirmed: boolean) => {
-      if (!confirmed) return;
-
-      this.userService.deleteUsers(this.selection.selected.map(r => r.id));
-
-      this.selection.clear();
-      this.changeDetectorRef.markForCheck();
-    });
+    dialogRef.afterClosed().subscribe((confirmed: boolean) => {});
   }
 }
killedBy: UsersTable should delete users when user confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [1, 2]

Number of calls: 0

[Killed] ArrowFunction
users/components/users-table/users-table.ts:256:64
     dialogRef.afterClosed().subscribe((confirmed: boolean) => {
       if (!confirmed) return;
 
-      this.userService.deleteUsers(this.selection.selected.map(r => r.id));
+      this.userService.deleteUsers(this.selection.selected.map(() => undefined));
 
       this.selection.clear();
killedBy: UsersTable should delete users when user confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   1,
-   2,
