[Killed] BooleanLiteral
app/features/users/user.service.ts:18:20
 export class UserService {
   private usersUrl = 'api/users';
   users = signal<User[]>([]);
-  loading = signal(false);
+  loading = signal(true);
   error = signal<string | null>(null);
   private readonly http = inject(HttpClient);
killedBy: UserService should start with loading false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
app/features/users/user.service.ts:24:9
 
   loadUsers() {
     // Skip API call if users are already loaded
-    if (this.users().length > 0) {
+    if (this.users().length >= 0) {
       return;
     }
killedBy: UserService should load users from API
statusReason: Error: Expected one matching request for criteria "Match URL: api/users", found none.

[Killed] ConditionalExpression
app/features/users/user.service.ts:24:9
 
   loadUsers() {
     // Skip API call if users are already loaded
-    if (this.users().length > 0) {
+    if (false) {
       return;
     }
killedBy: UserService should skip loading if users already loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'method')

[Killed] BlockStatement
app/features/users/user.service.ts:34:22
     this.http
       .get<User[]>(this.usersUrl)
       .pipe(
-        tap(users => {
-          users.forEach(u => {
-            if (typeof u.isActive === 'string') {
-              u.isActive = u.isActive === 'true';
-            }
-          });
-          this.users.set(users);
-        }),
+        tap(users => {}),
         catchError(() => {
           this.error.set('Failed to load users');
killedBy: UserService should load users from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "email": "john@test.com",

[Killed] BlockStatement
app/features/users/user.service.ts:35:30
       .get<User[]>(this.usersUrl)
       .pipe(
         tap(users => {
-          users.forEach(u => {
-            if (typeof u.isActive === 'string') {
-              u.isActive = u.isActive === 'true';
-            }
-          });
+          users.forEach(u => {});
           this.users.set(users);
         }),
killedBy: UserService should convert string isActive to boolean on load
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] BlockStatement
app/features/users/user.service.ts:36:49
       .pipe(
         tap(users => {
           users.forEach(u => {
-            if (typeof u.isActive === 'string') {
-              u.isActive = u.isActive === 'true';
-            }
+            if (typeof u.isActive === 'string') {}
           });
           this.users.set(users);
killedBy: UserService should convert string isActive to boolean on load
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] ConditionalExpression
app/features/users/user.service.ts:36:17
       .pipe(
         tap(users => {
           users.forEach(u => {
-            if (typeof u.isActive === 'string') {
+            if (false) {
               u.isActive = u.isActive === 'true';
             }
killedBy: UserService should convert string isActive to boolean on load
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] EqualityOperator
app/features/users/user.service.ts:37:28
         tap(users => {
           users.forEach(u => {
             if (typeof u.isActive === 'string') {
-              u.isActive = u.isActive === 'true';
+              u.isActive = u.isActive !== 'true';
             }
           });
killedBy: UserService should convert string isActive to boolean on load
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
app/features/users/user.service.ts:37:28
         tap(users => {
           users.forEach(u => {
             if (typeof u.isActive === 'string') {
-              u.isActive = u.isActive === 'true';
+              u.isActive = false;
             }
           });
killedBy: UserService should convert string isActive to boolean on load
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/features/users/user.service.ts:42:26
           });
           this.users.set(users);
         }),
-        catchError(() => {
-          this.error.set('Failed to load users');
-          this.loading.set(false);
-          return of([]);
-        })
+        catchError(() => {})
       )
       .subscribe({
killedBy: UserService should set error on load failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to load users"
Received: null

[Survived] BooleanLiteral
app/features/users/user.service.ts:44:28
         }),
         catchError(() => {
           this.error.set('Failed to load users');
-          this.loading.set(false);
+          this.loading.set(true);
           return of([]);
         })

[Survived] ArrayDeclaration
app/features/users/user.service.ts:45:21
         catchError(() => {
           this.error.set('Failed to load users');
           this.loading.set(false);
-          return of([]);
+          return of(["Stryker was here"]);
         })
       )

[Killed] ObjectLiteral
app/features/users/user.service.ts:48:18
           return of([]);
         })
       )
-      .subscribe({
-        complete: () => this.loading.set(false),
-      });
+      .subscribe({});
   }
 
killedBy: UserService should load users from API
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/features/users/user.service.ts:53:23
       });
   }
 
-  addUser(user: User) {
-    this.http
-      .post<User>(this.usersUrl, user)
-      .pipe(
-        tap(newUser => {
-          const current = this.users();
-          this.users.set([...current, newUser]);
-        }),
-        catchError(() => {
-          this.error.set('Failed to add user');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  addUser(user: User) {}
 
   updateUser(user: User) {
killedBy: UserService should add a new user
statusReason: Error: Expected one matching request for criteria "Match URL: api/users", found none.

[Killed] BlockStatement
app/features/users/user.service.ts:57:24
     this.http
       .post<User>(this.usersUrl, user)
       .pipe(
-        tap(newUser => {
-          const current = this.users();
-          this.users.set([...current, newUser]);
-        }),
+        tap(newUser => {}),
         catchError(() => {
           this.error.set('Failed to add user');
killedBy: UserService should add a new user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -5,14 +5,6 @@
      "id": 1,
      "isActive": true,

[Killed] BlockStatement
app/features/users/user.service.ts:61:26
           const current = this.users();
           this.users.set([...current, newUser]);
         }),
-        catchError(() => {
-          this.error.set('Failed to add user');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: UserService should set error on add failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to add user"
Received: null

[Killed] BlockStatement
app/features/users/user.service.ts:69:26
       .subscribe();
   }
 
-  updateUser(user: User) {
-    this.http
-      .put<User>(`${this.usersUrl}/${user.id}`, user)
-      .pipe(
-        tap(() => {
-          const current = this.users();
-          const index = current.findIndex(u => u.id === user.id);
-          if (index !== -1) {
-            const updated = [...current];
-            updated[index] = user;
-            this.users.set(updated);
-          }
-        }),
-        catchError(() => {
-          this.error.set('Failed to update user');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  updateUser(user: User) {}
 
   deleteUsers(ids: number[]) {
killedBy: UserService should update an existing user
statusReason: Error: Expected one matching request for criteria "Match URL: api/users/1", found none.

[Killed] BlockStatement
app/features/users/user.service.ts:73:19
     this.http
       .put<User>(`${this.usersUrl}/${user.id}`, user)
       .pipe(
-        tap(() => {
-          const current = this.users();
-          const index = current.findIndex(u => u.id === user.id);
-          if (index !== -1) {
-            const updated = [...current];
-            updated[index] = user;
-            this.users.set(updated);
-          }
-        }),
+        tap(() => {}),
         catchError(() => {
           this.error.set('Failed to update user');
killedBy: UserService should update an existing user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Array [
    Object {

[Killed] ConditionalExpression
app/features/users/user.service.ts:75:48
       .pipe(
         tap(() => {
           const current = this.users();
-          const index = current.findIndex(u => u.id === user.id);
+          const index = current.findIndex(u => false);
           if (index !== -1) {
             const updated = [...current];
killedBy: UserService should update an existing user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Array [
    Object {

[Killed] EqualityOperator
app/features/users/user.service.ts:75:48
       .pipe(
         tap(() => {
           const current = this.users();
-          const index = current.findIndex(u => u.id === user.id);
+          const index = current.findIndex(u => u.id !== user.id);
           if (index !== -1) {
             const updated = [...current];
killedBy: UserService should update an existing user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    Object {
+     "email": "john@test.com",

[Killed] EqualityOperator
app/features/users/user.service.ts:76:15
         tap(() => {
           const current = this.users();
           const index = current.findIndex(u => u.id === user.id);
-          if (index !== -1) {
+          if (index === -1) {
             const updated = [...current];
             updated[index] = user;
killedBy: UserService should update an existing user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Array [
    Object {

[Killed] BlockStatement
app/features/users/user.service.ts:76:29
         tap(() => {
           const current = this.users();
           const index = current.findIndex(u => u.id === user.id);
-          if (index !== -1) {
-            const updated = [...current];
-            updated[index] = user;
-            this.users.set(updated);
-          }
+          if (index !== -1) {}
         }),
         catchError(() => {
killedBy: UserService should update an existing user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Array [
    Object {

[Killed] BlockStatement
app/features/users/user.service.ts:82:26
             this.users.set(updated);
           }
         }),
-        catchError(() => {
-          this.error.set('Failed to update user');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: UserService should set error on update failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to update user"
Received: null

[Killed] BlockStatement
app/features/users/user.service.ts:90:30
       .subscribe();
   }
 
-  deleteUsers(ids: number[]) {
-    this.http
-      .delete(this.usersUrl, { body: ids })
-      .pipe(
-        tap(() => {
-          const current = this.users();
-          this.users.set(current.filter(u => !ids.includes(u.id)));
-        }),
-        catchError(() => {
-          this.error.set('Failed to delete users');
-          return EMPTY;
-        })
-      )
-      .subscribe();
-  }
+  deleteUsers(ids: number[]) {}
 }
 
killedBy: UserService should delete users by ids
statusReason: Error: Expected one matching request for criteria "Match URL: api/users", found none.

[Killed] BlockStatement
app/features/users/user.service.ts:94:19
     this.http
       .delete(this.usersUrl, { body: ids })
       .pipe(
-        tap(() => {
-          const current = this.users();
-          this.users.set(current.filter(u => !ids.includes(u.id)));
-        }),
+        tap(() => {}),
         catchError(() => {
           this.error.set('Failed to delete users');
killedBy: UserService should delete users by ids
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 16

  Array [
    Object {
+     "email": "john@test.com",

[Killed] ArrowFunction
app/features/users/user.service.ts:96:41
       .pipe(
         tap(() => {
           const current = this.users();
-          this.users.set(current.filter(u => !ids.includes(u.id)));
+          this.users.set(current.filter(() => undefined));
         }),
         catchError(() => {
killedBy: UserService should delete users by ids
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "email": "jane@test.com",

[Killed] BooleanLiteral
app/features/users/user.service.ts:96:46
       .pipe(
         tap(() => {
           const current = this.users();
-          this.users.set(current.filter(u => !ids.includes(u.id)));
+          this.users.set(current.filter(u => ids.includes(u.id)));
         }),
         catchError(() => {
killedBy: UserService should delete users by ids
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  5
+ Received  + 13

  Array [
    Object {
-     "email": "jane@test.com",

[Killed] BlockStatement
app/features/users/user.service.ts:98:26
           const current = this.users();
           this.users.set(current.filter(u => !ids.includes(u.id)));
         }),
-        catchError(() => {
-          this.error.set('Failed to delete users');
-          return EMPTY;
-        })
+        catchError(() => {})
       )
       .subscribe();
killedBy: UserService should set error on delete failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to delete users"
Received: null
