[Survived] ArrayDeclaration
shared/components/base-table/base-table.ts:62:41
 })
 export class BaseTableComponent<T> implements AfterViewInit {
   // --- inputs (Angular 21 signal-based) ---
-  readonly columns = input<ColumnDef[]>([]);
+  readonly columns = input<ColumnDef[]>(["Stryker was here"]);
   readonly dataSource = input<MatTableDataSource<T>>(new MatTableDataSource());
   readonly selection = input<SelectionModel<T>>(new SelectionModel<T>(true, []));

[Survived] BooleanLiteral
shared/components/base-table/base-table.ts:64:71
   // --- inputs (Angular 21 signal-based) ---
   readonly columns = input<ColumnDef[]>([]);
   readonly dataSource = input<MatTableDataSource<T>>(new MatTableDataSource());
-  readonly selection = input<SelectionModel<T>>(new SelectionModel<T>(true, []));
+  readonly selection = input<SelectionModel<T>>(new SelectionModel<T>(false, []));
   readonly pageSizeOptions = input<number[]>([5, 10, 25, 50]);
   readonly filterValue = input('');

[Survived] StringLiteral
shared/components/base-table/base-table.ts:66:32
   readonly dataSource = input<MatTableDataSource<T>>(new MatTableDataSource());
   readonly selection = input<SelectionModel<T>>(new SelectionModel<T>(true, []));
   readonly pageSizeOptions = input<number[]>([5, 10, 25, 50]);
-  readonly filterValue = input('');
+  readonly filterValue = input("Stryker was here!");
   readonly addIcon = input<string | null>(null);
   readonly editIcon = input<string | null>(null);

[Killed] BooleanLiteral
shared/components/base-table/base-table.ts:73:38
   readonly addButtonLabel = input('Add');
   readonly editButtonLabel = input('Edit');
   readonly deleteButtonLabel = input('Delete');
-  readonly addButtonDisabled = input(false);
+  readonly addButtonDisabled = input(true);
   readonly editButtonDisabled = input(false);
   readonly deleteButtonDisabled = input(false);
killedBy: BaseTableComponent should have default disabled state as false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
shared/components/base-table/base-table.ts:74:39
   readonly editButtonLabel = input('Edit');
   readonly deleteButtonLabel = input('Delete');
   readonly addButtonDisabled = input(false);
-  readonly editButtonDisabled = input(false);
+  readonly editButtonDisabled = input(true);
   readonly deleteButtonDisabled = input(false);
   readonly cellTemplate = input<TemplateRef<unknown> | null>(null);
killedBy: BaseTableComponent should have default disabled state as false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
shared/components/base-table/base-table.ts:75:41
   readonly deleteButtonLabel = input('Delete');
   readonly addButtonDisabled = input(false);
   readonly editButtonDisabled = input(false);
-  readonly deleteButtonDisabled = input(false);
+  readonly deleteButtonDisabled = input(true);
   readonly cellTemplate = input<TemplateRef<unknown> | null>(null);
 
killedBy: BaseTableComponent should have default disabled state as false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
shared/components/base-table/base-table.ts:90:31
   @ViewChild(MatSort) sort!: MatSort;
   @ViewChild(MatPaginator) paginator!: MatPaginator;
 
-  displayedColumns = computed(() => ['select', ...this.columns().map(c => c.key)]);
+  displayedColumns = computed(() => undefined);
 
   isAllSelected(): boolean {
killedBy: BaseTableComponent should have displayed columns including select
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArrowFunction
shared/components/base-table/base-table.ts:90:70
   @ViewChild(MatSort) sort!: MatSort;
   @ViewChild(MatPaginator) paginator!: MatPaginator;
 
-  displayedColumns = computed(() => ['select', ...this.columns().map(c => c.key)]);
+  displayedColumns = computed(() => ['select', ...this.columns().map(() => undefined)]);
 
   isAllSelected(): boolean {
killedBy: UsersTable should create
statusReason: Error: Could not find column with id "undefined".

[Killed] BlockStatement
shared/components/base-table/base-table.ts:92:28
 
   displayedColumns = computed(() => ['select', ...this.columns().map(c => c.key)]);
 
-  isAllSelected(): boolean {
-    const numSelected = this.selection().selected.length;
-    const numRows = this.dataSource().data.length;
-    return numSelected === numRows;
-  }
+  isAllSelected(): boolean {}
 
   toggleAllRows(): void {
killedBy: BaseTableComponent should return true when all rows are selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
shared/components/base-table/base-table.ts:95:12
   isAllSelected(): boolean {
     const numSelected = this.selection().selected.length;
     const numRows = this.dataSource().data.length;
-    return numSelected === numRows;
+    return false;
   }
 
killedBy: BaseTableComponent should return true when all rows are selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
shared/components/base-table/base-table.ts:95:12
   isAllSelected(): boolean {
     const numSelected = this.selection().selected.length;
     const numRows = this.dataSource().data.length;
-    return numSelected === numRows;
+    return true;
   }
 
killedBy: BaseTableComponent should return false when not all rows are selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
shared/components/base-table/base-table.ts:98:25
     return numSelected === numRows;
   }
 
-  toggleAllRows(): void {
-    if (this.isAllSelected()) {
-      this.selection().clear();
-    } else {
-      this.dataSource().data.forEach(row => this.selection().select(row));
-    }
-  }
+  toggleAllRows(): void {}
 
   ngAfterViewInit(): void {
killedBy: BaseTableComponent should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
shared/components/base-table/base-table.ts:99:9
   }
 
   toggleAllRows(): void {
-    if (this.isAllSelected()) {
+    if (false) {
       this.selection().clear();
     } else {
killedBy: BaseTableComponent should toggle all rows - deselect all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
shared/components/base-table/base-table.ts:99:9
   }
 
   toggleAllRows(): void {
-    if (this.isAllSelected()) {
+    if (true) {
       this.selection().clear();
     } else {
killedBy: BaseTableComponent should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
shared/components/base-table/base-table.ts:101:12
   toggleAllRows(): void {
     if (this.isAllSelected()) {
       this.selection().clear();
-    } else {
-      this.dataSource().data.forEach(row => this.selection().select(row));
-    }
+    } else {}
   }
 
killedBy: BaseTableComponent should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
shared/components/base-table/base-table.ts:102:38
     if (this.isAllSelected()) {
       this.selection().clear();
     } else {
-      this.dataSource().data.forEach(row => this.selection().select(row));
+      this.dataSource().data.forEach(() => undefined);
     }
   }
killedBy: BaseTableComponent should toggle all rows - select all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] BlockStatement
shared/components/base-table/base-table.ts:106:27
     }
   }
 
-  ngAfterViewInit(): void {
-    this.dataSource().sort = this.sort;
-    this.dataSource().paginator = this.paginator;
-  }
+  ngAfterViewInit(): void {}
 
   onFilterChange(event: Event): void {

[Killed] BlockStatement
shared/components/base-table/base-table.ts:111:38
     this.dataSource().paginator = this.paginator;
   }
 
-  onFilterChange(event: Event): void {
-    const value = (event.target as HTMLInputElement)?.value ?? '';
-    this.dataSource().filter = value.trim().toLowerCase();
-    this.filterChange.emit(value.trim().toLowerCase());
-  }
+  onFilterChange(event: Event): void {}
 
   onEdit(): void {
killedBy: BaseTableComponent should apply filter with trim and lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: ""

[Killed] LogicalOperator
shared/components/base-table/base-table.ts:112:19
   }
 
   onFilterChange(event: Event): void {
-    const value = (event.target as HTMLInputElement)?.value ?? '';
+    const value = (event.target as HTMLInputElement)?.value && '';
     this.dataSource().filter = value.trim().toLowerCase();
     this.filterChange.emit(value.trim().toLowerCase());
killedBy: BaseTableComponent should apply filter with trim and lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: ""

[Killed] OptionalChaining
shared/components/base-table/base-table.ts:112:19
   }
 
   onFilterChange(event: Event): void {
-    const value = (event.target as HTMLInputElement)?.value ?? '';
+    const value = (event.target as HTMLInputElement).value ?? '';
     this.dataSource().filter = value.trim().toLowerCase();
     this.filterChange.emit(value.trim().toLowerCase());
killedBy: BaseTableComponent should handle filter with null target
statusReason: TypeError: Cannot read properties of null (reading 'value')

[Killed] MethodExpression
shared/components/base-table/base-table.ts:113:32
 
   onFilterChange(event: Event): void {
     const value = (event.target as HTMLInputElement)?.value ?? '';
-    this.dataSource().filter = value.trim().toLowerCase();
+    this.dataSource().filter = value.toLowerCase();
     this.filterChange.emit(value.trim().toLowerCase());
   }
killedBy: BaseTableComponent should apply filter with trim and lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: "  test  "

[Killed] MethodExpression
shared/components/base-table/base-table.ts:113:32
 
   onFilterChange(event: Event): void {
     const value = (event.target as HTMLInputElement)?.value ?? '';
-    this.dataSource().filter = value.trim().toLowerCase();
+    this.dataSource().filter = value.trim().toUpperCase();
     this.filterChange.emit(value.trim().toLowerCase());
   }
killedBy: BaseTableComponent should apply filter with trim and lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: "TEST"

[Killed] MethodExpression
shared/components/base-table/base-table.ts:114:28
   onFilterChange(event: Event): void {
     const value = (event.target as HTMLInputElement)?.value ?? '';
     this.dataSource().filter = value.trim().toLowerCase();
-    this.filterChange.emit(value.trim().toLowerCase());
+    this.filterChange.emit(value.trim().toUpperCase());
   }
 
killedBy: BaseTableComponent should emit filterChange when filter changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "hello"
Received: "HELLO"

Number of calls: 1

[Survived] MethodExpression
shared/components/base-table/base-table.ts:114:28
   onFilterChange(event: Event): void {
     const value = (event.target as HTMLInputElement)?.value ?? '';
     this.dataSource().filter = value.trim().toLowerCase();
-    this.filterChange.emit(value.trim().toLowerCase());
+    this.filterChange.emit(value.toLowerCase());
   }
 

[Killed] BlockStatement
shared/components/base-table/base-table.ts:117:18
     this.filterChange.emit(value.trim().toLowerCase());
   }
 
-  onEdit(): void {
-    if (this.selection().selected.length !== 1) return;
-    this.edit.emit();
-  }
+  onEdit(): void {}
 
   onDelete(): void {
killedBy: BaseTableComponent should emit edit only when exactly one row is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
shared/components/base-table/base-table.ts:118:9
   }
 
   onEdit(): void {
-    if (this.selection().selected.length !== 1) return;
+    if (false) return;
     this.edit.emit();
   }
killedBy: BaseTableComponent should emit edit only when exactly one row is selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] EqualityOperator
shared/components/base-table/base-table.ts:118:9
   }
 
   onEdit(): void {
-    if (this.selection().selected.length !== 1) return;
+    if (this.selection().selected.length === 1) return;
     this.edit.emit();
   }
killedBy: BaseTableComponent should emit edit only when exactly one row is selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
shared/components/base-table/base-table.ts:122:20
     this.edit.emit();
   }
 
-  onDelete(): void {
-    if (this.selection().selected.length === 0) return;
-    this.delete.emit();
-  }
+  onDelete(): void {}
 }
 
killedBy: BaseTableComponent should emit delete only when at least one row is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
shared/components/base-table/base-table.ts:123:9
   }
 
   onDelete(): void {
-    if (this.selection().selected.length === 0) return;
+    if (false) return;
     this.delete.emit();
   }
killedBy: BaseTableComponent should emit delete only when at least one row is selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] EqualityOperator
shared/components/base-table/base-table.ts:123:9
   }
 
   onDelete(): void {
-    if (this.selection().selected.length === 0) return;
+    if (this.selection().selected.length !== 0) return;
     this.delete.emit();
   }
killedBy: BaseTableComponent should emit delete only when at least one row is selected
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments
