[Killed] ArrowFunction
shared/components/cart-icon/cart-icon.ts:18:38
 export class CartIcon implements OnInit, OnDestroy {
   cartItemCount = 0;
 
-  private readonly storageListener = () => this.loadCartCount();
+  private readonly storageListener = () => undefined;
 
   ngOnInit(): void {
killedBy: CartIcon should update cartItemCount when storage event fires
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
shared/components/cart-icon/cart-icon.ts:20:20
 
   private readonly storageListener = () => this.loadCartCount();
 
-  ngOnInit(): void {
-    this.loadCartCount();
-    window.addEventListener('storage', this.storageListener);
-  }
+  ngOnInit(): void {}
 
   ngOnDestroy(): void {
killedBy: CartIcon should add storage event listener on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "storage", Any<Function>

Number of calls: 0

[Killed] StringLiteral
shared/components/cart-icon/cart-icon.ts:22:29
 
   ngOnInit(): void {
     this.loadCartCount();
-    window.addEventListener('storage', this.storageListener);
+    window.addEventListener("", this.storageListener);
   }
 
killedBy: CartIcon should add storage event listener on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "storage", Any<Function>
Received: "", [Function anonymous]

Number of calls: 1

[Killed] BlockStatement
shared/components/cart-icon/cart-icon.ts:25:23
     window.addEventListener('storage', this.storageListener);
   }
 
-  ngOnDestroy(): void {
-    window.removeEventListener('storage', this.storageListener);
-  }
+  ngOnDestroy(): void {}
 
   loadCartCount(): void {
killedBy: CartIcon should remove storage event listener on destroy
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "storage", Any<Function>

Number of calls: 0
